{
    "category": "Banana Cakes",
    "recipes": [
        {
            "name": "Chocolate Banana Cream Cake",
            "expert": "My inspiration for this cake came from my desire to create a dessert combining my father’s love for cake, my mother’s love for chocolate and my love for bananas. It’s divine! —Susie Pattison, Dublin, Ohio",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/4 cups sugar",
                "2 large eggs, separated",
                "1-1/2 cups mashed ripe bananas (about 3 medium)",
                "1/4 cup sour cream",
                "2 teaspoons vanilla extract",
                "1-1/2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/4 teaspoon salt",
                "FILLING/FROSTING:",
                "1-1/2 cups cold 2% milk",
                "1 package (3.4 ounces) instant banana cream pudding mix",
                "1 can (16 ounces) chocolate frosting",
                "2 medium firm bananas, sliced",
                "3 tablespoons lemon juice"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in egg yolks. Beat in the bananas, sour cream and vanilla. Combine the flour, baking soda and salt; add to the creamed mixture and mix well.",
                "In a small bowl, beat egg whites until stiff peaks form. Fold into batter. Transfer to two greased and floured 9-in. round baking pans. Bake at 350° for 20-25 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For filling, in a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Cover and refrigerate until chilled.",
                "In a small bowl, beat frosting until light and fluffy. Place bananas in a small bowl; toss with lemon juice.",
                "Place one cake layer on a serving plate; spread with 3 tablespoons frosting. Stir pudding; spread half over the frosting. Top with half of the bananas and the remaining cake layer. Repeat frosting, filling and banana layers. Frost sides and decorate top edge of cake with remaining frosting. Store in the refrigerator."
            ],
            "nutrition": "1 slice: 490 calories, 20g fat (10g saturated fat), 62mg cholesterol, 459mg sodium, 74g carbohydrate (52g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Moist Banana Cupcakes",
            "expert": "I got this recipe my mother-in-law more than 40 years ago. They taste as good today as they did back then!—Arloia Lutz, Sebewaing, Michigan",
            "time": "Prep: 15 min. Bake: 20 min. + cooling",
            "makes": "1 dozen",
            "ingredients": [
                "1/3 cup shortening",
                "2/3 cup sugar",
                "1 egg",
                "1 teaspoon vanilla extract",
                "3/4 cup mashed ripe bananas (about 2 small bananas)",
                "1-1/3 cups cake flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon ground cinnamon",
                "1/2 teaspoon ground cloves",
                "1/4 teaspoon ground nutmeg",
                "1 tablespoon confectioners' sugar"
            ],
            "directions": [
                "In a large bowl, cream shortening and sugar until light and fluffy. Beat in the egg, vanilla and bananas. Combine the flour, baking powder, salt, baking soda, cinnamon, cloves and nutmeg; add to the creamed mixture just until combined.",
                "Fill paper-lined muffin cups two-thirds full. Bake at 375° for 18-20 minutes or until a toothpick comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely. Dust with confectioners' sugar."
            ],
            "nutrition": "1 each: 154 calories, 6g fat (2g saturated fat), 18mg cholesterol, 175mg sodium, 24g carbohydrate, 1g fiber), 2g protein."
        },
        {
            "name": "Banana Bread Snack Cakes",
            "expert": "This banana bread snack cake doesn't need any frosting—just a dusting of powdered sugar. Guests are always amazed that I made this treat from scratch. —Denise Loewenthal, Hinckley, Ohio",
            "time": "Prep: 10 min. Bake: 30 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "1-2/3 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1 cup packed brown sugar",
                "1/2 cup water",
                "1/3 cup mashed ripe bananas (about 1 small)",
                "1/3 cup canola oil",
                "1/2 teaspoon vanilla extract",
                "Confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350&deg;. In a bowl, combine flour and baking soda. In another bowl, whisk brown sugar, water, banana, oil and vanilla. Stir into dry ingredients just until moistened. Transfer to a greased 8-in. square baking pan.",
                "Bake until a toothpick inserted in the center comes out clean, 30-35 minutes. Cool on a wire rack. Dust cake with confectioners' sugar. Cut into 9 pieces."
            ],
            "nutrition": "1 piece: 259 calories, 9g fat (1g saturated fat), 0 cholesterol, 147mg sodium, 44g carbohydrate (25g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Cake with Chocolate Frosting",
            "expert": "I always requested banana cake with fudge frosting for my birthday. Mom’s recipe is attached to my fridge—and my heart. It’s funny how many memories live on in a stained handwritten recipe card. On a more practical note: It's important to make sure the whipped cream cheese is truly at room temperature before you use it. If not, it chills the softened butter and makes for lumpy frosting. —Jeanne Ambrose, Milwaukee, Wisconsin",
            "time": "Prep: 45 min. Bake: 45 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "3/4 cup unsalted butter, softened",
                "2 cups sugar",
                "3 large eggs",
                "1-1/2 cups mashed ripe bananas (2 to 3 large)",
                "1-1/2 teaspoons vanilla extract",
                "3 cups all-purpose flour",
                "1-1/2 teaspoons baking powder",
                "1-1/2 teaspoons baking soda",
                "1 teaspoon salt",
                "3/4 cup buttermilk",
                "3/4 cup chopped unsalted pistachios, toasted",
                "CREAM CHEESE FROSTING:",
                "2 containers (8 ounces each) whipped cream cheese, room temperature",
                "1/2 cup butter, softened",
                "1/2 cup baking cocoa",
                "4-1/2 cups confectioners' sugar",
                "2 teaspoons vanilla extract",
                "Additional chopped unsalted pistachios, toasted, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in bananas and vanilla. Combine flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. Fold in 3/4 cup pistachios.",
                "Transfer to two greased and floured 8-in. round baking pans. Bake 45-55 minutes or until a toothpick inserted in center comes out clean. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a large bowl, beat cream cheese and butter until smooth. Add cocoa; mix until blended. Add confectioners' sugar and vanilla; beat until creamy.",
                "Place one cake layer on a serving plate; spread top with 1 cup frosting. Top with remaining cake. Spread top and sides with 2 cups frosting. Press pistachios into sides of cake if desired.",
                "Cut a small hole in the corner of a large pastry or plastic bag; insert #127 petal pastry tip. Fill the bag with remaining frosting. Pipe concentric circles of frosting over top of cake. Refrigerate for at least 1 hour or until frosting is set."
            ],
            "nutrition": "1 slice: 606 calories, 28g fat (16g saturated fat), 111mg cholesterol, 510mg sodium, 85g carbohydrate (62g sugars, 2g fiber), 7g protein."
        },
        {},
        {
            "name": "Banana-Nut Bundt Cake",
            "expert": "Each slice of this cake has a temptingly tropical twist. If you'd like, sprinkle confectioners' sugar over the top. —June Yeates, Bradley, Illinois",
            "time": "Prep: 15 min. Bake: 1 hour + cooling",
            "makes": "16 servings",
            "ingredients": [
                "3 cups all-purpose flour",
                "2 cups sugar",
                "1 teaspoon baking soda",
                "1 teaspoon ground cinnamon",
                "3 large eggs, room temperature, beaten",
                "1 cup canola oil",
                "2 cups finely chopped ripe bananas (about 3 medium)",
                "1 can (8 ounces) crushed pineapple, undrained",
                "1-1/2 teaspoons vanilla extract",
                "1/2 cup sweetened shredded coconut",
                "1 cup chopped nuts",
                "Optional: Confectioners' sugar, whipped cream and sliced ripe banana"
            ],
            "directions": [
                "In a large bowl, combine the flour, sugar, baking soda and cinnamon. In another bowl, combine the eggs, oil, bananas, pineapple and vanilla; stir into dry ingredients just until combined. Fold in coconut and nuts. Pour into a greased 10-in. fluted tube pan.",
                "Bake at 350° for 60-70 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing cake from pan to a wire rack to cool completely. If desired, serve with confectioners' sugar, whipped cream and bananas."
            ],
            "nutrition": "1 slice: 408 calories, 20g fat (3g saturated fat), 40mg cholesterol, 99mg sodium, 53g carbohydrate (32g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Banana Skillet Upside-Down Cake",
            "expert": "My grandmother gave me my first cast iron skillet, and I've been cooking and baking with it ever since. Sometimes I add drained maraschino cherries to this banana skillet dessert and serve it with a ice cream. —Terri Merritts, Nashville, Tennessee",
            "time": "Prep: 25 min. Bake 35 min.",
            "makes": "10 servings",
            "ingredients": [
                "1 package (14 ounces) banana quick bread and muffin mix",
                "1/2 cup chopped walnuts",
                "1/4 cup butter, cubed",
                "3/4 cup packed brown sugar",
                "2 tablespoons lemon juice",
                "4 medium bananas, cut into 1/4-inch slices",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 375&deg. Prepare banana bread batter according to package directions; stir in walnuts.",
                "In a 10-in. ovenproof skillet, melt butter over medium heat; stir in brown sugar until dissolved. Add lemon juice; cook and stir until slightly thickened, 2-3 minutes longer. Remove from heat. Arrange bananas in a single layer over brown sugar mixture; sprinkle with coconut.",
                "Spoon prepared batter over coconut. Bake until dark golden and a toothpick inserted in center comes out clean, 35-40 minutes. Cool 5 minutes before inverting onto a serving plate. Serve warm."
            ],
            "nutrition": "1 piece: 554 calories, 22g fat (10g saturated fat), 49mg cholesterol, 459mg sodium, 82g carbohydrate (30g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Grandma Riley’s Banana Cake",
            "expert": "This favorite recipe has been passed down through my husband’s family. His grandmother wrote this out for me shortly after we were married. She copied it from a recipe that her mother had written out for her many years before. These handwritten treasures in my recipe box bring back so many fond memories. —Jamie Dunn, Milwaukee, Wisconsin",
            "time": "Prep: 15 min. + cooling. Cook: 25 min.",
            "makes": "12 servings",
            "ingredients": [
                "1-1/2 cups sugar",
                "1/2 cup shortening",
                "2 eggs",
                "1 teaspoon vanilla",
                "1/2 cup buttermilk",
                "3 mashed bananas",
                "2 cups flour",
                "1 teaspoon baking soda",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "FROSTING:",
                "1/2 cup butter, softened",
                "2-1/2 cups powdered sugar",
                "3 tablespoons milk",
                "1 teaspoon vanilla",
                "Dash of salt"
            ],
            "directions": [
                "Cream sugar and shortening together; add eggs and vanilla. Mix in buttermilk and mashed bananas.",
                "In a separate bowl, combine flour, soda, baking powder and salt; add to banana mixture and mix until ingredients are combined. Spoon into a greased 13x9-in. baking pan or two 9-in. round cake pans.",
                "Bake at 350° for 25-30 minutes or until toothpick inserted into center comes out clean. Cool cake for 30 minutes before frosting.",
                "For frosting, mix butter, powdered sugar and milk until smooth; add vanilla and salt. If frosting is too thick, add more milk 1 tsp. at a time until reaching desired consistency. Spread on warm banana cake."
            ],
            "nutrition": ""
        },
        {
            "name": "Banana Cake with Cream Cheese Frosting",
            "expert": "As a mother of three sons, sweets are a staple in my kitchen! I buy ripe fruit on sale and freeze it to make this cake. My banana cake with cream cheese frosting is a favorite among loved ones at my family picnics and dinners. —Bonnie Krause, Irvona, Pennsylvania",
            "time": "Prep: 25 min. Bake: 30 min. + cooling",
            "makes": "18 servings",
            "ingredients": [
                "2/3 cup shortening",
                "1-1/2 cups sugar",
                "2 large eggs, separated, room temperature",
                "2 cups mashed bananas (about 4 medium)",
                "1 cup 2% milk",
                "3 cups all-purpose flour",
                "1-1/4 teaspoons baking powder",
                "1-1/4 teaspoons baking soda",
                "1/2 teaspoon salt",
                "CREAM CHEESE FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "4 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "Dash salt",
                "Sliced banana, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Add egg yolks, 1 at a time, beating well after each addition. Add bananas and milk; mix just until combined. Combine flour, baking powder, baking soda and salt. Add to  creamed mixture just until blended.",
                "In another bowl, beat egg whites until soft peaks form. Fold into batter. Pour into a greased 13x9-in. baking pan. Bake until a toothpick inserted in the center comes out clean, 30-35 minutes. Cool completely on a wire rack.",
                "In a large bowl, beat cream cheese and butter until fluffy. Add the confectioners’ sugar, vanilla and salt; beat until smooth. Spread over cake. Store in the refrigerator. If desired, serve with sliced bananas."
            ],
            "nutrition": "1 piece: 416 calories, 15g fat (6g saturated fat), 42mg cholesterol, 269mg sodium, 66g carbohydrate (47g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Banana Cupcakes",
            "expert": "This recipe was given to me by my mother, and I've since handed it down to my daughters. The moist cupcakes are topped with frosting that comes together in no time. And if you'd like even more banana taste, stir some mashed banana into it. —Wanda Thole, Leonard, Minnesota",
            "time": "Prep: 20 min. Bake: 15 min.",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "1/2 cup shortening",
                "1-1/2 cups sugar",
                "2 large eggs",
                "1 teaspoon vanilla extract",
                "1 cup mashed ripe bananas (about 2 medium)",
                "2 cups all-purpose flour",
                "1 teaspoon baking powder",
                "3/4 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1/4 cup buttermilk",
                "FROSTING:",
                "1/2 cup butter, softened",
                "2-1/2 cups confectioners' sugar",
                "3 to 4 tablespoons milk",
                "Colored sprinkles, optional"
            ],
            "directions": [
                "In a large bowl, cream shortening and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in vanilla and bananas. Combine the flour, baking powder, baking soda and salt; add to banana mixture alternately with buttermilk, beating well after each addition.",
                "Fill 18 paper-lined muffin cups two-thirds full. Bake at 350° for 15-20 minutes or until a toothpick inserted in the center comes out clean. Remove to wire racks to cool completely.",
                "In a small bowl, cream butter and confectioners' sugar until light and fluffy; add enough milk to achieve desired spreading consistency. Frost cupcakes. Garnish with sprinkles if desired."
            ],
            "nutrition": "1 each: 297 calories, 11g fat (5g saturated fat), 38mg cholesterol, 204mg sodium, 47g carbohydrate (35g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Blue Ribbon Banana Cake",
            "expert": "This recipe is a great way to use over-ripe bananas. I throw over-ripe bananas in the freezer for this recipe and other banana baking recipes.—Cathy Winter, Granton, Wisconsin",
            "time": "Prep: 30 min. Bake: 25 min.",
            "makes": "12 servings",
            "ingredients": [
                "3/4 cup butter, softened",
                "1-1/2 cups sugar",
                "2 large eggs",
                "1 cup mashed ripe bananas",
                "2 cups sifted cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1/2 cup buttermilk",
                "1 teaspoon vanilla extract",
                "1/2 cup chopped pecans",
                "1 cup sweetened shredded coconut, divided",
                "CREAMY NUT FILLING:",
                "3/4 cup sugar",
                "3 tablespoons all-purpose flour",
                "3/4 cup heavy whipping cream",
                "1/2 teaspoon salt",
                "3 tablespoons butter",
                "3/4 cup chopped pecans, toasted",
                "1 teaspoon vanilla extract",
                "CREAMY WHITE FROSTING:",
                "1/2 cup shortening",
                "1/2 cup butter, softened",
                "1 teaspoon vanilla extract",
                "1 teaspoon almonds extract",
                "4 cups confectioners' sugar",
                "3 to 4 tablespoons whole milk"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until fluffy. Add eggs, beat 2 minutes. Add bananas; beat 2 minutes longer. Set aside. Sift together flour, baking soda and salt; add to creamed mixture alternately with buttermilk and vanilla. Beat well. Stir in pecans.",
                "Pour into two lightly greased 9-in. round baking pans. Sprinkle with 1/2 cup coconut. Bake at 350° for 25-30 minutes. Remove cakes from the pan and cool, coconut side up, on wire racks.",
                "For filling, combine sugar, flour, cream, salt and butter in a saucepan. Cook over medium heat until thickened. Stir in pecans and vanilla. Cool. Spread filling over the bottom (plain side) of one cake layer. Place remaining cake layer, coconut side up, on top of filling.",
                "In a bowl, combine frosting ingredients; beat until smooth. Place a 3-in. circle in the center of the cake top. Frost sides and top edges of cake. Remove the circle to expose coconut."
            ],
            "nutrition": "1 slice: 872 calories, 48g fat (23g saturated fat), 115mg cholesterol, 574mg sodium, 108g carbohydrate (82g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Triple-Layer Banana Cake",
            "expert": "A year-round family favorite, the recipe for this moist layer cake was passed on to me by my mother. My grandchildren can't keep their fingers out of the icing, which tastes just like peanut butter fudge.",
            "time": "Prep: 20 min. Bake: 25 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "3/4 cup butter, softened",
                "2 cups sugar",
                "3 eggs",
                "1-1/2 cups mashed ripe bananas (about 3 medium)",
                "1-1/2 teaspoons vanilla extract",
                "3 cups all-purpose flour",
                "1-1/2 teaspoons baking powder",
                "1-1/2 teaspoons baking soda",
                "3/4 teaspoon salt",
                "1 cup buttermilk",
                "FROSTING:",
                "6 tablespoons peanut butter",
                "3 tablespoons butter, softened",
                "5-1/4 cups confectioners' sugar",
                "8 to 10 tablespoons 2% milk",
                "Peanut halves, optional"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in bananas and vanilla. Combine the flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Pour into three greased and floured 9-in. round baking pans. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a large bowl, beat the peanut butter and butter until smooth. Beat in confectioners' sugar and enough milk to achieve spreading consistency. Frost between layers and over top and sides of cake. Garnish with peanuts if desired."
            ],
            "nutrition": "1 slice: 583 calories, 18g fat (9g saturated fat), 80mg cholesterol, 498mg sodium, 102g carbohydrate (76g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Marshmallow-Filled Banana Cupcakes",
            "expert": "A friend gave me this recipe when I first moved into my neighborhood 40 years ago. It might seem more time consuming than it is, but it's easy and the results are incredible. —Monique Caron, Buxton, Maine",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "3/4 cup shortening",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "1 cup mashed ripe bananas (about 2 medium)",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/4 cup buttermilk",
                "FILLING:",
                "1 cup butter, softened",
                "2 cups marshmallow creme",
                "1-1/2 cups confectioners' sugar",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 375°. Line 18 muffin cups with paper or foil liners.",
                "In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in bananas and vanilla. In another bowl, whisk flour, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Fill prepared cups two-thirds full. Bake 18-22 minutes or until a toothpick inserted in center comes out clean. Cool in pans 10 minutes before removing to wire racks to cool completely.",
                "For filling, in a large bowl, beat butter, marshmallow creme and confectioners' sugar until smooth. Using a sharp knife, cut a 1-in. circle, 1 in. deep, in top of each cupcake. Carefully remove cut portion and set aside. Fill cavity with about 1 teaspoon filling. Replace tops, pressing down lightly. Dollop or pipe remaining filling over tops. Dust with additional confectioners' sugar."
            ],
            "nutrition": "1 cupcake: 373 calories, 19g fat (9g saturated fat), 50mg cholesterol, 195mg sodium, 49g carbohydrate (35g sugars, 1g fiber), 2g protein."
        },
        {
            "name": "Chunky Monkey Cupcakes",
            "expert": "Peanut butter is a favorite of ours, and it brings a fun element to these cupcakes. They're good with or without garnishes. —Holly Jones, Kennesaw, Georgia",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "2 cups mashed ripe bananas (about 5 medium)",
                "1-1/2 cups sugar",
                "3 large eggs, room temperature",
                "1/2 cup unsweetened applesauce",
                "1/4 cup canola oil",
                "3 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1 cup semisweet chocolate chunks",
                "FROSTING:",
                "4 ounces reduced-fat cream cheese",
                "1/4 cup creamy peanut butter",
                "3 tablespoons butter, softened",
                "1 to 1-1/4 cups confectioners' sugar",
                "Chopped salted peanuts, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Line 24 muffin cups with paper liners.",
                "Beat first 5 ingredients until well blended. In another bowl, whisk together flour, baking soda, baking powder and salt; gradually beat into banana mixture. Fold in chocolate chunks.",
                "Fill prepared cups three-fourths full. Bake until a toothpick inserted in center comes out clean, 20-25 minutes. Cool in pans 10 minutes before removing to wire racks to cool completely.",
                "For frosting, beat cream cheese, peanut butter and butter until smooth. Gradually beat in enough confectioners' sugar to reach desired consistency. Spread over cupcakes. If desired, sprinkle with peanuts. Refrigerate leftovers."
            ],
            "nutrition": "1 cupcake: 250 calories, 9g fat (4g saturated fat), 30mg cholesterol, 165mg sodium, 40g carbohydrate (25g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Banana Pound Cake",
            "expert": "I adapted a basic pound cake recipe from my great-aunt for this treat. It makes a moist cake that pops out of the pan perfectly. —Nancy Zimmerman, Cape May Court House, New Jersey",
            "time": "Prep: 20 min. Bake: 1-1/4 hours + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3 teaspoons plus 3 cups sugar, divided",
                "1 cup butter, softened",
                "6 large eggs, room temperature",
                "1 cup mashed ripe bananas (about 2 medium)",
                "1-1/2 teaspoons vanilla extract",
                "1/2 teaspoon lemon extract",
                "3 cups all-purpose flour",
                "1/4 teaspoon baking soda",
                "1 cup sour cream",
                "GLAZE:",
                "1-1/2 cups confectioners' sugar",
                "1/2 teaspoon vanilla extract",
                "3 to 4 teaspoons 2% milk"
            ],
            "directions": [
                "Grease a 10-in. fluted tube pan. Sprinkle with 3 teaspoons sugar; set aside.",
                "In a large bowl, cream butter and the remaining 3 cups sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Stir in bananas and extracts. Combine flour and baking soda; add to the creamed mixture alternately with sour cream, beating just until combined.",
                "Pour into prepared pan (pan will be full). Bake at 325° until a toothpick inserted near the center comes out clean, 75-85 minutes. Cool for 10 minutes before removing from pan to a wire rack to cool completely.",
                "In a small bowl, whisk glaze ingredients until smooth; drizzle over cake. Store in the refrigerator. May be frozen for up to 1 month."
            ],
            "nutrition": "1 slice: 600 calories, 22g fat (13g saturated fat), 138mg cholesterol, 192mg sodium, 96g carbohydrate (69g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Banana-Pecan Sheet Cake",
            "expert": "A dear friend of mine gave me this recipe, and I make it often, especially for potlucks. Sometimes I make it ahead, freeze the cake and then frost it before the party. —Merrill Powers, Spearville, Kansas",
            "time": "Prep: 35 min. Bake: 20 min. + cooling",
            "makes": "24 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-2/3 cups sugar",
                "2 large eggs",
                "1-1/2 cups mashed ripe bananas",
                "2-1/2 cups all-purpose flour",
                "3 teaspoons baking powder",
                "1 teaspoon salt",
                "1/4 teaspoon baking soda",
                "2/3 cup buttermilk",
                "1/2 cup chopped pecans",
                "FROSTING:",
                "1/3 cup butter, softened",
                "3 cups confectioners' sugar",
                "1-1/2 teaspoons vanilla extract",
                "3 to 4 tablespoons fat-free milk",
                "1/3 cup finely chopped pecans, toasted"
            ],
            "directions": [
                "Preheat oven to 350°. Coat a 15x10x1-in. baking pan with cooking spray.",
                "In a large bowl, beat butter and sugar until blended. Add eggs, one at a time, beating well after each addition. Add bananas, mixing well (mixture will appear curdled).",
                "In another bowl, whisk flour, baking powder, salt and baking soda; add to butter mixture alternately with buttermilk, beating well after each addition. Fold in pecans.",
                "Transfer to prepared pan. Bake 20-25 minutes or until a toothpick inserted in center comes out clean. Cool completely in pan on a wire rack.",
                "For frosting, in a large bowl, combine butter, confectioners' sugar and vanilla. Add enough milk to achieve desired consistency. Frost cake. Sprinkle with toasted pecans."
            ],
            "nutrition": "1 piece: 267 calories, 10g fat (4g saturated fat), 35mg cholesterol, 240mg sodium, 43g carbohydrate (31g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Bars with Orange Frosting",
            "expert": "I've been making these banana bars with orange frosting for years. They're always a hit at family get-togethers and parties. The secret to tasty banana desserts is the ripeness of the bananas. The riper, the better. —Mary Sturgis, Hingham, Massachusetts",
            "time": "Prep: 15 min. Bake: 25 min. + cooling",
            "makes": "20 servings",
            "ingredients": [
                "2 cups mashed ripe bananas (3 to 4 medium)",
                "1-2/3 cups sugar",
                "1 cup canola oil",
                "4 large eggs, room temperature",
                "2 cups all-purpose flour",
                "2 teaspoons ground cinnamon",
                "1 teaspoon baking powder",
                "1 teaspoon salt",
                "1/2 teaspoon baking soda",
                "ORANGE BUTTER FROSTING:",
                "5 tablespoons butter, softened",
                "4-1/2 cups confectioners' sugar",
                "5 tablespoons orange juice",
                "1/2 teaspoon grated orange zest"
            ],
            "directions": [
                "In a large bowl, beat the bananas, sugar, oil and eggs until well blended. In a small bowl, combine the flour, cinnamon, baking powder, salt and baking soda; gradually beat into banana mixture until blended.",
                "Pour into a greased 15x10x1-in. baking pan. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Cool completely on a wire rack.",
                "For frosting, cream butter and sugar in a large bowl until light and fluffy, 5-7 minutes. Beat in orange juice and zest until smooth; spread evenly over cake."
            ],
            "nutrition": "1 piece: 374 calories, 15g fat (4g saturated fat), 50mg cholesterol, 212mg sodium, 59g carbohydrate (46g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Bars with Orange Frosting",
            "expert": "I've been making these banana bars with orange frosting for years. They're always a hit at family get-togethers and parties. The secret to tasty banana desserts is the ripeness of the bananas. The riper, the better. —Mary Sturgis, Hingham, Massachusetts",
            "time": "Prep: 15 min. Bake: 25 min. + cooling",
            "makes": "20 servings",
            "ingredients": [
                "2 cups mashed ripe bananas (3 to 4 medium)",
                "1-2/3 cups sugar",
                "1 cup canola oil",
                "4 large eggs, room temperature",
                "2 cups all-purpose flour",
                "2 teaspoons ground cinnamon",
                "1 teaspoon baking powder",
                "1 teaspoon salt",
                "1/2 teaspoon baking soda",
                "ORANGE BUTTER FROSTING:",
                "5 tablespoons butter, softened",
                "4-1/2 cups confectioners' sugar",
                "5 tablespoons orange juice",
                "1/2 teaspoon grated orange zest"
            ],
            "directions": [
                "In a large bowl, beat the bananas, sugar, oil and eggs until well blended. In a small bowl, combine the flour, cinnamon, baking powder, salt and baking soda; gradually beat into banana mixture until blended.",
                "Pour into a greased 15x10x1-in. baking pan. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Cool completely on a wire rack.",
                "For frosting, cream butter and sugar in a large bowl until light and fluffy, 5-7 minutes. Beat in orange juice and zest until smooth; spread evenly over cake."
            ],
            "nutrition": "1 piece: 374 calories, 15g fat (4g saturated fat), 50mg cholesterol, 212mg sodium, 59g carbohydrate (46g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Walnut Banana Cupcakes",
            "expert": "What makes these tender banana cupcakes extra special is the nutmeg, but make sure it's fresh. They're amazingly good; I get request for them all the time. —Rachel Krupp, Perkiomenville, Pennsylvania",
            "time": "Prep: 25 min. Bake: 20 min. + cooling",
            "makes": "1 dozen",
            "ingredients": [
                "1/4 cup butter, softened",
                "3/4 cup sugar",
                "2 large eggs",
                "1/2 cup mashed ripe banana",
                "1 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon ground nutmeg",
                "1/4 teaspoon salt",
                "1/4 cup sour cream",
                "CREAM CHEESE FROSTING:",
                "4 ounces cream cheese, softened",
                "1/2 teaspoon vanilla extract",
                "1-3/4 cups confectioners' sugar",
                "3 tablespoons chopped walnuts"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in banana and vanilla. Combine the flour, baking soda, nutmeg and salt; gradually add to creamed mixture alternately with sour cream, mixing well after each addition.",
                "Fill paper-lined muffin cups half full. Bake at 350° for 18-22 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.",
                "For frosting, in a small bowl, beat cream cheese and vanilla until smooth. Gradually beat in confectioners' sugar. Frost cupcakes; sprinkle with walnuts. Store in the refrigerator."
            ],
            "nutrition": "1 each: 265 calories, 10g fat (5g saturated fat), 59mg cholesterol, 182mg sodium, 41g carbohydrate (31g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Banana Split Cake Bars",
            "expert": "Summer isn’t summer without a banana split or two, and these fun bars bring that same delicious flavor in potluck-perfect form. —Jasey McBurnett, Rock Springs, Wyoming",
            "time": "Prep: 25 min. Bake: 25 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "1-1/2 cups mashed ripe bananas (about 3 large)",
                "1 cup sour cream",
                "2 teaspoons vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "3/4 teaspoon salt",
                "2 jars (10 ounces each) maraschino cherries, drained and chopped",
                "2 cups semisweet chocolate chips",
                "1 package (10 ounces) miniature marshmallows",
                "Optional: Chopped salted peanuts and banana slices or dried banana chips"
            ],
            "directions": [
                "Preheat oven to 375°. Grease a 15x10x1-in. baking pan.",
                "In a large bowl, beat butter and sugar until crumbly, about 2 minutes. Add eggs; mix well. Beat in bananas, sour cream and vanilla. In another bowl, whisk flour, baking soda and salt; gradually add to butter mixture. Transfer to prepared pan.",
                "Bake until a toothpick inserted in center comes out clean, 18-20 minutes. Top cake with cherries, chocolate chips, marshmallows and, if desired, peanuts. Bake until chips are slightly melted and marshmallows puff, 3-5 minutes longer. Cool completely in pan on a wire rack; cut into bars. If desired, top with banana slices or banana chips before serving."
            ],
            "nutrition": "1 piece: 294 calories, 11g fat (6g saturated fat), 28mg cholesterol, 177mg sodium, 52g carbohydrate (38g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Split Icebox Cake",
            "expert": "One day a friend showed me how to make a traditional icebox cake with just cream and graham crackers. I make it extra special with the fruit. Now everyone at the potluck can have a banana split with no fuss! —Shelly Flye, Albion, Maine",
            "time": "Prep: 30 min. + chilling",
            "makes": "10 servings",
            "ingredients": [
                "1 carton (16 ounces) frozen whipped topping, thawed",
                "1 cup sour cream",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 can (8 ounces) crushed pineapple, drained",
                "24 whole graham crackers",
                "2 medium bananas, sliced",
                "Toppings: Chocolate syrup, halved fresh strawberries and additional banana slices"
            ],
            "directions": [
                "In a large bowl, mix whipped topping, sour cream and pudding mix until blended; fold in pineapple. Cut a small hole in the tip of a pastry bag. Transfer pudding mixture to bag.",
                "On a flat serving plate, arrange 4 crackers in a rectangle. Pipe about 1 cup pudding mixture over crackers; top with about 1/4 cup banana slices. Repeat layers 5 times. Refrigerate, covered, overnight.",
                "Just before serving, top with chocolate syrup, strawberries and additional banana slices."
            ],
            "nutrition": "1 slice: 405 calories, 15g fat (11g saturated fat), 16mg cholesterol, 372mg sodium, 60g carbohydrate (30g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Banana Nut Cupcakes",
            "expert": "These moist cupcakes from Vicki Abrahamson taste like little loaves of banana bread. \"I keep ripe bananas in the freezer, so I can whip up these cupcakes whenever I need them for a bake sale or party,\" notes the Seabeck, Washington subscriber. \"I like to top them with cream cheese frosting,\" she adds.",
            "time": "Prep: 15 min. Bake: 20 min.",
            "makes": "15 cupcakes",
            "ingredients": [
                "1/3 cup butter-flavored shortening",
                "2/3 cup sugar",
                "2 eggs",
                "1 cup mashed ripe bananas (about 3 medium)",
                "2 tablespoons 2% milk",
                "1 tablespoon vanilla extract",
                "1-1/3 cups all-purpose flour",
                "2 teaspoons baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/4 cup chopped nuts"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Beat in eggs. Stir in bananas, milk and vanilla. Combine flour, baking powder, baking soda and salt; gradually add to creamed mixture and mix well. Stir in nuts.",
                "Fill paper-lined muffin cups two-thirds full. Bake until a toothpick inserted in center comes out clean, 18-20 minutes. Cool 5 minutes before removing from pans to wire racks."
            ],
            "nutrition": "1 cupcake: 153 calories, 6g fat (1g saturated fat), 29mg cholesterol, 145mg sodium, 21g carbohydrate (12g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Nut Cake",
            "expert": "I'm a pastor's wife, and it's so good to have something to serve when friends drop in unexpectedly. Because this banana nut cake can be frozen and also keeps well in the refrigerator, I try to have one on hand—just in case. —Gloria Barkley, Wilmington, North Carolina",
            "time": "Prep: 10 min. Bake: 1 hour + cooling",
            "makes": "16 servings",
            "ingredients": [
                "3 cups all-purpose flour",
                "2 cups sugar",
                "1 teaspoon salt",
                "1 teaspoon baking powder",
                "1 teaspoon baking soda",
                "1 teaspoon ground cinnamon",
                "1 teaspoon ground nutmeg",
                "4 large eggs, room temperature",
                "2 cups mashed ripe bananas (3 to 4 medium)",
                "1-1/3 cups canola oil",
                "1 can (8 ounces) crushed pineapple, undrained",
                "1-1/2 teaspoons vanilla extract",
                "1-1/2 cups chopped walnuts",
                "Optional toppings: Confectioners' sugar and whipped cream"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. tube pan. In a large bowl, whisk flour, sugar, salt, baking powder, baking soda, cinnamon and nutmeg. In another bowl, combine eggs, bananas, oil, pineapple and vanilla. Add to flour mixture; stir just until moistened. Fold in nuts.",
                "Pour into prepared pan. Bake until a toothpick inserted in center comes out clean, 60-65 minutes. Cool in pan 15 minutes before removing to a wire rack to cool completely. If desired, dust with confectioners' sugar and serve with whipped cream and additional bananas."
            ],
            "nutrition": "1 slice: 468 calories, 26g fat (3g saturated fat), 53mg cholesterol, 268mg sodium, 53g carbohydrate (32g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Cocoa Banana Cupcakes",
            "expert": "Rochelle Brownlee of Big Timber, Montana shares the recipe for these moist cupcakes with milk banana flavor. The cocoa powder in the frosting boosts the chocolate flavor while the melted chocolate gives it a creamy texture, making it easier to spread.",
            "time": "Prep: 15 min. Bake: 20 min. + cooling",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "2 cups all-purpose flour",
                "1 cup sugar",
                "1/2 cup baking cocoa",
                "1 teaspoon baking powder",
                "1/2 teaspoon each baking soda and salt",
                "2 eggs",
                "1-1/4 cups fat-free milk",
                "1 cup mashed ripe banana (2 to 3 medium)",
                "3 tablespoons canola oil",
                "1 teaspoon vanilla extract",
                "FROSTING:",
                "4 ounces reduced-fat cream cheese",
                "3 tablespoons fat-free milk",
                "2 ounces semisweet chocolate, melted and cooled",
                "1 teaspoon vanilla extract",
                "2 cups confectioners' sugar",
                "1/3 cup baking cocoa"
            ],
            "directions": [
                "In a bowl, combine dry ingredients. In another bowl, combine eggs, milk, banana, oil and vanilla. Stir into dry ingredients just until moistened.",
                "Coat muffin cups with cooking spray or line with paper liners. Fill three-fourths full. Bake at 375° for 18-20 minutes or until a toothpick comes out clean. Cool for 5 minutes; remove to wire racks to cool completely.",
                "Beat cream cheese, milk, chocolate and vanilla until smooth. Combine confectioners' sugar and cocoa; gradually beat into cream cheese mixture. Frost cupcakes."
            ],
            "nutrition": "1 each: 224 calories, 6g fat (2g saturated fat), 29mg cholesterol, 171mg sodium, 40g carbohydrate, 2g fiber), 4g protein."
        },
        {
            "name": "Potluck Banana Cake",
            "expert": "I found this recipe more than five years ago and have been making it for family gatherings ever since. The coffee-flavored frosting complements the moist banana cake. —Kathy Hoffman, Topton, Pennsylvania",
            "time": "Prep: 25 min. Bake: 35 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1 cup sugar",
                "2 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "2 teaspoons baking soda",
                "1/2 teaspoon salt",
                "1-1/2 cups mashed ripe bananas (about 3 medium)",
                "1 cup sour cream",
                "COFFEE FROSTING:",
                "1/3 cup butter, softened",
                "2-1/2 cups confectioners' sugar",
                "2 teaspoons instant coffee granules",
                "2 to 3 tablespoons 2% milk"
            ],
            "directions": [
                "Preheat oven to 350&deg;. In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Stir in vanilla. Combine flour, baking soda and salt; add to creamed mixture alternately with bananas and sour cream, beating well after each addition.",
                "Pour into a greased 13x9-in. baking dish. Bake until a toothpick inserted in center comes out clean, 35-40 minutes. Cool completely on a wire rack.",
                "For frosting, in a small bowl, beat butter and confectioners' sugar until smooth. Dissolve coffee granules in milk; add to butter mixture and beat until smooth. Spread over cake. Sprinkle with additional instant coffee, if desired."
            ],
            "nutrition": "1 piece: 344 calories, 14g fat (8g saturated fat), 67mg cholesterol, 368mg sodium, 52g carbohydrate (37g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Banana Pudding Cake",
            "expert": "I love to make cakes, and my family loves banana pudding. One day while brainstorming in the kitchen, I came up with this banana pudding cake recipe to combine the two. My family and friends can't get enough of it! If you are pressed for time, you may substitute whipped topping for the homemade sweetened whipped cream. —Tiffany Barbee, Rocky Mount, North Carolina",
            "time": "Prep: 30 min. Bake: 15 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package yellow cake mix",
                "3 large eggs, room temperature",
                "1/2 cup vegetable oil",
                "1/4 cup 2% milk",
                "1 teaspoon vanilla extract",
                "2 cups mashed ripe bananas",
                "1 package (12 ounces) vanilla wafers",
                "FILLING:",
                "1 cup cold 2% milk",
                "1 package (3.4 ounces) instant banana cream pudding mix",
                "WHIPPED CREAM FROSTING:",
                "1-1/2 cups heavy whipping cream",
                "1/4 cup confectioners' sugar",
                "Sliced ripe bananas, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 2 greased 9-in. round baking pans with parchment; grease paper. Combine the first 5 ingredients; beat on low speed until moistened, about 30 seconds. Beat on medium for 2 minutes; stir in mashed banana. Spread 1/2 cup batter into each prepared pan. Arrange 2 cups vanilla wafers on batter (1 cup per pan), flat side up. Gently spread remaining batter over wafers. Bake until a toothpick inserted in the center comes out clean, 15-20 minutes. Cool in pans 10 minutes before removing from pans to wire racks to cool completely.",
                "Whisk milk and pudding mix 2 minutes. Let stand until soft-set, 2 minutes. Meanwhile, in a chilled large bowl and using chilled beaters, beat cream until it begins to thicken. Add sugar; beat until soft peaks form.",
                "Place one cake layer on a serving plate. Spread with pudding mixture. Top with second cake layer. Spread sweetened whipped cream over top and sides of cake. Crush 1 cup vanilla wafers and press onto sides of cake. Garnish with remaining whole vanilla wafers and, if desired, sliced bananas. Store in the refrigerator."
            ],
            "nutrition": "1 piece: 417 calories, 21g fat (8g saturated fat), 65mg cholesterol, 395mg sodium, 52g carbohydrate (31g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Banana Nut Layer Cake",
            "expert": "\"This cake is the top choice of the 'birthday child' in our family!\" says Patsy Howard of Bakersfield, California.",
            "time": "Prep: 35 min. + chilling Bake: 35 min. + cooling",
            "makes": "10-12 servings",
            "ingredients": [
                "1/2 cup shortening",
                "2 cups sugar",
                "1 egg plus 1 egg white",
                "1 cup buttermilk",
                "1 cup mashed ripe bananas",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1 teaspoon salt",
                "1/2 cup chopped walnuts",
                "FILLING:",
                "1/4 cup butter, cubed",
                "1/2 cup packed brown sugar",
                "1/4 cup all-purpose flour",
                "Pinch salt",
                "3/4 cup milk",
                "1 egg yolk",
                "1 teaspoon vanilla extract",
                "1/2 cup chopped walnuts",
                "Confectioners' sugar"
            ],
            "directions": [
                "In a large bowl, cream shortening and sugar until light and fluffy. Beat in egg and egg white. Add the buttermilk, bananas and vanilla. Combine flour, baking soda and salt; stir into the creamed mixture. Stir in walnuts.",
                "Pour into two greased and floured 9-in. round baking pans. Bake at 350° for 35 minutes or until a toothpick inserted in the center comes out clean. Cool in pans 10 minutes before removing to a wire rack.",
                "For filling, in a small saucepan, melt butter and brown sugar over medium heat. In a small bowl, combine flour and salt with a small amount of milk until smooth. Gradually add the remaining milk. Stir in egg yolk. Add to brown sugar mixture. Cook and stir over medium heat for about 10 minutes or until thickened.",
                "Remove from the heat; add vanilla and nuts. Cool. Spread between cake layers. Dust with confectioners' sugar. Chill. Store in refrigerator."
            ],
            "nutrition": "1 piece: 436 calories, 17g fat (5g saturated fat), 49mg cholesterol, 396mg sodium, 67g carbohydrate (47g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Upside Down Banana Cake",
            "expert": "Because this starts with a cake mix, this is a fast and easy dessert to make. Plus, it uses up your ripe bananas and tastes great!—Lois Schlickau, Haven, Kansas",
            "time": "Prep: 15 min. Bake: 30 min. + standing",
            "makes": "9 servings",
            "ingredients": [
                "1/4 cup butter",
                "1/2 cup packed brown sugar",
                "3 medium firm bananas, cut into 1/2-inch slices",
                "1 package (9 ounces) yellow cake mix",
                "Whipped cream"
            ],
            "directions": [
                "Place butter in a 9-in. square baking pan. Heat at 350° for 4-5 minutes or until melted; sprinkle with brown sugar. Arrange bananas in pan; set aside. Prepare cake mix according to package directions; pour over bananas.",
                "Bake at 350° for 30-35 minutes or until a toothpick inserted in the center comes out clean. Immediately invert cake onto a serving platter. Let stand for 5 minutes; remove pan. Serve warm with whipped cream."
            ],
            "nutrition": ""
        },
        {
            "name": "Banana Cupcakes with Ganache Frosting",
            "expert": "Using extra-ripe bananas in this recipe ensures the cupcakes will be sweet and moist. The ganache frosting is made even fluffier with the addition of marshmallow creme. —Stephanie Lelo, Grand Rapids, Michigan",
            "time": "Prep: 45 min. Bake: 20 min. + cooling",
            "makes": "about 1-1/2 dozen",
            "ingredients": [
                "2 cups all-purpose flour",
                "1-1/2 cups sugar",
                "3/4 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "2 large eggs, room temperature",
                "1/2 cup canola oil",
                "1/4 cup buttermilk",
                "1 teaspoon vanilla extract",
                "1-1/3 cups mashed ripe bananas (2 to 3 medium)",
                "3/4 cup chopped pecans",
                "FROSTING:",
                "7 ounces semisweet chocolate, chopped",
                "1/2 cup heavy whipping cream",
                "6 tablespoons shortening",
                "1/3 cup confectioners' sugar",
                "1/2 cup marshmallow creme",
                "1/2 teaspoon vanilla extract"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, combine the flour, sugar, baking soda, baking powder and salt. In another bowl, combine the eggs, oil, buttermilk and vanilla. Beat into dry ingredients just until moistened. Fold in bananas and pecans.",
                "Fill paper-lined muffin cups two-thirds full. Bake until a toothpick inserted in the center comes out clean, 20-24 minutes. Cool for 5 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a small saucepan, melt chocolate with cream over low heat; stir until blended. Remove from the heat. Transfer to a small bowl; cool until mixture reaches room temperature.",
                "In a large bowl, cream shortening and confectioners' sugar until light and fluffy, about 5 minutes. Beat in marshmallow creme and vanilla. Add chocolate mixture. Beat until light and fluffy. Frost cupcakes."
            ],
            "nutrition": "1 each: 310 calories, 18g fat (5g saturated fat), 28mg cholesterol, 125mg sodium, 37g carbohydrate (25g sugars, 2g fiber), 3g protein."
        },
        {
            "name": "Banana Nut Cupcakes",
            "expert": "These moist cupcakes from Vicki Abrahamson taste like little loaves of banana bread. \"I keep ripe bananas in the freezer, so I can whip up these cupcakes whenever I need them for a bake sale or party,\" notes the Seabeck, Washington subscriber. \"I like to top them with cream cheese frosting,\" she adds.",
            "time": "Prep: 15 min. Bake: 20 min.",
            "makes": "15 cupcakes",
            "ingredients": [
                "1/3 cup butter-flavored shortening",
                "2/3 cup sugar",
                "2 eggs",
                "1 cup mashed ripe bananas (about 3 medium)",
                "2 tablespoons 2% milk",
                "1 tablespoon vanilla extract",
                "1-1/3 cups all-purpose flour",
                "2 teaspoons baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/4 cup chopped nuts"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Beat in eggs. Stir in bananas, milk and vanilla. Combine flour, baking powder, baking soda and salt; gradually add to creamed mixture and mix well. Stir in nuts.",
                "Fill paper-lined muffin cups two-thirds full. Bake until a toothpick inserted in center comes out clean, 18-20 minutes. Cool 5 minutes before removing from pans to wire racks."
            ],
            "nutrition": "1 cupcake: 153 calories, 6g fat (1g saturated fat), 29mg cholesterol, 145mg sodium, 21g carbohydrate (12g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Spice Cake",
            "expert": "This delicious spice cake is bursting with the fresh flavor of ripe bananas and zesty orange peel. \"I've packed lots of spices into my favorite healthy dessert,\" comments Sharon Carroll of Whittier, California.",
            "time": "Prep: 20 min. Bake: 50 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 large egg yolk",
                "1/4 cup canola oil",
                "1 cup mashed ripe bananas (about 3 medium)",
                "2 cups cake flour",
                "1-1/4 cups sugar, divided",
                "1/2 cup all-purpose flour",
                "2 teaspoons baking powder",
                "2 teaspoons ground cinnamon",
                "1-1/2 teaspoons baking soda",
                "1 teaspoon ground nutmeg",
                "1/2 teaspoon each salt, ground cloves, ginger and allspice",
                "1/2 cup fat-free milk",
                "1/4 cup orange juice concentrate",
                "2 tablespoons fat-free plain yogurt",
                "1 tablespoon grated orange zest",
                "1 tablespoon vanilla extract",
                "3 large egg whites",
                "1/4 teaspoon cream of tartar",
                "GLAZE:",
                "1 cup confectioners' sugar",
                "1/4 teaspoon vanilla extract",
                "1 to 2 tablespoons fat-free milk"
            ],
            "directions": [
                "In a bowl, beat the egg yolk, oil and bananas. Combine the cake flour, 1 cup sugar, all-purpose flour, baking powder, cinnamon, baking soda, nutmeg, salt, cloves, ginger and allspice. In another bowl, combine the milk, orange juice concentrate, yogurt, orange zest and vanilla. Gradually add dry ingredients to banana mixture alternately with milk mixture.",
                "In another bowl, eat egg whites and cream of tartar until soft peaks form. Gradually add remaining sugar, beating until stiff peaks form. Fold in batter. Pour into a greased and floured 10-in. fluted tube pan. Bake at 350° for 48-52 minutes or until a toothpick comes out clean. Cool for 10 minutes before removing from pan to a wire rack.",
                "Combine the glaze ingredients; drizzle over cooled cake."
            ],
            "nutrition": ""
        },
        {
            "name": "Banana Bread Snack Cakes",
            "expert": "This banana bread snack cake doesn't need any frosting—just a dusting of powdered sugar. Guests are always amazed that I made this treat from scratch. —Denise Loewenthal, Hinckley, Ohio",
            "time": "Prep: 10 min. Bake: 30 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "1-2/3 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1 cup packed brown sugar",
                "1/2 cup water",
                "1/3 cup mashed ripe bananas (about 1 small)",
                "1/3 cup canola oil",
                "1/2 teaspoon vanilla extract",
                "Confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350&deg;. In a bowl, combine flour and baking soda. In another bowl, whisk brown sugar, water, banana, oil and vanilla. Stir into dry ingredients just until moistened. Transfer to a greased 8-in. square baking pan.",
                "Bake until a toothpick inserted in the center comes out clean, 30-35 minutes. Cool on a wire rack. Dust cake with confectioners' sugar. Cut into 9 pieces."
            ],
            "nutrition": "1 piece: 259 calories, 9g fat (1g saturated fat), 0 cholesterol, 147mg sodium, 44g carbohydrate (25g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Banana Split Ice Cream Cake",
            "expert": "Every time they visit, my children and grandkids request this fantastic frozen dessert. It takes time to assemble, but it's worth the effort when I see all those smiling faces. —Gladys M. Abee, McKee, Kentucky",
            "time": "Prep: 30 min. + freezing",
            "makes": "12 servings",
            "ingredients": [
                "12 ice cream sugar cones, finely crushed",
                "1/2 cup finely chopped walnuts",
                "6 tablespoons butter, melted",
                "CAKE:",
                "1-3/4 quarts low-fat vanilla frozen yogurt, softened, divided",
                "2 medium ripe bananas, mashed",
                "1 teaspoon banana extract, optional",
                "1 jar (16 ounces) hot fudge ice cream topping",
                "1 cup chopped walnuts",
                "1 cup strawberry ice cream topping",
                "1 carton (8 ounces) frozen whipped topping, thawed"
            ],
            "directions": [
                "In a small bowl, combine the crushed cones, walnuts and butter; press onto the bottom of a greased 9-in. springform pan.",
                "In another small bowl, combine 3 cups yogurt, bananas and extract if desired. Spread over crust. In a small bowl, combine fudge topping and walnuts; spread over yogurt. Cover and freeze for 2 hours or until firm.",
                "Top with remaining yogurt; spread with strawberry topping. Cover and freeze for 8 hours or overnight until firm. Garnish with whipped topping."
            ],
            "nutrition": "1 piece: 619 calories, 26g fat (11g saturated fat), 33mg cholesterol, 184mg sodium, 86g carbohydrate (54g sugars, 2g fiber), 10g protein."
        },
        {
            "name": "Cherry Banana Cupcakes",
            "expert": "Perfect for your breakfast on the go or a sweet treat, these Cupcakes come courtesy of Diana Benecke from Milwaukee, Wisconsin.",
            "time": "Prep: 15 min. Bake: 20 min.",
            "makes": "5 cupcakes",
            "ingredients": [
                "1/4 cup butter, softened",
                "1/4 cup sugar",
                "2 tablespoons beaten egg",
                "1/4 cup mashed ripe banana",
                "2 tablespoons buttermilk",
                "1/2 teaspoon vanilla extract",
                "1/2 cup all-purpose flour",
                "1/4 cup quick-cooking oats",
                "1/4 teaspoon plus 1/8 teaspoon baking soda",
                "1/8 teaspoon salt",
                "2 tablespoons chopped maraschino cherries, well drained",
                "2 tablespoons chopped walnuts"
            ],
            "directions": [
                "In a small bowl, cream butter and sugar until smooth. Add egg; mix well. Beat in the banana, buttermilk and vanilla. Combine the flour, oats, baking soda and salt; add to creamed mixture just until moistened. Fold in cherries.",
                "Fill paper-lined muffin cups three-fourths full. Sprinkle with walnuts. Bake at 350° for 18-20 minutes or until a toothpick comes out clean. Cool for 5 minutes before removing from pan to a wire rack to cool completely."
            ],
            "nutrition": "1 each: 229 calories, 12g fat (6g saturated fat), 50mg cholesterol, 236mg sodium, 28g carbohydrate (13g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Bananas & Cream Pound Cake",
            "expert": "This banana pound cake got me a date with my future husband. At a church event, he loved it so much, he asked for another piece. The rest is history! —Courtney Farnon, Cartersville, Georgia",
            "time": "Prep: 20 min. Bake: 40 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "3 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "1-1/2 cups all-purpose flour",
                "1/4 teaspoon salt",
                "1/8 teaspoon baking soda",
                "1/2 cup buttermilk",
                "LAYERS:",
                "2 cups 2% milk",
                "1 package (3.4 ounces) instant French vanilla pudding mix",
                "1 package (8 ounces) cream cheese, softened",
                "1/2 cup sweetened condensed milk",
                "1 package (12 ounces) frozen whipped topping, thawed, divided",
                "5 medium ripe bananas"
            ],
            "directions": [
                "Preheat oven to 325°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. In another bowl, mix the flour, salt and baking soda; add to the creamed mixture alternately with buttermilk, beating well after each addition.",
                "Transfer to a greased and floured 9x5-in. loaf pan. Bake until a toothpick inserted in center comes out clean, 40-45 minutes. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "In a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes. In a large bowl, beat cream cheese and condensed milk until smooth; fold in pudding. Fold in 3-1/2 cups whipped topping.",
                "Cut cake into 8 pieces; arrange on bottom of an ungreased 13x9-in. dish, trimming to fit as necessary. Slice bananas; arrange over cake. Spread pudding mixture over top. Refrigerate, covered, for 3 hours. Serve with remaining whipped topping and, if desired, additional bananas."
            ],
            "nutrition": "1 piece: 419 calories, 18g fat (12g saturated fat), 75mg cholesterol, 295mg sodium, 57g carbohydrate (43g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Banana Coconut Cake",
            "expert": "Meet the Cook: In our family, a meal isn't considered complete without a dessert - or, sometimes, two! This cake does keep well, but leftovers are a rarity around here.\r\n-Deanna Carruthers, Mossley, Ontario",
            "time": "Prep: 30 min. Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3/4 cup shortening",
                "1-1/2 cups sugar",
                "2 eggs",
                "1 cup mashed ripe bananas",
                "1 teaspoon vanilla extract",
                "2 cups cake flour",
                "1 teaspoon baking soda",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1/2 cup buttermilk",
                "1/2 cup chopped pecans, optional",
                "1 cup sweetened shredded coconut",
                "BUTTER CREAM FROSTING:",
                "1/2 cup shortening",
                "1/2 cup butter, softened",
                "2 cups confectioners' sugar",
                "1/2 teaspoon vanilla extract",
                "1/2 teaspoon coconut extract",
                "Pinch salt",
                "1/4 cup cold evaporated milk"
            ],
            "directions": [
                "In a bowl, cream shortening and sugar until fluffy. Add eggs; beat for 2 minutes. Add bananas and vanilla; beat for 2 minutes.",
                "Combine dry ingredients; add to creamed mixture alternately with buttermilk. Mix well. Stir in pecans if desired. Pour into two greased and floured 9-in. round baking pans. Sprinkle each with coconut.",
                "Bake at 375° for 25-30 minutes or until cake tests done; loosely cover with foil during the last 10 minutes of baking. Cool in pans 15 minutes before removing to a wire rack, coconut side up.",
                "In a bowl, cream shortening and butter. Add remaining frosting ingredients. Mix on low until combined; beat on high for 5 minutes. Place one cake layer, coconut side down, on a cake plate; spread with some of the frosting. Top with second layer, coconut side up; frost sides and 1 in. around top edge of cake, leaving coconut center showing."
            ],
            "nutrition": "1 piece: 589 calories, 32g fat (13g saturated fat), 58mg cholesterol, 373mg sodium, 72g carbohydrate (50g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Hummingbird Cake",
            "expert": "This impressive hummingbird cake is my dad’s favorite, so I always make it for his birthday. It makes a memorable dessert for any celebration and is lovely with a summer meal. —Nancy Zimmerman, Cape May Court House, New Jersey",
            "time": "Prep: 40 min. Bake: 25 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "2 cups mashed ripe bananas",
                "1-1/2 cups canola oil",
                "3 large eggs, room temperature",
                "1 can (8 ounces) unsweetened crushed pineapple, undrained",
                "1-1/2 teaspoons vanilla extract",
                "3 cups all-purpose flour",
                "2 cups sugar",
                "1 teaspoon salt",
                "1 teaspoon baking soda",
                "1 teaspoon ground cinnamon",
                "1 cup chopped walnuts",
                "PINEAPPLE FROSTING:",
                "1/4 cup shortening",
                "2 tablespoons butter, softened",
                "1 teaspoon grated lemon zest",
                "1/4 teaspoon salt",
                "6 cups confectioners' sugar",
                "1/2 cup unsweetened pineapple juice",
                "2 teaspoons half-and-half cream",
                "Chopped walnuts, optional"
            ],
            "directions": [
                "In a large bowl, beat the bananas, oil, eggs, pineapple and vanilla until well blended. In another bowl, combine the flour, sugar, salt, baking soda and cinnamon; gradually beat into banana mixture until blended. Stir in walnuts.",
                "Pour into 3 greased and floured 9-in. round baking pans. Bake at 350° until a toothpick inserted in the center comes out clean, 25-30 minutes. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a large bowl, beat the shortening, butter, lemon zest and salt until fluffy. Add confectioners' sugar alternately with pineapple juice. Beat in cream. Spread between layers and over top and sides of cake. If desired, sprinkle with walnuts."
            ],
            "nutrition": "1 piece: 777 calories, 35g fat (6g saturated fat), 50mg cholesterol, 333mg sodium, 113g carbohydrate (85g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Pecan Banana Bundt Cake",
            "expert": "My daughter, Liz, often made this banana bundt cake for us. It was delicious and different. She discovered five-spice powder during a culinary class field trip. —Marina Castle Kelley, Canyon Country, California",
            "time": "Prep: 10 min. Bake: 45 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package yellow cake mix (regular size)",
                "1-1/3 cups mashed ripe bananas (2 to 3 medium)",
                "1/2 cup chopped pecans, toasted",
                "2 teaspoons Chinese five-spice powder",
                "1/2 teaspoon ground cinnamon",
                "Confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. fluted tube pan. Prepare cake mix batter according to package directions, adding mashed bananas, pecans and spices into batter. Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean, 43-48 minutes. Cool in pan 15 minutes before removing to a wire rack to cool completely. Dust with confectioners' sugar before serving."
            ],
            "nutrition": "1 piece: 224 calories, 11g fat (2g saturated fat), 35mg cholesterol, 224mg sodium, 29g carbohydrate (15g sugars, 2g fiber), 2g protein."
        },
        {
            "name": "Banana Snack Cake",
            "expert": "\"I often make this moist banana cake for birthday days,\" remarks Dawn Fagerstrom from Warren, Minnesota. \"The recipe is good for making cupcakes, too - they taste great even without frosting.\"",
            "time": "Prep: 25 min. Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1/2 cup shortening",
                "3/4 cup packed brown sugar",
                "1/2 cup sugar",
                "2 large eggs, room temperature",
                "1 cup mashed ripe bananas (2 to 3 medium)",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose or whole wheat flour",
                "1 teaspoon baking soda",
                "1 teaspoon salt",
                "1/2 cup buttermilk",
                "1/2 cup chopped nuts",
                "FROSTING:",
                "1/2 cup packed brown sugar",
                "1/4 cup butter, softened",
                "6 tablespoons 2% milk",
                "2-1/2 to 3 cups confectioners' sugar"
            ],
            "directions": [
                "In a large bowl, cream shortening and sugars until light and fluffy. Add 1 egg at a time, beating well after each addition. Beat in bananas and vanilla. Combine flour, baking soda and salt; add to the creamed mixture alternately with buttermilk, beating well after each addition. Stir in nuts.",
                "Pour into a greased 13x9-in. baking pan. Bake at 350° until a toothpick inserted in the center comes out clean, 25-30 minutes. Cool on a wire rack.",
                "For frosting, in a large saucepan, combine brown sugar, butter and milk. Bring to a boil over medium heat; boil and stir for 2 minutes. Remove from the heat; cool to lukewarm.",
                "Gradually beat in confectioners' sugar until frosting reaches spreading consistency. Frost cake."
            ],
            "nutrition": "1 piece: 461 calories, 16g fat (5g saturated fat), 47mg cholesterol, 376mg sodium, 76g carbohydrate (58g sugars, 3g fiber), 6g protein."
        },
        {
            "name": "Marshmallow-Filled Banana Cupcakes",
            "expert": "A friend gave me this recipe when I first moved into my neighborhood 40 years ago. It might seem more time consuming than it is, but it's easy and the results are incredible. —Monique Caron, Buxton, Maine",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "3/4 cup shortening",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "1 cup mashed ripe bananas (about 2 medium)",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/4 cup buttermilk",
                "FILLING:",
                "1 cup butter, softened",
                "2 cups marshmallow creme",
                "1-1/2 cups confectioners' sugar",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 375°. Line 18 muffin cups with paper or foil liners.",
                "In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in bananas and vanilla. In another bowl, whisk flour, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Fill prepared cups two-thirds full. Bake 18-22 minutes or until a toothpick inserted in center comes out clean. Cool in pans 10 minutes before removing to wire racks to cool completely.",
                "For filling, in a large bowl, beat butter, marshmallow creme and confectioners' sugar until smooth. Using a sharp knife, cut a 1-in. circle, 1 in. deep, in top of each cupcake. Carefully remove cut portion and set aside. Fill cavity with about 1 teaspoon filling. Replace tops, pressing down lightly. Dollop or pipe remaining filling over tops. Dust with additional confectioners' sugar."
            ],
            "nutrition": "1 cupcake: 373 calories, 19g fat (9g saturated fat), 50mg cholesterol, 195mg sodium, 49g carbohydrate (35g sugars, 1g fiber), 2g protein."
        },
        {
            "name": "Chocolate Banana Split Cupcakes",
            "expert": "My mom often made these cute cupcakes when I was young. They go over just as well now when I bake them for our three children. My husband and I raise grain and cattle-and in my spare time, I enjoy needle crafts, woodworking and reading.—Lorelie Miller, Benito, Manitoba",
            "time": "Prep: 20 min. Bake: 20 min. + cooling",
            "makes": "1 dozen",
            "ingredients": [
                "1-1/4 cups all-purpose flour",
                "1/2 cup sugar",
                "1/4 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/2 cup mashed banana (about 1 medium)",
                "1/2 cup butter, melted",
                "1/4 cup buttermilk",
                "1 egg, lightly beaten",
                "1/2 teaspoon vanilla extract",
                "1/2 cup chopped walnuts",
                "2 milk chocolate bars (1.55 ounces each), broken into squares, divided",
                "FROSTING:",
                "1-1/2 cups confectioners' sugar",
                "1 tablespoon butter, melted",
                "1/2 teaspoon vanilla extract",
                "1 to 2 tablespoons milk",
                "12 maraschino cherries with stems"
            ],
            "directions": [
                "In a large bowl, combine the flour, sugar, baking soda and salt. In another bowl, combine the banana, butter, buttermilk, egg and vanilla. Add to the dry ingredients; stir just until combined. Fold in walnuts.  Place 1 tablespoon of batter in each of 12 paper-lined muffin cups. Top each with one candy bar square. Fill cups two-thirds full with batter.",
                "Bake at 350° for 20-25 minutes or until a toothpick inserted in the cupcake comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.",
                "In a large bowl, combine the confectioners' sugar, butter, vanilla and enough milk to achieve a spreading consistency. Frost cupcakes. In a microwave, melt the remaining candy bar squares; drizzle over frosting. Top each cupcake with a cherry."
            ],
            "nutrition": "1 each: 292 calories, 13g fat (6g saturated fat), 42mg cholesterol, 177mg sodium, 42g carbohydrate (29g sugars, 1g fiber), 4g protein."
        }
    ]
}