{
    "category": "Cake Rolls",
    "recipes": [
        {
            "name": "Pumpkin Ice Cream Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps4112_HB143427C07_17_2b-1.jpg?fit=700,1024",
            "expert": "This wonderfully light dessert is our standby at Thanksgiving and Christmas. The hint of pumpkin and the refreshing ice cream make a most delicious after-dinner treat. —Gayle Lewis, Yucaipa, California",
            "time": "Prep: 25 min. Bake: 15 min. + freezing",
            "makes": "10 servings",
            "ingredients": [
                "3/4 cup all-purpose flour",
                "2 teaspoons pumpkin pie spice",
                "1 teaspoon baking powder",
                "Dash salt",
                "3 large eggs",
                "1 cup sugar",
                "2/3 cup pumpkin",
                "Confectioners' sugar",
                "1 quart butter pecan ice cream, softened",
                "Whipped cream, optional",
                "Toasted chopped pecans, optional"
            ],
            "directions": [
                "In a small bowl, combine flour, pumpkin pie spice, baking powder and salt. In a bowl, beat eggs at high speed for 5 minutes or until pale yellow. Gradually beat in sugar. Stir in pumpkin. Fold in dry ingredients. Line a 15x10x1-in. baking pan with greased and floured waxed paper. Pour batter into pan; bake at 375° for 15 minutes.",
                "Turn cake out onto a linen towel sprinkled with confectioners' sugar. Peel off paper; roll up cake with towel. Cool on a wire rack. Unroll cake onto a baking sheet. Spread softened ice cream to within 1 in. of edges. Roll up cake again, without the towel. Cover and freeze.",
                "To serve, let stand a few minutes at room temperature before slicing. If desired, dust cake with confectioners' sugar and top with the whipped cream and pecans."
            ],
            "nutrition": "1 slice: 276 calories, 11g fat (5g saturated fat), 84mg cholesterol, 163mg sodium, 40g carbohydrate (31g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Cranberry Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cranberry-Cake-Roll_EXPS_TOHCA21_27127_B12_17_1b-11.jpg?fit=700,1024",
            "expert": "This low-fat angel food cake roll is a guilt-free indulgence, which is much-appreciated during the Christmas season. —Paige Kowolewski, Topton, Pennsylvania",
            "time": "Prep: 45 min. + chilling Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "9 large egg whites",
                "1-1/2 teaspoons vanilla extract",
                "3/4 teaspoon cream of tartar",
                "1/4 teaspoon salt",
                "1 cup plus 2 tablespoons sugar",
                "3/4 cup cake flour",
                "Confectioners' sugar",
                "FILLING:",
                "2-1/3 cups fresh or frozen cranberries",
                "1 cup sugar",
                "6 tablespoons water, divided",
                "1/3 cup chopped candied orange peel, optional",
                "1 tablespoon orange liqueur, optional",
                "1 teaspoon grated orange zest, optional",
                "2 tablespoons cornstarch"
            ],
            "directions": [
                "Preheat oven to 350°. Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Meanwhile, line a greased 15x10x1-in. baking pan with waxed paper; grease the paper.",
                "Add vanilla, cream of tartar and salt to egg whites; beat on medium speed until soft peaks form. Gradually beat in sugar, 2 tablespoons at a time, on high until stiff glossy peaks form and sugar is dissolved. Fold in flour, about 1/4 cup at a time.",
                "Carefully spread into prepared pan. Bake until cake springs back when lightly touched, 15-20 minutes. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a large saucepan, combine the cranberries, sugar and 4 tablespoons water. Bring to a boil. Reduce heat; simmer, uncovered, until berries pop, 5-6 minutes. Mash berries; strain, reserving juice and discarding pulp. Return juice to the pan and if desired, add chopped candied orange peel, orange liqueur and orange zest. Combine cornstarch and remaining 2 tablespons water until smooth; gradually add to cranberry juice mixture. Bring to a boil; cook and stir until thickened, about 2 minutes. Chill.",
                "Unroll cake and spread filling to within 1/2 in. of edges. Roll up again. Cover and refrigerate for 1 hour before serving. If desired, top with additional confectioners' sugar, candied orange peel and sugared cranberries. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 196 calories, 0 fat (0 saturated fat), 0 cholesterol, 91mg sodium, 46g carbohydrate (36g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Pumpkin Cannoli Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2021/08/Pumpkin-Cannoli-Cake-Roll_EXPS_PCBBZ21_190413_B04_22_5b.jpg?fit=700,1024",
            "expert": "My family has been serving this pumpkin roll every Christmas Eve for as long as I can remember. This last Christmas was no exception. Traditions are so heartwarming. This cake is not too sweet—the perfect ending to a special dinner. —Carolyn Rockwell, Milwaukie, Oregon",
            "time": "Prep: 35 min. + chilling Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3 large eggs, room temperature",
                "1 cup sugar",
                "2/3 cup canned pumpkin",
                "3/4 cup all-purpose flour",
                "2 teaspoons pumpkin pie spice",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "Confectioners' sugar",
                "FILLING:",
                "3/4 cup heavy whipping cream",
                "2/3 cup part-skim ricotta cheese",
                "1/2 cup sugar",
                "1/2 cup miniature semisweet chocolate chips"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottom of a greased 15x10x1-in. baking pan with parchment; grease paper.",
                "In a large bowl, beat eggs on high speed 3 minutes. Gradually add sugar, beating until thick and lemon-colored. Beat in pumpkin. In another bowl, whisk flour, pie spice, baking powder and baking soda; fold into egg mixture. Transfer to prepared pan, spreading evenly.",
                "Bake 12-15 minutes or until top springs back when lightly touched. Cool 5 minutes. Invert onto a tea towel dusted with confectioners’ sugar. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a bowl, beat cream until stiff peaks form. In another bowl, mix ricotta cheese and sugar until blended; stir in chocolate chips. Fold in whipped cream.",
                "Unroll cake; spread filling over cake to within 1/4 in. of edges. Roll up again, without towel. Place on a platter, seam side down. Dust with confectioners’ sugar. Refrigerate, covered, at least 3 hours until serving."
            ],
            "nutrition": "1 piece: 254 calories, 10g fat (6g saturated fat), 68mg cholesterol, 110mg sodium, 38g carbohydrate (30g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Rhubarb Jelly-Roll Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps17490_CW10255D31A-3.jpg",
            "expert": "This jelly-roll recipe came from my mom's cookbook, circa 1940. It's continued to by a family classic and is popular at church potlucks. Soon, I'll be introducing this rhubarb cake to kids in my 4-H cooking class.",
            "time": "Prep: 35 min. Bake: 15 min. + cooling",
            "makes": "10-12 servings",
            "ingredients": [
                "6 cups chopped fresh or frozen rhubarb",
                "2-3/4 cups sugar, divided",
                "2 teaspoons ground cinnamon",
                "1/4 teaspoon ground allspice",
                "1/8 teaspoon ground cloves",
                "4 large eggs",
                "1 teaspoon lemon extract",
                "3/4 cup all-purpose flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "Confectioners' sugar"
            ],
            "directions": [
                "In a large saucepan, combine the rhubarb, 2 cups sugar, cinnamon, allspice and cloves. Bring to a boil. Reduce heat; cook, uncovered, over medium heat until thickened, stirring occasionally. Cool completely.",
                "Line a greased 15x10x1-in. baking pan with waxed paper. Grease the paper; set aside. In a large bowl, beat eggs for 3 minutes. Gradually add remaining sugar; beat for 2 minutes or until mixture becomes thick and lemon-colored. Stir in extract. Combine dry ingredients; fold into egg mixture. Spread batter evenly in prepared pan.",
                "Bake at 375° for 15-17 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "Unroll cake; spread filling evenly over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter. Cover and refrigerate for 1 hour. Dust with confectioners' sugar just before serving.",
                ""
            ],
            "nutrition": "1 piece: 251 calories, 2g fat (1g saturated fat), 71mg cholesterol, 156mg sodium, 56g carbohydrate (48g sugars, 2g fiber), 3g protein."
        },
        {
            "name": "Apple Butter Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Apple-Butter-Cake-Roll_EXPS_TGCKBZ18_34051_B05_03_3b-4.jpg?fit=700,1024",
            "expert": "This is a new take on a pumpkin roll. Her spicy gingerbread cake might make you think back fondly to Christmas at Grandma's! —Debbie White, Williamson, West Virginia",
            "time": "Prep: 35 min. Bake: 15 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "3 large eggs",
                "1 cup all-purpose flour, divided",
                "2 tablespoons plus 1/2 cup sugar, divided",
                "2 teaspoons ground cinnamon",
                "1 teaspoon baking powder",
                "1 teaspoon ground ginger",
                "1 teaspoon ground cloves",
                "1/4 teaspoon baking soda",
                "1/4 cup butter, melted",
                "1/4 cup molasses",
                "2 tablespoons water",
                "1 tablespoon confectioners' sugar",
                "2 cups apple butter"
            ],
            "directions": [
                "Preheat oven to 375°. Place egg whites in a small bowl; let stand at room temperature for 30 minutes. Line a greased 15x10x1-in. baking pan with waxed paper and grease the paper. Sprinkle with 1 tablespoon flour and 2 tablespoons sugar; set aside.",
                "In a large bowl, combine remaining flour and 1/2 cup sugar; add the cinnamon, baking powder, ginger, cloves and baking soda. In another bowl, whisk the egg yolks, butter, molasses and water. Add to dry ingredients and beat until blended. Beat egg whites on medium speed until soft peaks form; fold into batter. Pour into prepared pan.",
                "Bake for 12-14 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "Unroll cake; spread apple butter to within 1/2 in. of edges. Roll up again. Cover and chill for 1 hour before serving. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 186 calories, 4g fat (2g saturated fat), 45mg cholesterol, 100mg sodium, 35g carbohydrate (26g sugars, 1g fiber), 2g protein. Diabetic Exchanges: 2 starch, 1 fat."
        },
        {
            "name": "Chocolate Cherry Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps39685_THHC1194786D52A-5.jpg",
            "expert": "Serve up a little luxury with an elegant dessert that's easy to make. Cherries and chocolate are the perfect partners for this moist yellow cake. —Jane Shapton, Irvine, California",
            "time": "Prep: 45 min. Bake: 10 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "4 eggs",
                "3/4 cup sugar",
                "3/4 cup cake flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "Confectioners' sugar",
                "FILLING:",
                "1-1/4 cups reduced-fat whipped topping",
                "3 tablespoons chocolate syrup",
                "3 cups fresh or frozen pitted sweet cherries, thawed, chopped and drained",
                "FROSTING:",
                "1 cup reduced-fat whipped topping",
                "2 tablespoons chocolate syrup",
                "Additional fresh sweet cherries, optional"
            ],
            "directions": [
                "Preheat oven to 400°. Line a 15x10x1-in. baking pan with waxed paper; coat the paper with cooking spray and set aside. In a large bowl, beat eggs for 3 minutes. Gradually beat in sugar; beat 2 minutes or until thick and lemon-colored. Combine flour, baking powder and salt; gradually add to egg mixture and mix well.",
                "Spread evenly into prepared pan. Bake 8-10 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, combine whipped topping and chocolate syrup; fold in cherries. Unroll cake; spread filling evenly over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter.",
                "For frosting, combine whipped topping and chocolate syrup. Frost cake; garnish with cherries if desired. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 189 calories, 4g fat (2g saturated fat), 71mg cholesterol, 157mg sodium, 35g carbohydrate (25g sugars, 1g fiber), 3g protein."
        },
        {},
        {
            "name": "Persimmon Nut Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps9306_THCB1415561D11165b-4.jpg",
            "expert": "For holiday gift-giving, I make a dozen or so of these rolls to share with friends and neighbors. They slice nicely straight from the freezer.",
            "time": "Prep: 25 min. Bake: 15 min. + cooling",
            "makes": "10 servings",
            "ingredients": [
                "3 large eggs",
                "1 cup sugar",
                "2/3 cup mashed ripe persimmon pulp",
                "1 teaspoon lemon juice",
                "1 cup self-rising flour",
                "2 teaspoons ground cinnamon",
                "1 teaspoon baking powder",
                "1 teaspoon ground ginger",
                "1/2 teaspoon salt",
                "1/2 teaspoon ground nutmeg",
                "1 cup chopped pecans",
                "FILLING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "1 cup confectioners' sugar",
                "1 teaspoon vanilla extract",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Line a 15x10x1-in. baking pan with waxed paper and grease the paper; set aside. In a large bowl, beat eggs for 5 minutes on medium speed or until lemon-colored. Gradually add the sugar, persimmon pulp and lemon juice; beat for 3 minutes. Combine the flour, cinnamon, baking powder, ginger, salt and nutmeg; add to egg mixture and beat well.",
                "Spread batter evenly in prepared pan; sprinkle with pecans. Bake at 375° for 15 minutes or until lightly browned.",
                "Cool in pan for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a small bowl, beat cream cheese and butter until smooth. Beat in the confectioners' sugar and vanilla until desired spreading consistency is reached.",
                "Unroll cake and spread filling evenly over cake to within 1/2 in. of edges. Roll up again. Cover and refrigerate until serving. Dust with additional confectioners' sugar. Refrigerate or freeze leftovers."
            ],
            "nutrition": "1 slice: 402 calories, 23g fat (9g saturated fat), 101mg cholesterol, 435mg sodium, 47g carbohydrate (33g sugars, 2g fiber), 6g protein."
        },
        {},
        {
            "name": "Raspberry Matcha Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2022/02/Raspberry-Matcha-Cake-Roll_EXPS_RC21_264622_B09_09_5b.jpg?fit=700,1024",
            "expert": "This tender cake roll with whipped cream has a very light texture and is perfect for spring. The raspberries give the whipped cream filling a pretty pale pink color. Strawberries could also be used instead of raspberries. —Kaori Shinohara, Paramus, New Jersey",
            "time": "Prep: 25 min. + cooling Bake: 10 min. + chilling",
            "makes": "8 servings",
            "ingredients": [
                "1/2 cup cake flour",
                "1 tablespoon matcha (green tea powder)",
                "3 large eggs, separated, room temperature",
                "5 tablespoons sugar, divided",
                "1/4 cup whole milk",
                "1 tablespoon avocado or canola oil",
                "1/2 teaspoon vanilla extract",
                "Confectioners' sugar",
                "FILLING:",
                "3/4 cup fresh raspberries",
                "2 tablespoons sugar, divided",
                "2/3 cup heavy whipping cream"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottom of a greased 15x10x1-in. cake pan with parchment. Sift cake flour and matcha powder together twice.",
                "In another large bowl, beat egg yolks and 1 tablespoon sugar until slightly thickened. Beat on high speed until thick and lemon-colored. Beat in milk, oil and vanilla. Fold in flour mixture.",
                "Place egg whites in a small bowl. With clean beaters, beat on medium until soft peaks form. Gradually add remaining 4 tablespoons sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until soft glossy peaks form. Fold a fourth of the whites into batter, then fold in remaining whites. Transfer to prepared pan, spreading evenly.",
                "Bake until top springs back when lightly touched, 10-12 minutes. Cool 5 minutes. Invert onto a tea towel dusted with confectioners’ sugar. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a small bowl, mash raspberries with 1 tablespoon sugar. Press through a fine-mesh strainer into another bowl; discard seeds. In a large bowl, beat cream until it begins to thicken. Add remaining 1 tablespoon sugar; beat until stiff peaks form. Gently fold in 2 tablespoons raspberry puree.",
                "Unroll cake; spread filling over cake to within 1/2 in. of edges. Roll up again, without towel; trim ends. Place on a platter, seam side down. Refrigerate, covered, at least 30 minutes before serving. Serve with remaining raspberry puree. If desired, garnish with additional whipped cream and raspberries."
            ],
            "nutrition": "1 piece: 194 calories, 11g fat (6g saturated fat), 93mg cholesterol, 36mg sodium, 19g carbohydrate (12g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Chocolate Gingerbread Yule Log",
            "image_url": "",
            "expert": "If you’ve tasted a yule log sponge cake, you’ll love this version with fresh ginger and spices. The holiday stunner can be made ahead. —Lauren Knoelke, Milwaukee, Wisconsin",
            "time": "Prep: 1-1/4 hours Bake: 10 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "5 large eggs, separated",
                "3/4 cup cake flour",
                "1 to 1-1/2 teaspoons each ground ginger and cinnamon",
                "1/4 teaspoon each ground nutmeg and pepper",
                "1/4 teaspoon salt",
                "1/3 cup packed dark brown sugar",
                "1/4 cup molasses",
                "2 tablespoons canola oil",
                "1 tablespoon grated fresh gingerroot",
                "1/8 teaspoon cream of tartar",
                "1/4 cup sugar",
                "Baking cocoa",
                "FILLING:",
                "1 carton (8 ounces) mascarpone cheese",
                "1/3 cup confectioners' sugar",
                "2 tablespoons heavy whipping cream",
                "1/8 teaspoon salt",
                "1/3 cup crystallized ginger, dried cranberries or  miniature semisweet chocolate chips",
                "CHOCOLATE BARK:",
                "4 to 6 ounces high-quality bittersweet chocolate, melted",
                "BUTTERCREAM:",
                "2 large egg whites",
                "1/2 cup sugar",
                "1/8 teaspoon salt",
                "3/4 cup unsalted butter, softened",
                "4 ounces high-quality milk chocolate, melted and cooled"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 350°. Line bottom of a greased 15x10x1-in. baking pan with parchment; grease paper. Sift flour, spices and salt together twice.",
                "In another large bowl, beat egg yolks until slightly thickened. Gradually add brown sugar, beating on high speed until thick. Beat in molasses, oil and fresh ginger. Fold in flour mixture (batter will be thick).",
                "Add cream of tartar to egg whites; with clean beaters, beat on medium until soft peaks form. Gradually add sugar, 1 tablespoon at a time, beating after each addition until sugar is dissolved. Beat on high until stiff, glossy peaks form. Using a large spatula, fold a fourth of the whites into batter, then fold in remaining whites. Transfer to prepared pan, spreading evenly.",
                "Bake until top springs back when lightly touched, 10-12 minutes. Cool 5 minutes. Invert onto a tea towel dusted with cocoa. Gently peel off paper. Roll up cake in towel jelly-roll style. Cool completely on a wire rack.",
                "For filling, in a small bowl, mix mascarpone cheese, confectioners' sugar, cream and salt just until blended; stir in ginger. Refrigerate, covered, while preparing bark and buttercream.",
                "For bark, line the underside of a 15x10x1-in. baking pan with parchment. Using an offset spatula, spread melted chocolate in a thin, even layer on parchment. Refrigerate until set, about 30 minutes.",
                "For buttercream, place egg whites, sugar and salt in a heatproof bowl; whisk until blended. Place bowl over simmering water in a large saucepan over medium heat. Whisking constantly, heat mixture until a thermometer reads 160°, 1-2 minutes.",
                "Remove from heat. With the whisk attachment of a mixer, beat on high speed until stiff glossy peaks form and mixture has cooled, about 5 minutes. Gradually beat in butter, a few tablespoons at a time, on medium speed until smooth. Beat in cooled chocolate.",
                "To assemble, unroll cake; spread filling over cake to within 1/4 in. of edges. Roll up again, without towel; trim ends. Transfer to a platter. Spread buttercream over cake.",
                "To decorate cake, lift chilled chocolate with fingers and break carefully into shards; arrange over buttercream, overlapping slightly. If chocolate becomes too soft, return to refrigerator as necessary.",
                "Refrigerate cake, loosely covered, until serving. Using a serrated knife, cut cake into slices.",
                "Freezer Option: Entire cake can be made up to 1 week before serving. Prepare and decorate cake as directed; freeze 2 hours or until firm. Wrap cake in several layers of plastic wrap. Return to freezer; freeze for up to 1 week. To serve, partially thaw wrapped cake in refrigerator overnight. Carefully remove plastic wrap; let cake stand at room temperature 15-30 minutes before serving."
            ],
            "nutrition": "1 piece: 373 calories, 24g fat (13g saturated fat), 103mg cholesterol, 121mg sodium, 38g carbohydrate (29g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Orange Ricotta Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Orange-Ricotta-Cake-Roll_EXPS_HRBZ17_159774_B09_06_5b-1.jpg?fit=700,1024",
            "expert": "I come from a big Italian family where my mom cooked and baked many delicious meals and desserts from scratch. Now I like to do the same for my family. This cake is my finale to our Italian Christmas Eve dinner. —Cathy Banks, Encinitas, California",
            "time": "Prep: 45 min. Bake: 10 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, separated, room temperature",
                "1/4 cup baking cocoa",
                "2 tablespoons all-purpose flour",
                "1/8 teaspoon salt",
                "2/3 cup confectioners' sugar, sifted, divided",
                "1 teaspoon vanilla extract",
                "1/2 teaspoon cream of tartar",
                "FILLING:",
                "1 container (15 ounces) ricotta cheese",
                "3 tablespoons mascarpone cheese",
                "1/3 cup sugar",
                "1 tablespoon Kahlua (coffee liqueur)",
                "1 tablespoon grated orange zest",
                "1/2 teaspoon vanilla extract",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Place egg whites in a bowl. Preheat oven to 325°. Line bottom of a greased 15x10x1-in. baking pan with parchment; grease paper. Sift cocoa, flour and salt together twice.",
                "In a large bowl, beat egg yolks until slightly thickened. Gradually add 1/3 cup confectioners' sugar, beating on high speed until thick and lemon-colored. Beat in vanilla. Fold in cocoa mixture (batter will be very thick).",
                "Add cream of tartar to egg whites; with clean beaters, beat on medium until soft peaks form. Gradually add remaining confectioners' sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until soft glossy peaks form. Fold a fourth of the whites into batter, then fold in remaining whites. Transfer to prepared pan, spreading evenly.",
                "Bake until top springs back when lightly touched, 9-11 minutes. Cover cake with waxed paper; cool completely on a wire rack.",
                "Remove waxed paper; invert cake onto an 18-in.-long sheet of waxed paper dusted with confectioners' sugar. Gently peel off parchment.",
                "In a small bowl, beat cheeses and sugar until blended. Stir in Kahlua, orange zest and vanilla. Spread over cake to within 1/2 in. of edges. Roll up jelly-roll style, starting with a short side. Trim ends; place on a platter, seam side down.",
                "Refrigerate, covered, at least 1 hour before serving. To serve, dust with confectioners’ sugar."
            ],
            "nutrition": "1 slice: 169 calories, 9g fat (5g saturated fat), 94mg cholesterol, 95mg sodium, 17g carbohydrate (14g sugars, 0 fiber), 7g protein.  Diabetic Exchanges: 2 fat, 1 starch."
        },
        {
            "name": "Angel Food Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Angel-Food-Cake-Roll_EXPS_FT20_16977_F_0422_1_HOME-1-13.jpg?fit=700,1024",
            "expert": "There's always room for dessert—especially when it's this eye-catching angel food cake roll. We like strawberry yogurt in the filling, but different flavors work well, too. —Joan Colbert, Sigourney, Iowa",
            "time": "Prep: 30 min. + freeezing Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package (16 ounces) angel food cake mix",
                "Confectioners' sugar",
                "1 cup (8 ounces) strawberry yogurt",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "3 drops red food coloring, optional",
                "2 cups whipped topping"
            ],
            "directions": [
                "Preheat oven to 350°. Line an ungreased 15x10x1-in. pan with parchment.",
                "Prepare cake batter according to package directions. Transfer to prepared pan. Bake until top springs back when lightly touched, 15-20 minutes. Cool 5 minutes. Invert onto a tea towel dusted with confectioners' sugar. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "Whisk together yogurt, pudding mix and, if desired, food coloring. Fold in whipped topping.",
                "Unroll cake; spread yogurt mixture over cake to within 1/2 in. of edges. Roll up again, without towel. Cover tightly and freeze. Remove from freezer 30 minutes before slicing."
            ],
            "nutrition": "1 slice: 243 calories, 3g fat (3g saturated fat), 1mg cholesterol, 427mg sodium, 50g carbohydrate (37g sugars, 0 fiber), 4g protein."
        },
        {
            "name": "Sugared Red Velvet Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Sugared-Red-Velvet-Cake-Roll_exps132220_CW2376969B08_22_2bC_RMS-2.jpg?fit=700,1024",
            "expert": "Moist and tender, this classic cake wrapped around luxurious cream cheese frosting is a sweet feast for the eyes. You’ll love its melt-in-your-mouth texture.—Kristie Gentry, King, North Carolina",
            "time": "Prep: 30 min. Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs",
                "3/4 cup sugar",
                "1 bottle (1 ounce) red food coloring",
                "2 tablespoons buttermilk",
                "1 tablespoon canola oil",
                "1 teaspoon cider vinegar",
                "1 teaspoon vanilla extract",
                "3/4 cup cake flour",
                "1/4 cup baking cocoa",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "Confectioners' sugar",
                "FILLING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "3 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Line a greased 15x10x1-in. baking pan with waxed paper; grease the paper and set aside.",
                "In a large bowl, beat eggs on high speed for 3 minutes. Gradually add sugar, beating until mixture becomes thick and lemon-colored. Beat in the food coloring, buttermilk, oil, vinegar and vanilla. Combine the flour, cocoa, baking powder and salt; fold into egg mixture. Spread into prepared pan.",
                "Bake at 350° for 12-15 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "In a small bowl, beat cream cheese and butter until smooth. Beat in confectioners' sugar and vanilla. Unroll cake; spread filling over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter. Dust with additional confectioners' sugar. Refrigerate for 1 hour."
            ],
            "nutrition": "1 slice: 337 calories, 13g fat (7g saturated fat), 101mg cholesterol, 241mg sodium, 51g carbohydrate (41g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Chocolate Peppermint Log",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps46216_HCK153422B08_22_4b-12.jpg?fit=700,1024",
            "expert": "What a great make-ahead treat! This cake log is perfect for the holidays because you can make it when you have time, store it in the freezer and scratch dessert off of your to-do list. —Brenda Sinclair, Princeton, Missouri",
            "time": "Prep: 35 min. + chilling Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3 large eggs, separated",
                "1/2 cup all-purpose flour",
                "1/3 cup baking cocoa",
                "1/2 teaspoon baking powder",
                "1/4 teaspoon baking soda",
                "1/8 teaspoon salt",
                "1/3 cup plus 1/2 cup sugar, divided",
                "1/3 cup water",
                "1 teaspoon vanilla extract",
                "FILLING:",
                "1 package (8 ounces) reduced-fat cream cheese",
                "1/2 cup sugar",
                "1 carton (8 ounces) frozen reduced-fat whipped topping, thawed",
                "1/4 cup crushed peppermint candies",
                "GLAZE:",
                "5 teaspoons butter",
                "2 tablespoons baking cocoa",
                "2 tablespoons water",
                "1 cup confectioners' sugar",
                "1/2 teaspoon vanilla extract",
                "2 tablespoons crushed peppermint candies"
            ],
            "directions": [
                "Place egg whites in a small bowl; let stand at room temperature 30 minutes.",
                "Meanwhile, preheat oven to 375°. Line bottom of a 15x10x1-in. baking pan with parchment. Sift flour, cocoa, baking powder, baking soda and salt twice.",
                "In a large bowl, beat egg yolks until slightly thickened. Gradually add 1/3 cup sugar, beating on high speed until thick and lemon-colored. Beat in water and vanilla. Fold in flour mixture (batter will be very thick).",
                "With clean beaters, beat egg whites on medium until soft peaks form. Gradually add remaining sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until soft glossy peaks form. Fold a fourth of the whites into batter, then fold in remaining whites. Transfer to prepared pan, spreading evenly.",
                "Bake 12-15 minutes or until top springs back when lightly touched. Cool 5 minutes. Invert onto a kitchen towel dusted with cocoa. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a large bowl, beat cream cheese and sugar until smooth. Fold in whipped topping and peppermint candies.",
                "Unroll cake; spread filling over cake to within 1/2 in. of edges. Roll up again, without towel. Place on a platter, seam side down. Refrigerate, covered, until cold.",
                "For glaze, in a small saucepan, melt butter. Whisk in cocoa and water until blended. Bring to a boil. Remove from heat. Whisk in confectioners' sugar and vanilla until smooth. Cool slightly.",
                "Spread glaze over cake. Sprinkle with peppermint candies. Refrigerate until set, about 10 minutes."
            ],
            "nutrition": "1 slice: 286 calories, 9g fat (6g saturated fat), 70mg cholesterol, 178mg sodium, 48g carbohydrate (36g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Moist Lemon Angel Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Moist-Lemon-Angel-Cake-Roll_EXPS_HRBZ16_39665_C09_07_3b-7.jpg?fit=700,1024",
            "expert": "Tart and delicious, this pretty cake roll will tickle any lemon lover's fancy. Its feathery, angel food texture enhances its guilt-free goodness. —Taste of Home Test Kitchen",
            "time": "Prep: 30 min. Bake: 15 min. + cooling",
            "makes": "10 servings",
            "ingredients": [
                "1-1/2 teaspoons vanilla extract",
                "3/4 teaspoon cream of tartar",
                "9 large egg whites, room temperature",
                "1 cup plus 2 tablespoons sugar",
                "3/4 cup cake flour",
                "1 tablespoon confectioners' sugar",
                "FILLING:",
                "1 cup sugar",
                "3 tablespoons cornstarch",
                "1 cup water",
                "1 large egg, lightly beaten",
                "1/4 cup lemon juice",
                "1 tablespoon grated lemon zest",
                "Yellow food coloring, optional",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Line a 15x10x1-in. baking pan with waxed paper; lightly coat paper with cooking spray.",
                "Preheat oven to 350°. Add vanilla and cream of tartar to egg whites; beat on medium speed until soft peaks form. Gradually beat in sugar, 2 Tbsp. at a time, on high until stiff glossy peaks form and sugar is dissolved. Fold in flour, about 1/4 cup at a time.",
                "Gently spread batter into prepared pan. Bake until cake springs back when lightly touched, 15-20 minutes. Cool 5 minutes.",
                "Turn cake onto a kitchen towel dusted with 1 tablespoon confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "In a large saucepan, combine sugar and cornstarch; stir in water until smooth. Cook and stir over medium-high heat until thickened and bubbly. Reduce heat; cook and stir 2 minutes. Remove from heat. Stir a small amount of hot mixture into egg; return all to the pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes.",
                "Remove from heat. Gently stir in lemon juice, zest and, if desired, food coloring. Cool to room temperature without stirring.",
                "Unroll cake; spread filling to within 1/2 in. of edges. Roll up again. Place seam side down on a serving plate; sprinkle with additional confectioners' sugar."
            ],
            "nutrition": "1 piece: 243 calories, 1g fat (0 saturated fat), 21mg cholesterol, 57mg sodium, 55g carbohydrate (43g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Ice Cream Party Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps21731_QC10364D31A-3.jpg",
            "expert": "This tempting take on the much-loved cake roll features a from-scratch chocolate cake, vanilla ice cream and a layer of berry jam. Garnished with hot fudge and whipped topping, the slices are hard to resist.",
            "time": "Prep: 45 min. Bake: 10 min. + freezing",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, separated",
                "3/4 cup sugar, divided",
                "1/2 cup cake flour",
                "1/3 cup baking cocoa",
                "1 teaspoon baking powder",
                "1/4 teaspoon salt",
                "1/2 cup strawberry or raspberry jam",
                "2 cups vanilla ice cream, softened",
                "Confectioners' sugar",
                "Hot fudge topping and whipped topping"
            ],
            "directions": [
                "Place egg whites in large bowl; let stand at room temperature for 30 minutes. Line a greased 15x10x1-in. baking pan with waxed paper; grease the paper and set aside.",
                "In a large bowl, beat egg yolks and 1/2 cup sugar on high speed for 5 minutes or until thick and lemon-colored. Sift the flour, cocoa, baking powder and salt together twice; gradually add to yolk mixture and mix well (batter will be very thick).",
                "In a large bowl with clean beaters, beat egg whites on medium speed until soft peaks form. Gradually beat in remaining sugar, 1 tablespoon at a time, on high until stiff peaks form. Stir a third of the whites into batter, then fold in remaining whites. Spread evenly into prepared pan.",
                "Bake at 375° for 10-12 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert cake onto a kitchen towel dusted with confectioners' sugar. Gently peel off paper. Roll up cake in towel jelly-roll style, starting with a short side. Cool on a wire rack.",
                "Unroll cake; spread jam to within 1/2 in. of edges. Top with ice cream. Roll up without towel. Place seam side down on a platter. Cover and freeze for at least 4 hours before slicing. May be frozen for up to 2 months. Sprinkle with confectioners' sugar; serve with hot fudge topping and whipped topping."
            ],
            "nutrition": "1 piece: 184 calories, 4g fat (2g saturated fat), 72mg cholesterol, 124mg sodium, 34g carbohydrate (27g sugars, 1g fiber), 4g protein.  Diabetic Exchanges: 2 starch, 2 fat."
        },
        {
            "name": "Cinnamon Twirl Roly-Poly",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cinnamon-Twirl-Roly-Poly_EXPS_THN17_205780_C06_15_2b-5.jpg?fit=700,1024",
            "expert": "My whole house smells incredible when this cake is in the oven. Change it up with other extracts—maple is heavenly. —Holly Balzer-Harz, Malone, New York",
            "time": "Prep: 40 min. + chilling Bake: 10 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3 large eggs, room temperature",
                "3/4 cup sugar",
                "1/3 cup water",
                "1 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "1-1/2 teaspoons baking powder",
                "Dash salt",
                "6 tablespoons butter, softened",
                "1/2 cup packed brown sugar",
                "2 teaspoons ground cinnamon",
                "FILLING:",
                "4 ounces cream cheese, softened",
                "1/4 cup butter, softened",
                "1 cup confectioners' sugar",
                "1/2 teaspoon ground cinnamon",
                "1 to 2 teaspoons half-and-half cream or 2% milk",
                "1/4 cup finely chopped walnuts, optional",
                "GLAZE:",
                "1/4 cup butter",
                "1-1/2 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "2 to 3 tablespoons half-and-half cream or 2% milk",
                "1/4 cup chopped walnuts, optional"
            ],
            "directions": [
                "Preheat oven to 375°. Line bottom and sides of a greased 15x10x1-in. baking pan with parchment; grease parchment.",
                "Beat eggs on high speed until thick and pale, about 5 minutes. Gradually beat in sugar until well mixed. Reduce speed to low; beat in water and vanilla. In another bowl, whisk together flour, baking powder and salt; add to egg mixture, mixing just until combined.",
                "Transfer batter to prepared pan. Bake until cake springs back when lightly touched, 10-12 minutes. Cool 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off parchment. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "Meanwhile, beat butter, brown sugar and cinnamon until creamy. Unroll cake; spread brown sugar mixture over cake to within 1/2 in. of edges.",
                "For filling, beat cream cheese and butter until creamy. Beat in confectioners' sugar and cinnamon; gradually add cream until mixture reaches a spreadable consistency. Spread filling over brown sugar mixture. If desired, sprinkle with walnuts. Roll up again, without towel; trim ends if needed. Place on a platter, seam side down.",
                "For glaze, heat butter in a small saucepan over medium-low heat until foamy and golden, 6-8 minutes. Remove from heat. Stir in confectioners' sugar and vanilla, then add cream 1 tablespoon at a time, stirring well, until mixture reaches a pourable consistency. Slowly pour glaze over top of cake, allowing some to flow over sides. If desired, top with walnuts. Refrigerate, covered, at least 2 hours before serving."
            ],
            "nutrition": "1 slice: 396 calories, 18g fat (11g saturated fat), 93mg cholesterol, 341mg sodium, 56g carbohydrate (47g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Raspberry Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps3938_C0706C328A.jpg",
            "expert": "This is a really tasty dessert, and it doesn't have as many calories as some other sweets. It's also a lot easier to make than you might think. Give it a try!",
            "time": "Prep: 25 min. + chilling Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large egg whites, room temperature",
                "1 teaspoon lemon juice",
                "1/4 teaspoon salt",
                "1/4 cup sugar",
                "1/2 cup plus 1 tablespoon sifted cake flour",
                "1 tablespoon grated lemon zest",
                "1 package (8 ounces) spreadable cream cheese",
                "1/2 teaspoon vanilla extract",
                "1 cup whipped topping, divided",
                "1 pint fresh raspberries, divided"
            ],
            "directions": [
                "Spray a 15x10x1-in. baking pan with cooking spray; line with waxed paper and spray again. Set aside. In large bowl, beat egg whites, lemon juice and salt with electric mixer at low speed until foamy. Gradually add granulated sugar, beating at medium-high speed until soft peaks form. With whisk or rubber scraper, fold flour and lemon zest, 1/4 cup at a time, into egg white mixture. Spread batter evenly into prepared pan. Bake at 350° for 12-15 minutes or until cake springs back when touched in center. Cool on wire for 5 minutes. Cover with waxed paper, then a kitchen towel and baking sheet or bread board. Invert pan so cake lies flat on towel. Gently peel away waxed paper from top of cake. Beginning with narrow end, roll cake with towel, keeping towel and bottom waxed paper pressed to underside of cake. Place rolled cake on rack to cool.",
                "Prepare filling by combining cheese spread, vanilla and 2 tablespoons of whipped topping. Gently fold in remaining whipped topping. Cover; refrigerate until ready to use. To fill cake, carefully unroll on flat surface. With spatula, spread filling evenly over cake to within 1/2 in. of edges. Sprinkle with 1-1/2 cups raspberries. Using towel to lift edge of cake, gently roll as before, this time pulling away towel and waxed paper. Place roll, seam side down, on serving platter. Chill. Garnish with remaining raspberries and lemon zest. Serve chilled."
            ],
            "nutrition": ""
        },
        {
            "name": "Diploma Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps17734_CT10262D46-3.jpg",
            "expert": "GRADUATION GUESTS are bound to enjoy this sweet \"certificate\"...to a high degree! The yummy cake features a layer of creamy filling and fresh strawberries. By rolling up the dessert jelly-roll style, the CT kitchen staff formed an instant diploma shape. To tie it all together, our cooks created a bow and \"2002\" with red marzipan. If you like, just tint it a different shade to match a school's colors.",
            "time": "Prep: 45 min. Bake: 15 min. + cooling",
            "makes": "10 servings",
            "ingredients": [
                "1 cup all-purpose flour",
                "1/4 teaspoon salt",
                "5 large eggs, separated, room temperature",
                "2 tablespoons whole milk",
                "1/4 teaspoon cream of tartar",
                "1 cup sugar, divided",
                "FILLING/FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1 cup confectioners' sugar",
                "2 cups heavy whipping cream, whipped",
                "1 cup sliced fresh strawberries",
                "MARZIPAN RIBBON:",
                "6 tablespoons almond paste",
                "2 tablespoons light corn syrup",
                "1/2 cup plus 2 tablespoons confectioners' sugar",
                "1/2 teaspoon red liquid food coloring",
                "Whole fresh strawberries, optional"
            ],
            "directions": [
                "Line a 15x10x1-in. baking pan with parchment. Grease and flour the paper and sides of the pan. Set the pan aside.",
                "In a bowl, combine the flour and salt. Set aside.",
                "In a large bowl, beat the egg yolks and milk on low speed until foamy. Add the cream of tartar and beat for 5 minutes or until mixture is light and lemon-colored. Gradually add 1/2 cup of sugar and mix well.",
                "In a small bowl, beat the egg whites until soft peaks form. Gradually add the remaining sugar, 1 tablespoon at a time, beating until stiff glossy peaks form. Fold into the egg yolk mixture. Gently fold in the flour mixture. Pour into the prepared pan.",
                "Bake at 375° for 12-15 minutes or until the top springs back when lightly touched. Invert the cake onto a kitchen towel dusted with confectioners' sugar. Gently peel off the paper. Roll up the cake in the towel jelly-roll style, starting with a short side. Cool the cake completely on a wire rack.",
                "Filling/frosting: In a bowl, beat the cream cheese until smooth. Add the confectioners' sugar. Fold in the whipped cream.",
                "Unroll the cake. Spread 1-1/4 cups of filling evenly over the top of the cake to within 1/2 inch of the edges. Arrange the sliced strawberries on top.",
                "Roll up the cake and place on a serving platter or 13x8-in. covered board. Frost cake with the remaining filling.",
                "Marzipan: crumble the almond paste into a large bowl. Knead in the corn syrup. Gradually add the confectioners' sugar until thoroughly blended, kneading well after each addition. Add the food coloring until combined.",
                "With rolling pin, roll almond paste mixture to a 1/4 inch thickness between two sheets of waxed paper.",
                "To form ribbon, cut a 9x1-in. strip of marzipan. Referring to the photo for position, place the strip across the center of the cake roll.",
                "Cut a 6-1/2x1-in. strip and a 3-1/4x1-in. strip. Join the ends of the longer strip and pinch to seal, creating a loop. Wrap the shorter strip around the center of the loop to form the middle of the bow. Referring to the photo for position, place the bow on the cake.",
                "Cut two 4x1-in. strips. Cut a \"V\" in one end of each strip. Referring to the photo for position, tuck the straight end of each strip underneath the bow to create the ribbon ends.",
                "Using the numeral cookie cutters, cut out two \"2's\" and two \"0's\". Referring to the photo for position, place the cutouts on the cake to form \"2002\".",
                "If desired, arrange whole fresh strawberries on the platter around the cake."
            ],
            "nutrition": "1 slice: 416 calories, 20g fat (11g saturated fat), 164mg cholesterol, 174mg sodium, 55g carbohydrate (42g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Pumpkin Roll",
            "image_url": "",
            "expert": "This pumpkin roll recipe is great to keep in the freezer for a quick dessert for my family or unexpected guests, to take to a gathering, or to give as a yummy gift. —Erica Berchtold, Freeport, Illinois",
            "time": "Prep: 30 min. Bake: 15 min. + freezing",
            "makes": "10 servings",
            "ingredients": [
                "3 large eggs, separated, room temperature",
                "1 cup sugar, divided",
                "2/3 cup canned pumpkin",
                "3/4 cup all-purpose flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon ground cinnamon",
                "1/8 teaspoon salt",
                "FILLING:",
                "8 ounces cream cheese, softened",
                "2 tablespoons butter, softened",
                "1 cup confectioners' sugar",
                "3/4 teaspoon vanilla extract",
                "Additional confectioners' sugar, optional"
            ],
            "directions": [
                "Line a 15x10x1-in. baking pan with waxed paper; grease the paper and set aside. In a large bowl, beat egg yolks on high speed until thick and lemon-colored. Gradually add 1/2 cup sugar and pumpkin, beating on high until sugar is almost dissolved.",
                "In a small bowl, beat egg whites until soft peaks form. Gradually add remaining 1/2 cup sugar, beating until stiff peaks form. Fold into egg yolk mixture. Combine the flour, baking soda, cinnamon and salt; gently fold into pumpkin mixture. Spread into prepared pan.",
                "Bake at 375° until cake springs back when lightly touched, 12-15 minutes. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "In a small bowl, beat the cream cheese, butter, confectioners' sugar and vanilla until smooth. Unroll cake; spread filling evenly to within 1/2 in. of edges. Roll up again, without towel. Cover and freeze until firm. May be frozen for up to 3 months. Remove from the freezer 15 minutes before cutting. If desired, dust with confectioners’ sugar."
            ],
            "nutrition": "1 slice: 285 calories, 12g fat (7g saturated fat), 94mg cholesterol, 261mg sodium, 41g carbohydrate (32g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Rocket Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps7952_QC2162C38-3.jpg",
            "expert": "Not your ordinary birthday cake, this dessert requires almost no countdown-just start with a purchased ice cream cake roll, then frost and decorate it for takeoff. (We used construction paper to make the rocket's fins and cone.)",
            "time": "Prep/Total Time: 30 min.",
            "makes": "4-6 servings",
            "ingredients": [
                "1 each prepared ice cream cake roll (1-1/4 pounds) and slices Italian bread",
                "1 can (16 ounces) or 2 cups vanilla frosting",
                "Blue and red construction paper"
            ],
            "directions": [
                "Place ice cream roll vertically on a 10-in. plate. Frost top and sides. From blue construction paper, cut out four fins about 2-1/4-in. high and 1-1/2-in. deep. Insert fins along bottom edge of cake.",
                "For the nose cone, draw an 8-in. circle on red construction paper. With a pencil, mark eight equal sections. Cut out a three-eighths section and discard; tape cut sides together to form a cone. Place on top of cake. Serve immediately."
            ],
            "nutrition": "1 piece: 417 calories, 17g fat (4g saturated fat), 3mg cholesterol, 194mg sodium, 64g carbohydrate (58g sugars, 0 fiber), 0 protein."
        },
        {
            "name": "Chocolate Zucchini Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps10539_TH10049C1A-2.jpg",
            "expert": "\"I created this moist cake roll to use my garden zucchini,\" says Victoria Zmarzley-Hahn from Northampton, Pennsylvania.",
            "time": "Prep: 20 min. Bake: 15 min. + cooling",
            "makes": "10 servings",
            "ingredients": [
                "3 large eggs",
                "1 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "3/4 cup sugar",
                "1/2 cup baking cocoa",
                "1 teaspoon baking soda",
                "1 teaspoon ground cinnamon",
                "1/4 teaspoon salt",
                "1 cup shredded peeled zucchini",
                "FILLING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "2 teaspoons vanilla extract",
                "1 cup confectioners' sugar",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Line a greased 15x10x1-in. baking pan with waxed paper. Grease the paper; set aside. In a large bowl, beat eggs for 3 minutes. Gradually add sugar; beat for 2 minutes or until mixture becomes thick and lemon-colored. Stir in zucchini and vanilla. Combine the flour, cocoa, baking soda, cinnamon and salt; add to egg mixture until well blended. (batter will be thick).",
                "Spread batter evenly in prepared pan. Bake at 350° for 10-15 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with cocoa. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a large bowl, beat cream cheese, butter and vanilla until fluffy. Beat in confectioners' sugar until smooth.",
                "Unroll cake; spread filling evenly over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter. Dust with confectioners' sugar. Cover and refrigerate for 1 hour.",
                "",
                ""
            ],
            "nutrition": "1 each: 309 calories, 15g fat (8g saturated fat), 101mg cholesterol, 318mg sodium, 40g carbohydrate (27g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Chocolate Cherry Cream-Filled Log",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps46762_HM0436C55-4.jpg",
            "expert": "When you present this eye-catching dessert on your table, you'll be thanked with many \"ooohs\" and \"aaahs\".\r\n   It may take some time to prepare. But after you see the smiles on your family's faces, you'll agree it was worth a little extra effort.",
            "time": "Prep: 40 min. Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, separated",
                "1/3 cup plus 1/2 cup sugar, divided",
                "1 teaspoon vanilla extract",
                "1/2 cup all-purpose flour",
                "1/3 cup baking cocoa",
                "1/4 teaspoon baking powder",
                "1/4 teaspoon baking soda",
                "1/8 teaspoon salt",
                "1/3 cup water",
                "Confectioners' sugar",
                "1 can (21 ounces) cherry pie filling, divided",
                "1-1/2 cups whipped topping",
                "CHOCOLATE GLAZE:",
                "2 tablespoons butter",
                "2 tablespoons baking cocoa",
                "2 tablespoons water",
                "1 cup confectioners' sugar",
                "1/2 teaspoon vanilla extract"
            ],
            "directions": [
                "Place egg whites in small bowl; let stand at room temperature for 30 minutes. Line a greased 15x10x1-in. baking pan with waxed paper; grease the paper and set aside.",
                "In a large bowl, beat egg yolks on high speed for 5 minutes or until thick and lemon-colored. Gradually beat in 1/3 cup sugar. Beat in vanilla. Sift the flour, baking cocoa, baking powder, baking soda and salt together twice; gradually add to yolk mixture alternately with 1/3 cup water, beating well after each addition.",
                "In a small bowl with clean beaters, beat egg whites on medium speed until soft peaks form. Gradually beat in 1/2 cup sugar, 1 tablespoon at a time, on high until stiff peaks form. Gradually fold into batter. Spread evenly into prepared pan.",
                "Bake at 375° for 12-15 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a small bowl, combine 1 cup pie filling and whipped topping.",
                "Unroll cake; spread filling evenly over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter.",
                "For glaze, melt butter; whisk in cocoa and water until smooth. Cook until slightly thickened (do not boil). Remove from the heat; cool slightly. Gradually whisk in confectioners' sugar and vanilla. Pour over cake; chill. Just before serving, spoon 1/2 cup pie filling over cake. Serve with remaining pie filling."
            ],
            "nutrition": ""
        },
        {
            "name": "Strawberry Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps23624_SD950750D50C-1.jpg",
            "expert": "Marscarpone cheese, fresh strawberries and a hint of lemon flavor this mouthwatering and impressive-looking dessert from Carrie Vazzano in Rolling Meadows, Illinois. An added bonus…the waxed-paper lined pan makes for speedy cleanup! CARRIE’S TIP. For health-conscious cooks or those counting calories, skimmed milk and reduced-fat cheese make easy, slimming substitutions.—Carrie Vazzano, Rolling Meadows, Illinois",
            "time": "Prep: 45 min. Bake: 10 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, separated, room temperature",
                "2/3 cup sugar, divided",
                "1 tablespoon milk",
                "1/4 teaspoon grated lemon zest",
                "1/2 cup all-purpose flour",
                "1/4 teaspoon cream of tartar",
                "FILLING:",
                "1 carton (8 ounces) Mascarpone cheese",
                "2 tablespoons lemon juice",
                "2 tablespoons sugar",
                "2 cups sliced fresh strawberries",
                "2 teaspoons confectioners' sugar"
            ],
            "directions": [
                "Coat a 15x10x1-in. baking pan with cooking spray; line with waxed paper and coat the paper with cooking spray. Set aside.",
                "In a large bowl, beat the egg yolks, 1/3 cup sugar, milk and lemon zest. Gradually stir in flour. Add cream of tartar to egg whites; beat on medium speed until soft peaks form. Gradually beat in remaining sugar, 1 tablespoon at a time, on high until stiff glossy peaks form and sugar is dissolved. Gradually fold into egg yolk mixture.",
                "Carefully spread into prepared pan. Bake at 375° for 10-12 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners’ sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a long side. Cool completely on a wire rack.",
                "In a small bowl, combine cheese and lemon juice. Unroll cake; spread filling evenly over cake to within 1/2 in. of edges. Sprinkle with sugar and top with strawberries; roll up again. Cover and chill for 1 hour before serving. Dust with confectioners' sugar. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 190 calories, 11g fat (5g saturated fat), 95mg cholesterol, 33mg sodium, 21g carbohydrate (15g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Peppermint Cake Rolls",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Peppermint-Cake-Rolls_exps135718_TH2379806C09_04_6bC_RMS-2.jpg?fit=700,1024",
            "expert": "With angel food cake, fudge sauce and peppermints, this cake roll is easy and pretty. —Suellen Calhoun, Des Moines, Iowa",
            "time": "Prep: 25 min. Bake: 15 min + cooling",
            "makes": "2 cakes (10 slices each)",
            "ingredients": [
                "1 package (16 ounces) angel food cake mix",
                "Confectioners' sugar",
                "1 carton (16 ounces) frozen whipped topping, thawed",
                "1-1/2 teaspoons peppermint extract",
                "1 cup hot fudge ice cream topping",
                "1/2 cup crushed peppermint candies, divided",
                "Fresh mint leaves, optional"
            ],
            "directions": [
                "Line 2 greased 15x10x1-in. baking pans with waxed paper. Prepare cake mix according to package directions. Divide batter evenly into prepared pans, spreading evenly.",
                "Bake at 350° for 12-15 minutes or until tops spring back when lightly touched. Cool for 5 minutes.",
                "Invert each cake onto a kitchen towel dusted with confectioners' sugar. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "In a small bowl, mix whipped topping and extract until blended. Unroll cakes; spread each with 1-1/2 cups peppermint mixture to within 1/2 in. of edges.",
                "Cut a small hole in the corner of a food-safe plastic bag; fill with fudge topping. Drizzle each cake with half of the fudge topping; sprinkle with 2 tablespoons crushed candies. Roll up again, without towel.",
                "Transfer to platters. Frost with remaining peppermint mixture. Just before serving, top with remaining candies and, if desired, mint leaves."
            ],
            "nutrition": "1 slice: 204 calories, 5g fat (4g saturated fat), 0 cholesterol, 207mg sodium, 36g carbohydrate (27g sugars, 1g fiber), 2g protein. Diabetic exchanges:  2 starch, 1 fat."
        },
        {
            "name": "Berry Pinwheel Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Berry-Pinwheel-Cake_EXPS_CWAM17_25503_B12_13_2b-1.jpg?fit=700,1024",
            "expert": "Perfect for special meals, this lovely chiffon cake is a nice change from strawberry pie or shortcake. Don't be afraid t try this jelly-roll-style dessert...it's easy to make. Plus, the waxed paper-lined pan helps make cleanup a breeze! —Becky Ruff, McGregor, Iowa",
            "time": "Prep: 30 min. + chilling Bake: 10 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "4 large egg yolks, room temperature",
                "2 large eggs, room temperature",
                "1/2 cup sugar",
                "2 tablespoons water",
                "2 teaspoons canola oil",
                "1 teaspoon vanilla extract",
                "1 cup cake flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "Confectioners' sugar",
                "FILLING:",
                "1 cup heavy whipping cream",
                "1 tablespoon sugar",
                "3 tablespoons lemon curd",
                "2 cups coarsely chopped fresh strawberries"
            ],
            "directions": [
                "Preheat oven to 375°. Line bottom of a a greased 15x10x1-in. pan with parchment; grease parchment.",
                "Beat egg yolks and eggs on high speed 3 minutes. Gradually add sugar, beating until thick and lemon-colored. Beat in water, oil and vanilla. In another bowl, whisk together flour, baking powder and salt; fold into egg mixture. Spread evenly into prepared pan.",
                "Bake until top springs back when lightly touched, 10-12 minutes. Cool 5 minutes. Invert onto a tea towel dusted with confectioners' sugar. Gently peel off paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, beat cream until it begins to thicken. Add sugar; beat until stiff peaks form. Fold in lemon curd. Gently fold in strawberries.",
                "Unroll cake; spread filling to within 1/2 in. of edges. Roll up again, without towel; trim ends. Place on a platter, seam side down. Refrigerate, covered, 1 hour. Dust with confectioners' sugar before serving."
            ],
            "nutrition": "1 slice: 315 calories, 16g fat (8g saturated fat), 178mg cholesterol, 244mg sodium, 37g carbohydrate (22g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Budapest Roll",
            "image_url": "",
            "expert": "If you’re a fan of Yule logs and pumpkin rolls, taste my Swedish specialty made from hazelnut meringue. People are in awe every time I bring it somewhere. —Catherine Walbridge, Boise, Idaho",
            "time": "Prep: 25 min. + standing Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large egg whites",
                "2/3 cup finely ground hazelnuts",
                "6 tablespoons instant vanilla pudding mix",
                "1-1/3 cups sugar",
                "FILLING:",
                "1-1/3 cups heavy whipping cream",
                "1 tablespoon sugar",
                "1/2 teaspoon vanilla extract",
                "1 can (11 ounces) mandarin oranges, drained",
                "1 ounce bittersweet chocolate, chopped"
            ],
            "directions": [
                "Let egg whites stand at room temperature 30 minutes. Meanwhile, combine ground nuts and pudding mix. Line a 15x10x1-in. baking pan with parchment.",
                "Preheat oven to 350°. Beat egg whites on medium speed until foamy. Gradually add sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until stiff glossy peaks form. Fold in nut mixture.",
                "Pipe meringue in long strips or spread over prepared pan until entire pan is covered. Bake until set and dry, about 20 minutes. Cool completely. Cover meringue with parchment; place another baking pan on top. Flip the pans. Remove top pan; carefully peel parchment from meringue.",
                "For filling, beat cream until it begins to thicken. Add sugar and vanilla; beat until stiff peaks form. Spread cream over meringue and top with oranges; roll up jelly-roll style, starting with a long side and peeling parchment away while rolling.",
                "Microwave chocolate on high until melted, stirring occasionally. Drizzle melted chocolate over meringue roll."
            ],
            "nutrition": "1 piece: 256 calories, 13g fat (7g saturated fat), 37mg cholesterol, 68mg sodium, 33g carbohydrate (31g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Fruity Coconut Cake Roll",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps23756_LT950601D63B-2.jpg",
            "expert": "Kiwi and coconut add tropical flair to this moist, fruity and simply delicious dessert from Nancy Granaman of Burlington, Iowa. It makes a light, refreshing and stunning finale to even the fanciest meal!",
            "time": "Prep: 30 min. Bake: 20 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "1 package (16 ounces) angel food cake mix",
                "1/2 teaspoon plus 3 tablespoons confectioners' sugar, divided",
                "3/4 cup cold fat-free milk",
                "1 package (1 ounce) sugar-free instant white chocolate pudding mix",
                "1 carton (8 ounces) frozen fat-free whipped topping, thawed",
                "1/2 teaspoon coconut extract",
                "2 medium kiwifruit, peeled and thinly sliced",
                "2 cups fresh strawberries, sliced",
                "1/3 cup plus 2 tablespoons sweetened shredded coconut, divided",
                "2 tablespoons apricot spreadable fruit",
                "1/2 teaspoon hot water"
            ],
            "directions": [
                "Line a 15x10x1-in. baking pan with waxed paper; coat the paper with cooking spray and set aside. Prepare cake batter according to package directions. Spread evenly in prepared pan.",
                "Bake at 350° for 16-20 minutes or until golden brown. Turn cake onto a kitchen towel dusted with 1/2 teaspoon confectioners' sugar. Gently peel off waxed paper. Dust with remaining confectioners' sugar. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For filling, in a large bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Stir in 1 cup whipped topping. Fold in remaining whipped topping; stir in extract.",
                "Unroll cake; spread with filling to within 1 in. of edges. Arrange kiwi and strawberries over filling. Sprinkle with 1/3 cup coconut. Roll up again. Refrigerate for 1-2 hours.",
                "Toast the remaining coconut. In a small bowl, whisk spreadable fruit and water until smooth. Drizzle over cake. Sprinkle with toasted coconut. Cut into slices. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 233 calories, 2g fat (1g saturated fat), 0 cholesterol, 378mg sodium, 50g carbohydrate (36g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Lincoln Log Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps14349_TH10156C64.jpg",
            "expert": "To celebrate Presidents' Day, try this treat from Mary Thomas of Hartford, Wisconsin. \"My mother always made this cake roll in February,\" she remembers.",
            "time": "Prep: 40 min. Bake: 15 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, separated",
                "3/4 cup sugar, divided",
                "1/2 teaspoon vanilla extract",
                "3/4 cup all-purpose flour",
                "1 teaspoon baking powder",
                "1/4 teaspoon salt",
                "FROSTING:",
                "1 cup sugar",
                "3 tablespoons cornstarch",
                "1/8 teaspoon salt",
                "1 cup water",
                "2 ounces unsweetened chocolate, grated",
                "2 tablespoons plus 2 teaspoons butter",
                "1 teaspoon vanilla extract"
            ],
            "directions": [
                "In a large bowl, beat egg yolks until thick and lemon-colored. Gradually beat in 1/4 cup sugar and vanilla. In a small bowl, beat egg whites until soft peaks form. Gradually add remaining sugar, beating until stiff peaks form. Fold into egg yolk mixture. Combine the flour, baking powder and salt; fold into egg mixture.",
                "Line a greased 15x10x1-in. baking pan with waxed paper and grease the paper. Spread batter evenly into pan. Bake at 375° for 12-15 minutes or until top springs back when lightly touched. Cool for 5 minutes. Turn cake onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in towel, jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "For frosting, combine the sugar, cornstarch, salt and water in a saucepan until smooth. Bring to a boil; cook and stir for 2 minutes or until thickened. Remove from the heat. Add the chocolate, butter and vanilla; stir until melted.",
                "While frosting is warm, unroll cake and spread half of frosting over cake to within 1/2 in. of edges. Roll up. Spread remaining frosting over outside of roll. Using tines of a fork, drag along sides of cake to resemble tree bark. Refrigerate for at least 1 hour before slicing."
            ],
            "nutrition": "1 slice: 210 calories, 6g fat (3g saturated fat), 78mg cholesterol, 155mg sodium, 38g carbohydrate (29g sugars, 1g fiber), 3g protein."
        }
    ]
}