{
    "category": "Coconut Cakes",
    "recipes": [
        {
            "name": "Coconut Cake with White Chocolate Frosting",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps98108_SD163575D10_13_9b-1.jpg?fit=700,1024",
            "expert": "My husband adores coconut but not so much cake. When I take this beauty to family potlucks, he gets his coconut, too. —Sharon Rehm, New Blaine, Arkansas",
            "time": "Prep: 40 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "1-1/4 cups coconut milk (about 10 ounces)",
                "3 large eggs",
                "1/3 cup butter, melted",
                "FROSTING:",
                "1 cup butter, cubed",
                "12 ounces white baking chocolate, chopped",
                "1/2 cup coconut milk (about 4 ounces)",
                "2-1/2 cups confectioners' sugar, sifted",
                "1 to 2 cups unsweetened coconut flakes"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of two greased 8-in. round baking pans with parchment paper; grease paper.",
                "In a large bowl, combine cake mix, coconut milk, eggs and melted butter; beat on low speed 30 seconds. Beat on medium 1-1/2 minutes. Transfer to prepared pans. Bake and cool as package directs.",
                "For frosting, in a small saucepan, combine butter, chocolate and coconut milk; heat and stir over medium heat until blended. Remove from heat; gradually stir in confectioners' sugar until smooth. Transfer to a bowl.",
                "Place bowl in an ice-water bath. Using a hand mixer, beat frosting on high speed 6-8 minutes or until spreadable. Spread between layers and over top and sides of cake. Cover with coconut."
            ],
            "nutrition": "1 slice: 500 calories, 31g fat (21g saturated fat), 76mg cholesterol, 341mg sodium, 55g carbohydrate (43g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Raspberry Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps25345_SD950500D51A-2.jpg",
            "expert": "This seemed like a festive dessert to fix for the holidays, so I decided to try it out on my co-workers. They loved it!—Joanie Ward, Brownsburg, Indiana",
            "time": "Prep: 20 min. Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "3 cups sweetened shredded coconut, divided",
                "6 ounces white baking chocolate, chopped",
                "1/4 cup heavy whipping cream",
                "3/4 cup seedless raspberry jam",
                "1 cup butter, softened",
                "1 cup confectioners' sugar"
            ],
            "directions": [
                "Prepare cake batter according to package directions; fold in 2/3 cup coconut. Pour into two greased and floured 9-in. round baking pans. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a microwave, melt white chocolate and cream at 70% power for 1 minute; stir. Microwave at additional 10- to 20-second intervals, stirring until smooth.Cool to room temperature.",
                "In a small bowl, combine jam and 1 cup coconut. Spread over one cake layer; top with second layer.",
                "In a small bowl, beat butter until fluffy. Add confectioners’ sugar; beat until smooth. gradually beat in white chocolate mixture. Spread over top and sides of cake. Toast remaining coconut; press over top and sides of cake."
            ],
            "nutrition": "1 piece: 610 calories, 36g fat (20g saturated fat), 48mg cholesterol, 507mg sodium, 70g carbohydrate (49g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Banana Coconut Cake",
            "image_url": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/300x300/exps1851_CW2033C29C.jpg",
            "expert": "Meet the Cook: In our family, a meal isn't considered complete without a dessert - or, sometimes, two! This cake does keep well, but leftovers are a rarity around here.\r\n-Deanna Carruthers, Mossley, Ontario",
            "time": "Prep: 30 min. Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3/4 cup shortening",
                "1-1/2 cups sugar",
                "2 eggs",
                "1 cup mashed ripe bananas",
                "1 teaspoon vanilla extract",
                "2 cups cake flour",
                "1 teaspoon baking soda",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1/2 cup buttermilk",
                "1/2 cup chopped pecans, optional",
                "1 cup sweetened shredded coconut",
                "BUTTER CREAM FROSTING:",
                "1/2 cup shortening",
                "1/2 cup butter, softened",
                "2 cups confectioners' sugar",
                "1/2 teaspoon vanilla extract",
                "1/2 teaspoon coconut extract",
                "Pinch salt",
                "1/4 cup cold evaporated milk"
            ],
            "directions": [
                "In a bowl, cream shortening and sugar until fluffy. Add eggs; beat for 2 minutes. Add bananas and vanilla; beat for 2 minutes.",
                "Combine dry ingredients; add to creamed mixture alternately with buttermilk. Mix well. Stir in pecans if desired. Pour into two greased and floured 9-in. round baking pans. Sprinkle each with coconut.",
                "Bake at 375° for 25-30 minutes or until cake tests done; loosely cover with foil during the last 10 minutes of baking. Cool in pans 15 minutes before removing to a wire rack, coconut side up.",
                "In a bowl, cream shortening and butter. Add remaining frosting ingredients. Mix on low until combined; beat on high for 5 minutes. Place one cake layer, coconut side down, on a cake plate; spread with some of the frosting. Top with second layer, coconut side up; frost sides and 1 in. around top edge of cake, leaving coconut center showing."
            ],
            "nutrition": "1 piece: 589 calories, 32g fat (13g saturated fat), 58mg cholesterol, 373mg sodium, 72g carbohydrate (50g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "White Chocolate Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_41710_THCA1693311D149_RMS-4.jpg?fit=700,1024",
            "expert": "This eye-catching cake is my own creation. The white \"snowball\" look makes it the perfect choice for a holiday celebration. —Greta Kirby, Carthage, Tennessee",
            "time": "Prep: 25 min. + chilling Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1 cup water",
                "1 can (15 ounces) cream of coconut, divided",
                "3 egg whites",
                "1 can (5 ounces) evaporated milk",
                "2/3 cup vanilla or white chips",
                "2 ounces cream cheese, softened",
                "1 cup heavy whipping cream, divided",
                "3-1/2 cups sweetened shredded coconut, divided",
                "2 teaspoons vanilla extract, divided",
                "1/4 cup sugar"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water, 3/4 cup cream of coconut and egg whites; beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Pour into three greased and floured 9-in. round baking pans. Bake at 350° for 22-26 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For filling, in a small saucepan, combine the evaporated milk, chips, cream cheese, 3 tablespoons heavy cream and remaining cream of coconut; cook and stir over low heat until chips are melted.",
                "Remove from the heat; stir in 1-1/2 cups coconut and 1 teaspoon vanilla. Transfer to a large bowl; cover and refrigerate until mixture reaches spreading consistency, stirring occasionally.",
                "For frosting, in a large bowl, beat remaining cream until it begins to thicken. Add sugar and remaining vanilla; beat until stiff peaks form.",
                "Place bottom cake layer on a serving plate; spread with half of the filling. Repeat layers. Top with remaining cake layer. Frost top and sides of cake; sprinkle with remaining coconut. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 625 calories, 32g fat (23g saturated fat), 36mg cholesterol, 436mg sodium, 80g carbohydrate (61g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Rave Review Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps3396_coujj90p51atran-3.jpg",
            "expert": "This is just a wonderful, delicious cake-it's one of the best! I got the recipe after tasting the cake at a church supper...I've used it many times since.",
            "time": "Prep: 25 min. Bake: 25 min. + cooling",
            "makes": "20 servings",
            "ingredients": [
                "CAKE:",
                "1 package yellow cake mix (regular size)",
                "1 package (3-1/2 ounces) instant vanilla pudding mix",
                "1-1/3 cups water",
                "4 large eggs, room temperature",
                "1/4 cup vegetable oil",
                "2 cups sweetened shredded coconut",
                "1 cup chopped pecans",
                "FROSTING:",
                "4 tablespoons butter, divided",
                "2 cups sweetened shredded coconut",
                "1 package (8 ounces) cream cheese",
                "2 teaspoons milk",
                "1/2 teaspoon vanilla",
                "3-1/2 cups confectioners' sugar"
            ],
            "directions": [
                "In a large bowl, blend cake mix with pudding, water, eggs and oil. Beat at medium speed for 3 minutes. Stir in coconut and nuts. Pour into three greased and floured 8-in. round baking pans. Bake at 350° for 25-30 minutes or until cake springs back when touched in center. Cool in pans for 10 minutes. Remove to rack to complete cooling.",
                "For frosting, melt 2 tablespoons butter in skillet; add coconut and stir constantly over low heat until golden brown. Spread coconut on absorbent paper towel to cool. Cream remaining 2 tablespoons butter with cream cheese, milk and vanilla. Add sugar, beating well to blend. Stir in 1-1/2 cups toasted coconut; spread on top and sides of cake. Sprinkle remaining coconut over cake."
            ],
            "nutrition": ""
        },
        {
            "name": "Coconut Dream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/themes/bumblebee-toh-child/images/recipes/Image-69-2x.png",
            "expert": "My friends and family love this beautiful cake. I keep it refrigerated before serving to keep it moist and sweet. —Denise Carroll, Manchester, Tennessee",
            "time": "Prep: 1 hour Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "2/3 cup butter, softened",
                "1-3/4 cups sugar",
                "2 large eggs, room temperature",
                "1-1/2 teaspoons vanilla extract",
                "2-1/2 cups all-purpose flour",
                "2-1/2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1-1/4 cups 2% milk",
                "FILLING:",
                "3 cups sweetened shredded coconut",
                "1 cup confectioners' sugar",
                "1 cup sour cream",
                "FROSTING:",
                "1-1/2 cups sugar",
                "1/3 cup water",
                "2 large egg whites",
                "1/4 teaspoon cream of tartar",
                "1 teaspoon vanilla extract",
                "Additional coconut, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of two greased 9-in. round baking pans with parchment or waxed paper; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in vanilla. In another bowl, mix flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition.",
                "Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 22-27 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "In a small bowl, mix filling ingredients until blended. Using a long serrated knife, cut each cake layer horizontally in half. Place one cake layer on a serving plate. Top with a third of the filling. Repeat twice. Top with remaining cake layer. Refrigerate while preparing frosting.",
                "For frosting, in a large heavy saucepan, combine sugar, water, egg whites and cream of tartar. Beat on low speed for 1 minute. Place pan over low heat; continue beating on low until a thermometer reads 160°, 8-10 minutes. Transfer to a large bowl. Add vanilla; beat on high until stiff glossy peaks form, about 7 minutes.",
                "Spread over top and sides of cake. If desired, sprinkle with additional coconut. Refrigerate, covered, until serving."
            ],
            "nutrition": ""
        },
        {
            "name": "Coconut Citrus Layer Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps132002_THCA163696A03_31_3b-7.jpg?fit=700,1024",
            "expert": "Make a showstopper holiday treat: tender white cake layered with tangy grapefruit curd and topped with fluffy cream cheese frosting. To make it more spectacular add a little toasted coconut and some citrus garnishes. Your guests will never guess you started with a convenient boxed mix. —Carmell Childs, Ferron, UT",
            "time": "Prep: 40 min. + chilling Bake: 30 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "2/3 cup orange juice",
                "1/3 cup canola oil",
                "1/4 cup water",
                "2 tablespoons lemon juice",
                "1 teaspoon grated lemon zest",
                "1 teaspoon grated orange zest",
                "3 large eggs",
                "GRAPEFRUIT FILLING:",
                "3/4 cup sugar",
                "3 tablespoons cornstarch",
                "1/4 teaspoon salt",
                "3/4 cup water",
                "2/3 cup ruby red grapefruit juice",
                "1 tablespoon butter, cubed",
                "FROSTING:",
                "3/4 cup whipped cream cheese",
                "1/4 cup sugar",
                "3 tablespoons orange juice",
                "1 tablespoon ruby red grapefruit juice",
                "2 teaspoons grated orange zest",
                "1 cup heavy whipping cream, whipped",
                "3/4 cup sweetened shredded coconut",
                "Additional coconut, toasted, optional",
                "Orange and grapefruit slices"
            ],
            "directions": [
                "Preheat oven to 350°. Combine first eight ingredients; beat on low speed 30 seconds. Increase speed to medium; beat 2 minutes. Pour into two greased and floured 8-in. round pans. Bake until a toothpick inserted in the center comes out clean, 28-32 minutes. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "Meanwhile, for grapefruit filling, combine sugar, cornstarch and salt in a large saucepan. Stir in water and grapefruit juice until smooth. Cook and stir over medium-high heat until thickened and bubbly. Reduce heat to medium; cook and stir 2 minutes longer. Remove from heat; gently stir in butter. Cool to room temperature without stirring. Cover and refrigerate filling until cold.",
                "Place one cooled cake layer on a serving plate; top with half of cooled grapefruit filling. Repeat layers.",
                "For frosting, beat cream cheese, sugar, juices and orange zest until blended. Gently fold in whipped cream and 3/4 cup coconut. Frost sides of cake; if desired, lightly frost top of cake, covering grapefruit filling. Refrigerate until cold, 3-4 hours. Sprinkle with toasted coconut if desired. Top with orange and grapefruit slices."
            ],
            "nutrition": "1 slice (calculated without garnish): 481 calories, 25g fat (12g saturated fat), 95mg cholesterol, 430mg sodium, 60g carbohydrate (40g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Six-Layer Coconut Cake with Lemon Filling",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps178251_SF143315C10_23_5b_WEB-5.jpg?fit=700,1024",
            "expert": "I found this recipe when going through my grandmother's old files. It was originally made with an orange filling, but using lemon pudding in the filling makes it easier to prepare. It is simply the best. —Angela Leinenbach, Mechanicsvlle, Virginia",
            "time": "Prep: 1 hour + chilling Bake: 25 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "FILLING:",
                "3-1/2 cups cold whole milk",
                "2 packages (3.4 ounces each) instant lemon pudding mix",
                "1 teaspoon grated lemon zest",
                "CAKE:",
                "6 large egg whites",
                "1 cup butter, softened",
                "3 cups sugar",
                "3 teaspoons vanilla extract",
                "4 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "2 cups buttermilk",
                "FROSTING:",
                "1 cup sugar",
                "2 large egg whites, room temperature",
                "1/2 cup water",
                "1/4 teaspoon salt",
                "1/8 teaspoon cream of tartar",
                "1/4 teaspoon vanilla extract",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "In a large bowl, whisk milk, pudding mix and zest 2 minutes. Cover and refrigerate at least 1 hour.",
                "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 350°. Line bottoms of three greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in vanilla. In another bowl, whisk flour, baking soda, baking powder and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. With clean beaters, beat egg whites on high speed until stiff peaks form; gently fold into batter.",
                "Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean.  Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large heavy saucepan, combine sugar, egg whites, water, salt and cream of tartar over low heat or in a double boiler over simmering water. With a portable mixer, beat on low speed 1 minute. Continue beating on low over low heat until frosting reaches 160°, about 12 minutes.",
                "Pour into the bowl of a heavy-duty stand mixer; add vanilla. Beat on high until frosting forms stiff peaks, about 7 minutes.",
                "Using a long serrated knife, cut each cake horizontally in half. Place one cake layer on a serving plate; spread with 3/4 cup filling to within 1-inch of edge. Repeat four more times. Top with remaining cake layer. Frost top and sides of cake. Sprinkle top with coconut; gently press coconut into frosting on sides of cake. Store in the refrigerator."
            ],
            "nutrition": ""
        },
        {
            "name": "Coconut Dream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/themes/bumblebee-toh-child/images/recipes/Image-69-2x.png",
            "expert": "My friends and family love this beautiful cake. I keep it refrigerated before serving to keep it moist and sweet. —Denise Carroll, Manchester, Tennessee",
            "time": "Prep: 1 hour Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "2/3 cup butter, softened",
                "1-3/4 cups sugar",
                "2 large eggs, room temperature",
                "1-1/2 teaspoons vanilla extract",
                "2-1/2 cups all-purpose flour",
                "2-1/2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1-1/4 cups 2% milk",
                "FILLING:",
                "3 cups sweetened shredded coconut",
                "1 cup confectioners' sugar",
                "1 cup sour cream",
                "FROSTING:",
                "1-1/2 cups sugar",
                "1/3 cup water",
                "2 large egg whites",
                "1/4 teaspoon cream of tartar",
                "1 teaspoon vanilla extract",
                "Additional coconut, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of two greased 9-in. round baking pans with parchment or waxed paper; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in vanilla. In another bowl, mix flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition.",
                "Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 22-27 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "In a small bowl, mix filling ingredients until blended. Using a long serrated knife, cut each cake layer horizontally in half. Place one cake layer on a serving plate. Top with a third of the filling. Repeat twice. Top with remaining cake layer. Refrigerate while preparing frosting.",
                "For frosting, in a large heavy saucepan, combine sugar, water, egg whites and cream of tartar. Beat on low speed for 1 minute. Place pan over low heat; continue beating on low until a thermometer reads 160°, 8-10 minutes. Transfer to a large bowl. Add vanilla; beat on high until stiff glossy peaks form, about 7 minutes.",
                "Spread over top and sides of cake. If desired, sprinkle with additional coconut. Refrigerate, covered, until serving."
            ],
            "nutrition": ""
        },
        {
            "name": "German Chocolate Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps62822_THCA163696A05_28_5b-v2-2.jpg?fit=700,1024",
            "expert": "I first tried tres leches cake while in Ecuador several years ago. Since then, I’ve changed it up by adding some of my favorite ingredients, namely chocolate and coconut. This version also has a splash of rum for an adults-only treat. —Lisa Varner, El Paso, Texas",
            "time": "Prep: 20 min. + standing Bake: 25 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1 package chocolate cake mix",
                "1 can (14 ounces) sweetened condensed milk",
                "1 can (12 ounces) evaporated milk",
                "1-1/2 cups heavy whipping cream, divided",
                "1/4 cup rum",
                "3 tablespoons confectioners' sugar",
                "1/2 cup sweetened shredded coconut, toasted",
                "1/2 cup chopped pecans, toasted",
                "Chocolate syrup, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Prepare and bake cake mix according to package directions, using a 13x9-in. baking pan. Cool on a wire rack.",
                "Meanwhile, in a large bowl, whisk milks, 1/2 cup cream and rum. With a wooden skewer, poke holes in cake about 1/2 in. apart. Slowly pour milk mixture over cake, allowing mixture to absorb into cake. Let stand 30 minutes. Refrigerate, covered, 8 hours or overnight.",
                "In a small bowl, beat remaining cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Spread over top of cake. Sprinkle with coconut and pecans. If desired, drizzle servings with chocolate syrup."
            ],
            "nutrition": ""
        },
        {
            "name": "Incredible Coconut Cake",
            "image_url": "",
            "expert": "I found this coconut cake recipe in a newspaper many years ago and modified it to suit my taste. This is my all-time favorite cake, and my family and friends absolutely love it. —Lynne Bassler, Indiana, Pennsylvania",
            "time": "Prep: 35 min. Bake: 25 min. + chilling",
            "makes": "16 servings",
            "ingredients": [
                "5 large eggs, separated",
                "2 cups sugar",
                "1/2 cup butter, softened",
                "1/2 cup canola oil",
                "2-1/4 cups cake flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1 cup buttermilk",
                "2 cups sweetened shredded coconut, chopped",
                "1 teaspoon coconut extract",
                "1/2 teaspoon vanilla extract",
                "1/4 teaspoon almond extract",
                "1/4 teaspoon cream of tartar",
                "FROSTING:",
                "11 ounces cream cheese, softened",
                "2/3 cup butter, softened",
                "4-1/3 cups confectioners' sugar",
                "1-1/4 teaspoons coconut extract",
                "2 cups sweetened shredded coconut, toasted"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes.",
                "Preheat oven to 325°. In another large bowl, beat sugar, butter and oil until well blended. Add egg yolks, 1 at a time, beating well after each addition.",
                "Combine flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. Stir in coconut and extracts..",
                "Add cream of tartar to egg whites; with clean beaters, beat on medium until stiff peaks form. Fold a fourth of the egg whites into batter, then fold in remaining whites.",
                "Transfer to 3 greased and floured 9-in. round baking pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a small bowl, beat cream cheese and butter until fluffy. Add confectioners’ sugar and extract; beat until smooth.",
                "Place 1 cake layer on a serving plate; spread with 1/2 cup frosting and sprinkle with 1/3 cup coconut. Repeat. Top with remaining cake layer. Spread remaining frosting over top and sides of cake; sprinkle with remaining coconut. Refrigerate for 2 hours before cutting. Store in the refrigerator."
            ],
            "nutrition": "1 piece: 689 calories, 37g fat (21g saturated fat), 123mg cholesterol, 353mg sodium, 85g carbohydrate (64g sugars, 1g fiber), 6g protein."
        },
        {},
        {
            "name": "Cranberry Coconut Cake with Marshmallow Cream Frosting",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cranberry-Coconut-Cake-with-Marshmallow-Cream-Frosting_exps90825_HC2847498A10_12_1bC_RMS-2.jpg?fit=700,1024",
            "expert": "Filled with a homemade cranberry curd and smothered with one of the fluffiest frostings you've ever had, this tall cake will make a memorable impression at any gathering. —Julie Merriman, Seattle, Washington",
            "time": "Prep: 1 hour + chilling  Bake: 35 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1-1/2 cups butter, softened",
                "2 cups sugar",
                "5 large eggs, separated",
                "1 can (8-1/2 ounces) cream of coconut",
                "1/4 cup lime juice",
                "3 teaspoons grated lime zest",
                "3 cups all-purpose flour",
                "1-1/2 teaspoons baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1 cup buttermilk",
                "3/4 cup sweetened shredded coconut",
                "FILLING:",
                "5 cups fresh or frozen cranberries, thawed",
                "1/2 cup cranberry juice",
                "1-1/4 cups sugar",
                "3 large eggs",
                "3 large egg yolks",
                "1/4 cup butter, cubed",
                "2 tablespoons lime juice",
                "1-1/2 teaspoons grated lime zest",
                "FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1 cup marshmallow creme",
                "1/2 cup butter, softened",
                "3 cups confectioners' sugar",
                "2 cups sweetened shredded coconut, toasted",
                "Fresh cranberries, optional"
            ],
            "directions": [
                "Grease and flour two 9-in. round baking pans; set aside.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add egg yolks, one at a time, beating well after each addition. Beat in the cream of coconut, lime juice and zest. Combine the flour, baking powder, baking soda and salt; add to the creamed mixture alternately with buttermilk, beating well after each addition. Fold in coconut.",
                "In a small bowl, beat egg whites until stiff peaks form; fold into batter. Transfer to prepared pans. Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean.",
                "Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For the filling, in a large saucepan, combine cranberries and cranberry juice. Cook over medium heat until berries pop, about 12 minutes. Press cranberries through a food mill into a small bowl; discard seeds and pulp.",
                "In a small heavy saucepan over medium heat, combine cranberry mixture and sugar. Bring to a boil; cook and stir for 1 minute or until thickened. Remove from the heat.",
                "Stir a small amount of hot mixture into eggs and egg yolks; return all to the pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer. Remove from the heat. Stir in butter. Gently stir in lime juice and zest. Cool to room temperature without stirring. Cover and refrigerate until chilled.",
                "In a large bowl, beat the cream cheese, marshmallow creme and butter until light and fluffy. Add confectioners' sugar; beat until smooth.",
                "Cut each cake horizontally into two layers. Place bottom layer on a serving plate; top with a third of the filling. Repeat layers twice. Top with remaining cake layer. Frost cake. Press toasted coconut over top and sides of cake. Garnish with cranberries if desired."
            ],
            "nutrition": ""
        },
        {
            "name": "Moist Lazy Daisy Cake",
            "image_url": "",
            "expert": "We always called this Mama's never-fail recipe. I guess the same holds true for me since I've won contests with this lazy daisy cake. The tasty dessert always brings back fond memories of Mama. —Carrie Bartlett, Gallatin, Tennessee",
            "time": "Prep: 20 min. Bake: 25 min.",
            "makes": "9 servings",
            "ingredients": [
                "2 large eggs, room temperature",
                "1 cup sugar",
                "1 teaspoon vanilla extract",
                "1 cup cake flour",
                "1 teaspoon baking powder",
                "1/4 teaspoon salt",
                "1/2 cup 2% milk",
                "2 tablespoons butter",
                "FROSTING:",
                "3/4 cup packed brown sugar",
                "1/2 cup butter, melted",
                "2 tablespoons half-and-half cream",
                "1 cup sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, beat eggs, sugar and vanilla on high until thick and lemon-colored, about 4 minutes. Combine flour, baking powder and salt; add to egg mixture. Beat on low just until combined. Heat milk and butter in a small saucepan until butter melts. Add to batter; beat thoroughly (the batter will be thin). Pour batter into a greased 9-in. square baking pan.",
                "Bake until a toothpick inserted in the center comes out clean, 20-25 minutes. Cool slightly. For frosting, blend all ingredients well; spread over warm cake. Broil about 4 in. from the heat for 3-4 minutes or until the top is lightly browned."
            ],
            "nutrition": "1 piece: 405 calories, 18g fat (12g saturated fat), 78mg cholesterol, 277mg sodium, 58g carbohydrate (46g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Black Walnut Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps39755_CX1193255A09_27_4b-4.jpg",
            "expert": "I’ve been making cakes for over 60 years, and this is one of my favorites. I’m often asked to bring it to the monthly senior citizens’ fellowship meal at my church. My children and grandchildren think it’s special, too.",
            "time": "Prep: 25 min. Bake: 1 hour + cooling",
            "makes": "12 servings",
            "ingredients": [
                "2 cups sugar",
                "1 cup buttermilk",
                "1 cup canola oil",
                "4 eggs",
                "2 teaspoons coconut extract",
                "3 cups all-purpose flour",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup sweetened shredded coconut",
                "1 cup chopped black walnuts",
                "SYRUP:",
                "1 cup sugar",
                "1/2 cup water",
                "2 tablespoons butter",
                "1 teaspoon coconut extract"
            ],
            "directions": [
                "In a large bowl, beat the sugar, buttermilk, oil, eggs and extract until well blended. Combine the flour, baking powder, baking soda and salt; gradually beat into sugar mixture until blended. Stir in coconut and walnuts.",
                "Transfer to a greased and floured 10-in. fluted tube pan. Bake at 325° for 60-70 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes.",
                "Meanwhile, in a small saucepan, bring sugar and water to a boil over medium heat. Cook and stir for 5 minutes or until slightly reduced. Remove from the heat; stir in butter and extract.",
                "Remove cake from pan to a wire rack. Poke holes in warm cake with a skewer; slowly pour syrup over cake. Cool completely before cutting."
            ],
            "nutrition": "1 slice: 629 calories, 31g fat (6g saturated fat), 76mg cholesterol, 247mg sodium, 80g carbohydrate (54g sugars, 2g fiber), 9g protein."
        },
        {
            "name": "Chocolate Macaroon Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps20948_TH10385D52-1.jpg",
            "expert": "\"This cake is always popular with chocolate lovers, including my five children,\" notes Saburo Aburano of Ann Arbor, Michigan. \"I got the recipe from a dear friend more than 30 years ago.\"",
            "time": "Prep: 30 min. Bake: 55 min. + cooling",
            "makes": "12-16 servings",
            "ingredients": [
                "1 egg white",
                "3 tablespoons sugar",
                "2 cups sweetened shredded coconut, finely chopped",
                "1 tablespoon all-purpose flour",
                "CAKE BATTER:",
                "4 large eggs, separated",
                "1-3/4 cups sugar, divided",
                "1/2 cup shortening",
                "1/2 cup sour cream",
                "2 teaspoons vanilla extract",
                "1/2 cup cold brewed coffee",
                "1/4 cup buttermilk",
                "2 cups all-purpose flour",
                "1/2 cup baking cocoa",
                "1 teaspoon baking soda",
                "1 teaspoon salt",
                "FROSTING:",
                "1 cup semisweet chocolate chips, melted and cooled",
                "3 tablespoons butter, softened",
                "2 cups confectioners' sugar",
                "5 tablespoons 2% milk"
            ],
            "directions": [
                "In a small bowl, beat egg white on medium speed until soft peaks form. Gradually beat in sugar, 1 tablespoon at a time, on high until stiff glossy peaks form and sugar is dissolved. Fold in coconut and flour; set aside.",
                "In a large bowl, beat the egg whites on medium until soft peaks form. gradually beat in 1/2 cup sugar, 1 tablespoon at a time, on high until stiff glossy peaks form and sugar is dissolved; set aside.",
                "In another large bowl, cream shortening and remaining sugar until light and fluffy. Beat in the egg yolks, one at a time, beating well after each addition. Beat in sour cream and vanilla. Combine coffee and buttermilk. Combine the flour, cocoa, baking soda and salt; add to creamed mixture alternately with coffee mixture, beating well after each addition. Fold in beaten egg whites.",
                "Pour half of the batter into an ungreased 10-in. tube pan with removable bottom. Drop coconut filling by spoonfuls over batter. Top with remaining batter.",
                "Bake at 350° for 55-60 minutes or until a toothpick inserted in the center comes out clean. Immediately invert cake onto a wire rack; cool completely, about 1 hour. Run a knife around side of pan and remove.",
                "In a small bowl, beat frosting ingredients until smooth and creamy. Spread over the top and sides of cake."
            ],
            "nutrition": "1 piece: 441 calories, 19g fat (10g saturated fat), 65mg cholesterol, 310mg sodium, 66g carbohydrate (48g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "Coconut Dream Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps171453_THN143194D06_11_6b-11.jpg?fit=700,1024",
            "expert": "My daughter, Elizabeth, came up with this incredible recipe. The cream cheese in the middle is a fun surprise when someone takes their first bite. —Julie Flournoy, Laurelville, OH",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "6 ounces cream cheese, softened",
                "1-1/3 cups sugar, divided",
                "1/4 teaspoon coconut extract",
                "6 tablespoons butter, softened",
                "2 large eggs, room temperature",
                "1 teaspoon clear vanilla extract",
                "2 cups all-purpose flour",
                "1/2 teaspoon baking powder",
                "1/4 teaspoon baking soda",
                "1/8 teaspoon salt",
                "1 cup 2% milk",
                "FROSTING:",
                "12 ounces cream cheese, softened",
                "6 tablespoons butter, softened",
                "1 tablespoon water",
                "2 teaspoons clear vanilla extract",
                "1-1/2 cups confectioners' sugar",
                "1 cup sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 350°. Line 18 muffin cups with paper liners. In a small bowl, beat cream cheese, 1/3 cup sugar and coconut extract until smooth.",
                "In a large bowl, cream butter and remaining 1 cup sugar until light and fluffy. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. In another bowl, whisk flour, baking powder, baking soda and salt; add to creamed mixture alternately with milk, beating well after each addition.",
                "Spoon 1 rounded tablespoon of batter into each prepared cup. Drop cream cheese mixture by scant tablespoonfuls into center of each cupcake. Cover with remaining batter, about 1 scant tablespoon each.",
                "Bake until a toothpick inserted in the cake portion comes out clean, 16-20 minutes. Cool in pans 10 minutes before removing to wire racks to cool completely.",
                "For frosting, in a small bowl, beat cream cheese, butter, water and vanilla until blended. Gradually beat in confectioners’ sugar until smooth. Frost cupcakes; sprinkle with coconut. Refrigerate leftovers."
            ],
            "nutrition": "1 cupcake: 355 calories, 20g fat (12g saturated fat), 73mg cholesterol, 232mg sodium, 40g carbohydrate (29g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Coconut Chiffon Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Chiffon-Cake_EXPS_HBMZ18_50681_E07_12_9b-2.jpg?fit=700,1024",
            "expert": "Toasted coconut adds visual appeal to this tall and impressive cake. With an airy texture and heavenly coconut-ginger flavor,it's a lovely end to meals throughout the year.",
            "time": "Prep: 35 min. + standing Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "5 large eggs, separated",
                "3 tablespoons crystallized ginger",
                "1-1/2 cups sugar, divided",
                "2-1/4 cups cake flour",
                "2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "2 large eggs",
                "1/2 cup canola oil",
                "1/4 cup water",
                "2 teaspoons coconut extract",
                "1 teaspoon cream of tartar",
                "FROSTING:",
                "1 cup butter, softened",
                "8 cups confectioners' sugar",
                "1/2 cup evaporated milk",
                "2 teaspoons coconut extract",
                "1/2 teaspoon salt",
                "2-1/2 cups sweetened shredded coconut, toasted",
                "Optional: Candied orange and lime peel"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes.",
                "Meanwhile, place ginger and 2 tablespoons sugar in a small food processor; cover and process until finely chopped.",
                "In a large bowl, combine the flour, 1-1/4 cups sugar, baking powder, salt and ginger mixture. In another bowl, whisk the egg yolks, eggs, oil, water and extract. Add to dry ingredients; beat until well blended.",
                "Add cream of tartar and remaining sugar to egg whites; beat with clean beaters until stiff peaks form. Fold into batter.",
                "Gently spoon into 3 ungreased 9-in. round baking pans. Cut through batter with a knife to remove air pockets. Bake on the lowest oven rack at 325° for 22-26 minutes or until cake springs back when lightly touched.",
                "Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a large bowl, beat butter until fluffy. Add the confectioners’ sugar, milk, extract and salt; beat until smooth.",
                "Place bottom cake layer on a serving plate; spread with 1 cup frosting. Repeat layers twice. Frost sides of cake with remaining frosting. Press coconut over top and sides of cake. Garnish with orange and lime peel if desired. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 667 calories, 26g fat (13g saturated fat), 125mg cholesterol, 357mg sodium, 104g carbohydrate (82g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Italian Cream Cheese Cake",
            "image_url": "",
            "expert": "Buttermilk makes every bite of this awesome Italian cream cheese cake recipe moist and flavorful. I rely on this recipe year-round. —Joyce Lutz, Centerview, Missouri",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1/2 cup shortening",
                "2 cups sugar",
                "5 large eggs, separated, room temperature",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1 cup buttermilk",
                "1-1/2 cups sweetened shredded coconut",
                "1 cup chopped pecans",
                "CREAM CHEESE FROSTING:",
                "11 ounces cream cheese, softened",
                "3/4 cup butter, softened",
                "6 cups confectioners' sugar",
                "1-1/2 teaspoons vanilla extract",
                "3/4 cup chopped pecans"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour three 9-in. round baking pans. In a large bowl, cream butter, shortening and sugar until light and fluffy, 5-7 minutes. Beat in egg yolks and vanilla. Combine flour and baking soda; add to creamed mixture alternately with buttermilk. Beat until just combined. Stir in coconut and pecans.",
                "In another bowl, beat egg whites with clean beaters until stiff but not dry. Fold a fourth of the egg whites into batter, then fold in remaining whites. Pour into prepared pans.",
                "Bake until a toothpick inserted in center comes out clean, 20-25 minutes. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, beat cream cheese and butter until smooth. Beat in confectioners’ sugar and vanilla until fluffy. Stir in pecans. Spread frosting between layers and over top and sides of cake. Refrigerate."
            ],
            "nutrition": "1 piece: 736 calories, 41g fat (19g saturated fat), 117mg cholesterol, 330mg sodium, 90g carbohydrate (75g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Coconut Cream Dream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps35309_CFT960483D31C-1.jpg",
            "expert": "This pretty four-layer cake is easy to make with an instant pudding filling and 7-minute frosting. \"It tastes like coconut cream pie, so it's like getting the best of two desserts in one,\" writes Pamela Shank of Parkersburg, West Virginia.\r\n\r\n\r\nTIP: Prepare the remaining pudding according to package directions for a quick and easy dessert.",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "6 servings",
            "ingredients": [
                "3/4 cup sugar",
                "2 tablespoons shortening",
                "2 tablespoons butter, softened",
                "1 egg",
                "1 egg yolk",
                "3/4 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1/2 cup 2% milk",
                "FROSTING/FILLING:",
                "1/2 cup sugar",
                "4 teaspoons water",
                "2 teaspoons light corn syrup",
                "1 egg white",
                "1/4 teaspoon cream of tartar",
                "1/4 teaspoon vanilla extract",
                "1 cup cold 2% milk",
                "1/2 teaspoon coconut extract",
                "1/2 cup instant vanilla pudding mix",
                "6 tablespoons sweetened shredded coconut, divided"
            ],
            "directions": [
                "In a small bowl, cream the sugar, shortening and butter until light and fluffy. Beat in egg and yolk. Add vanilla. Combine the flour, baking powder and salt; add to creamed mixture alternately with milk. Beat just until combined.",
                "Pour into two 6-in. round baking pans coated with cooking spray. Bake at 350° for 20-25 minutes or until a toothpick comes out clean. Cool for 10 minutes; remove from pans to wire racks. Cool completely.",
                "In a double boiler over simmering water, combine the sugar, water, corn syrup, egg white and cream of tartar. With a portable mixer, beat on low speed for 1 minute. Continue beating on low over low heat until frosting reaches 160°, about 5 minutes. Pour into a small bowl; add vanilla. Beat on high until stiff peaks form, about 7 minutes.",
                "In a bowl, whisk the milk, extract and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Finely chop 1/4 cup coconut; fold into pudding mix.",
                "Split each cake into two horizontal layers. Spread a third of the pudding over one cake layer; repeat layers twice. Top with remaining cake. Frost top and sides. Toast remaining coconut; sprinkle over top. Store in the refrigerator."
            ],
            "nutrition": "Nutrition Facts: 1 slice equals 413 calories, 12 g fat (6 g saturated fat), 86 mg cholesterol, 445 mg sodium, 70 g carbohydrate, 1 g fiber, 6 g protein."
        },
        {
            "name": "Cupcake Easter Baskets",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cupcake-Easter-Baskets_EXPS_HCA20_20352_E03_13_4b-8.jpg?fit=700,1024",
            "expert": "These cute cupcakes with their mild orange flavor are fun to dress up for Easter. As we raised four sons and a daughter, I prepared many, many school lunches and often added these springtime treats. —Julie Johnston, Shaunavon, Saskatchewan",
            "time": "Prep: 20 min. Bake: 20 min. + cooling",
            "makes": "1-1/2 dozen",
            "ingredients": [
                "1/2 cup butter, softened",
                "1 cup sugar",
                "1 large egg, room temperature",
                "1 teaspoon grated orange zest",
                "2 cups cake flour",
                "3/4 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/4 teaspoon salt",
                "2/3 cup buttermilk",
                "FROSTING:",
                "3/4 cup butter, softened",
                "6 ounces cream cheese, softened",
                "1 teaspoon vanilla extract",
                "3 cups confectioners' sugar",
                "1 teaspoon water",
                "4 drops green food coloring",
                "1-1/2 cups sweetened shredded coconut",
                "Chocolate licorice twists",
                "Chocolate egg candy"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Beat in the egg and orange zest. Combine the flour, baking soda, baking powder and salt; add to creamed mixture alternately with buttermilk.",
                "Fill 18 paper-lined muffin cups two-thirds full. Bake until a toothpick comes out clean, 20-25 minutes. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a small bowl, beat butter, cream cheese and vanilla until smooth. Gradually beat in confectioners' sugar; spread over cupcakes. Combine water and food coloring in a large bowl; add coconut. Stir to coat. Sprinkle over cupcakes.",
                "Using a metal or wooden skewer, poke 2 holes in the top of each cupcake, 1 hole on each side. Cut licorice into 6-in. strips for handles; insert each end of a licorice piece into a hole. Decorate with candy eggs."
            ],
            "nutrition": "1 cupcake: 351 calories, 18g fat (11g saturated fat), 51mg cholesterol, 273mg sodium, 47g carbohydrate (33g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Favorite Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Favorite-Coconut-Cake_EXPS_CWFM17_39030_B11_02_5b-6.jpg?fit=700,1024",
            "expert": "When I need an impressive dessert for a special occasion, this is the recipe I turn to. My guests are glad I do! —Edna Hoffman, Hebron, Indiana",
            "time": "Prep: 45 min. Bake: 15 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "4 large egg whites",
                "3/4 cup butter, softened",
                "1-1/2 cups sugar, divided",
                "1 teaspoon almond extract",
                "1 teaspoon vanilla extract",
                "2-3/4 cups cake flour",
                "4 teaspoons baking powder",
                "3/4 teaspoon salt",
                "1 cup whole milk",
                "FROSTING:",
                "5 large egg whites",
                "1-2/3 cups sugar",
                "1 tablespoon water",
                "1/2 teaspoon cream of tartar",
                "1 teaspoon vanilla extract",
                "2-1/2 cups unsweetened coconut flakes",
                "Colored sprinkles, optional"
            ],
            "directions": [
                "Place 4 egg whites in a large bowl; let stand at room temperature 30 minutes. Line bottoms of 3 greased 9-in. round baking pans with parchment; grease parchment. Preheat oven to 350°.",
                "Cream butter and 1 cup sugar until light and fluffy, 5-7 minutes; beat in extracts. In another bowl, whisk together flour, baking powder and salt; add to creamed mixture alternately with milk.",
                "With clean beaters, beat the 4 egg whites on medium speed until soft peaks form. Gradually add remaining 1/2 cup sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until stiff glossy peaks form. Fold into batter.",
                "Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 13-17 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large heatproof bowl, whisk 5 egg whites, sugar, water and cream of tartar until blended. Place over simmering water in a large saucepan over medium heat; whisking constantly, heat mixture until a thermometer reads 160°, 2-3 minutes. Remove from heat; add vanilla. Beat on high speed until stiff glossy peaks form, about 7 minutes.",
                "Spread between layers and over top and sides of cake. Cover with coconut. If desired, decorate with sprinkles. Store, uncovered, in refrigerator."
            ],
            "nutrition": "1 piece: 400 calories, 16g fat (11g saturated fat), 24mg cholesterol, 341mg sodium, 62g carbohydrate (41g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "Coconut Pecan Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Pecan-Cupcakes_exps36499_RDS2447887D11_02_1bC_RMS-2.jpg?fit=700,1024",
            "expert": "Pecan lovers have lots to cheer about with these flavorful cupcakes. I created the recipe for my best friend, Ann, who said she loved Italian cream cake but didn't want a whole cake.  They have a wonderful aroma and fabulous flavor. —Tina Harrison, Prairieville, Louisiana",
            "time": "Prep: 50 min. Bake: 20 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "5 eggs, separated",
                "1/2 cup butter, softened",
                "1/2 cup shortening",
                "2 cups sugar",
                "3/4 teaspoon vanilla extract",
                "1/4 teaspoon almond extract",
                "1-1/2 cups all-purpose flour",
                "1/4 cup cornstarch",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "2 cups sweetened shredded coconut",
                "1 cup finely chopped pecans",
                "FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "1/2 teaspoon vanilla extract",
                "1/4 teaspoon almond extract",
                "3-3/4 cups confectioners' sugar",
                "3/4 cup chopped pecans"
            ],
            "directions": [
                "Let eggs stand at room temperature for 30 minutes. In a large bowl, cream the butter, shortening and sugar until light and fluffy. Add egg yolks, one at a time, beating well after each addition. Stir in extracts. Combine the flour, cornstarch, baking soda and salt; add to the creamed mixture alternately with buttermilk, beating well after each addition.",
                "In a small bowl, beat egg whites on high speed until stiff peaks form. Fold into batter. Stir in coconut and pecans.",
                "Fill paper-lined muffin cups three-fourths full. Bake at 350° for 20-25 minutes or until a toothpick inserted in the center comes out clean. Cool 10 minutes; remove from pans to wire racks to cool completely.",
                "In a large bowl, combine frosting ingredients until smooth; frost cupcakes. Store in the refrigerator."
            ],
            "nutrition": "1 each: 410 calories, 23g fat (10g saturated fat), 70mg cholesterol, 206mg sodium, 48g carbohydrate (38g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Citrus Poke Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Citrus-Poke-Cake_EXPS_H13x9BZ16_160576_D04_28_2b-11.jpg?fit=700,1024",
            "expert": "This old-fashioned citrus cake tastes even better the day after it is made. It is perfect for picnics or other gatherings because it transports easily and tastes wonderful room temperature or chilled. —Judi Stowell, West Kelowna, BC",
            "time": "Prep: 25 min. Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 cup 2% milk",
                "2 tablespoons white vinegar",
                "1/2 cup butter, softened",
                "1-2/3 cups sugar, divided",
                "1 large egg, room temperature",
                "2 cups all-purpose flour",
                "2 teaspoons baking powder",
                "1 teaspoon baking soda",
                "1/8 teaspoon salt",
                "2/3 cup raisins",
                "2/3 cup sweetened shredded coconut or chopped walnuts",
                "1 tablespoon grated orange zest",
                "2 teaspoons grated lemon zest",
                "1/2 cup orange juice",
                "3 tablespoons lemon juice"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 13x9-in. baking pan. In a small bowl, mix milk and vinegar; let stand 5 minutes.",
                "In a large bowl, cream butter and 1 cup sugar until light and fluffy, 5-7 minutes. Beat in milk mixture and egg. In another bowl, whisk flour, baking powder, baking soda and salt; gradually add to creamed mixture. Stir in raisins, coconut and orange and lemon zests. Pour batter into prepared pan. Bake 20-25 minutes or until a toothpick inserted in center comes out clean.",
                "Meanwhile, in a small saucepan, bring juices and remaining sugar to a boil. Reduce heat; cook and stir until sugar is dissolved. Remove cake from oven; place on a wire rack. Poke holes in warm cake with a skewer or chopstick. Pour sugar mixture evenly over cake."
            ],
            "nutrition": "1 piece: 259 calories, 8g fat (6g saturated fat), 30mg cholesterol, 241mg sodium, 44g carbohydrate (30g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Southern Lane Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Southern-Lane-Cake_EXPS_CWAM19_163373_C01_03_1b-11.jpg?fit=700,1024",
            "expert": "I just love this southern-style dessert, and so do dinner guests. With pecans, cherries and raisins in the filling and topping, this version reminds me of a fruitcake—only so much better! —Mabel Parvi, Ridgefield, Washington",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large egg whites",
                "3/4 cup butter, softened",
                "1-1/2 cups sugar",
                "1 teaspoon vanilla extract",
                "2-1/4 cups all-purpose flour",
                "2-1/2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "3/4 cup 2% milk",
                "FILLING:",
                "6 large egg yolks",
                "1 cup sugar",
                "1/2 cup butter, cubed",
                "1/4 cup bourbon",
                "1 tablespoon grated orange zest",
                "1/4 teaspoon salt",
                "3/4 cup raisins",
                "3/4 cup sweetened shredded coconut",
                "3/4 cup chopped pecans",
                "3/4 cup coarsely chopped red candied cherries",
                "1 cup heavy whipping cream, whipped and sweetened"
            ],
            "directions": [
                "Line bottoms of 3 greased 9-in. round baking pans with parchment. Grease parchment; set aside. Place egg whites in a large bowl; let stand at room temperature 30 minutes.",
                "In another large bowl, cream butter and sugar until light and fluffy. Beat in vanilla. In another bowl, whisk flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition. Beat egg whites until stiff peaks form; fold into batter. Transfer to prepared pans.",
                "Bake at 325° until a toothpick inserted in the center comes out clean, 20-25 minutes. Cool for 10 minutes before removing from pans to wire racks; remove paper. Cool completely.",
                "For filling, combine egg yolks and sugar in a large saucepan. Add butter; cook and stir over medium-low heat until sugar is dissolved and mixture thickens (do not boil). Remove from the heat. Stir in bourbon, orange zest and salt. Fold in the raisins, coconut, pecans and cherries. Cool.",
                "Place 1 cake layer on a serving plate; spread with a third of the filling. Repeat layers twice. Frost sides of cake with whipped cream. Refrigerate until serving."
            ],
            "nutrition": "1 piece: 677 calories, 36g fat (20g saturated fat), 167mg cholesterol, 469mg sodium, 81g carbohydrate (58g sugars, 2g fiber), 8g protein."
        },
        {
            "name": "Petite Pineapple Coconut Cakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Petite-Pineapple-Coconut-Cakes_exps139162_THCA2449046B03_26_1bC_RMS.jpg?fit=700,1024",
            "expert": "Defy wintry weather and transport your guests to the tropics with these beautiful, single-serving confections. Cake mix never tasted so good!—Taste of Home Test Kitchen",
            "time": "Prep: 25 min. + chilling",
            "makes": "9 servings",
            "ingredients": [
                "1 cake layer from Angel Cake Ball Pops",
                "1 cup plus 3 tablespoons pineapple preserves",
                "1 teaspoon coconut extract",
                "1-1/2 cups heavy whipping cream",
                "6 ounces cream cheese, softened",
                "1/3 cup confectioners' sugar",
                "2 cups toasted unsweetened coconut flakes"
            ],
            "directions": [
                "Cut cake horizontally into two layers. Place bottom layer on a cutting board. Combine pineapple preserves and extract; set aside 3 tablespoons for frosting. Spread remaining pineapple over top of one layer. Top with remaining cake layer; cut cake into 9 squares.",
                "In a large bowl, beat cream until stiff peaks form. In another bowl, beat the cream cheese, confectioners' sugar and reserved pineapple mixture; fold in whipped cream. Spread over the top and sides of each square. Press coconut into top and sides. Refrigerate for at least 1 hour before serving."
            ],
            "nutrition": "1 cake: 601 calories, 36g fat (21g saturated fat), 110mg cholesterol, 331mg sodium, 66g carbohydrate (49g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Mama’s Snow Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps7785_TH1605C35A.jpg",
            "expert": "For a beautiful finish to a winter meal, I serve this \"snow\" cake. This dessert is so impressive its fluffy interior and its sweet exterior.—Jim Luker, Chesapeake, Virginia",
            "time": "Prep: 40 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 cup butter, softened",
                "2 cups sugar",
                "4 large eggs, separated",
                "1 teaspoon vanilla extract",
                "1/2 teaspoon almond extract",
                "2-1/2 cups all-purpose flour",
                "2 teaspoons baking powder",
                "3/4 teaspoon salt, divided",
                "1 cup whole milk",
                "1 cup sweetened shredded coconut",
                "1-1/2 teaspoons grated orange zest",
                "ICING:",
                "2 cups sugar",
                "3 large egg whites",
                "5 tablespoons melted snow (or water)",
                "2 teaspoons light corn syrup",
                "1 teaspoon vanilla extract",
                "Sweetened shredded coconut"
            ],
            "directions": [
                "In a bowl, cream butter and sugar until light and fluffy. Add egg yolks and extracts; beat well. Combine flour, baking powder and 1/2 teaspoon salt. Add to creamed mixture alternately with milk. Add coconut and orange zest. In a small bowl, beat egg whites with remaining salt until stiff peaks form; gently fold into batter. Pour into three greased 9-in. round baking pans. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean (if wood burning stove is used, start peeking after 25 minutes). Cool in pans for 10 minutes; remove to wire racks to cool completely.",
                "For icing, combine sugar, egg whites, water and corn syrup in a heavy saucepan or double boiler. With a portable mixer, beat on low for 1 minute. Continue beating on low speed over low heat until frosting reaches 160°, about 8-10 minutes. Pour into a bowl; add vanilla. Beat on high until stiff peaks form, about 7 minutes. Place one cake layer on a serving plate. Spread with frosting and sprinkle with coconut. Repeat. Top with last layer. Frost top and sides of cake; sprinkle with coconut."
            ],
            "nutrition": "1 slice: 430 calories, 15g fat (10g saturated fat), 86mg cholesterol, 327mg sodium, 69g carbohydrate (52g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Coconut Cream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_THCA17_21759_C12_02_4b-3.jpg?fit=700,1024",
            "expert": "Have the urge to splurge? Try Deborah Protzman's moist and mouthwatering cake. \"No one who's ever eaten a piece can believe it's lower in fat\"—Deborah Protzman, Bloomington, Illinois.",
            "time": "Prep: 20 min. + chilling Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "3 large egg whites, room temperature",
                "1-1/4 cups water",
                "1/3 cup sweetened shredded coconut",
                "1 can (14 ounces) fat-free sweetened condensed milk",
                "1 teaspoon coconut extract",
                "TOPPING:",
                "1-1/2 cups reduced-fat whipped topping",
                "1/3 cup sweetened shredded coconut, toasted"
            ],
            "directions": [
                "Preheat oven to 350°. Coat a 13x9-in. pan with cooking spray.",
                "Beat cake mix, egg whites, water and coconut on low speed 30 seconds. Beat on medium 2 minutes. Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean, 20-25 minutes. Cool on a wire rack 10 minutes.",
                "Mix milk and extract. Using a large meat fork, poke holes in cake. Gently spread half of the milk mixture over cake; let stand 3 minutes. Spread with remaining milk mixture; cool 1 hour.",
                "Spread with whipped topping; sprinkle with toasted coconut. Refrigerate, covered, until cold, about 4 hours."
            ],
            "nutrition": "1 piece: 231 calories, 4g fat (3g saturated fat), 3mg cholesterol, 266mg sodium, 44g carbohydrate (32g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Coconut Cream Yummy Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Cream-Yummy-Cake_exps50685_TH1999633D08_03_2bC_RMS-5.jpg?fit=700,1024",
            "expert": "\"I found this recipe as a kid in one of my mother's cookbooks. I didn't make it until I was older and now it is requested every Christmas. Sometimes I tint the coconut red and green for the holiday.\" – Angela Renae Fox, Gober, Texas",
            "time": "Prep: 30 min. Bake: 40 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "6 large egg whites",
                "3/4 cup butter, softened",
                "1-1/3 cups sugar",
                "1 cup coconut milk",
                "1/2 cup 2% milk",
                "2 teaspoons vanilla extract",
                "2-1/4 cups cake flour",
                "2-1/2 teaspoons baking powder",
                "1 teaspoon salt",
                "SYRUP:",
                "1 can (13.66 ounces) coconut milk",
                "1 can (14 ounces) sweetened condensed milk",
                "TOPPING:",
                "1-1/2 cups heavy whipping cream",
                "3 tablespoons confectioners' sugar",
                "1/4 teaspoon vanilla extract",
                "Sweetened shredded coconut"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes.",
                "Meanwhile, in another large bowl, cream butter and sugar until light and fluffy. Combine the coconut milk, milk and vanilla. Combine the flour, baking powder and salt; add to creamed mixture alternately with milk mixture.",
                "With clean beaters, beat egg whites on medium speed until soft peaks form. Gradually fold into batter. Spread into a greased 13-in. x 9-in. baking pan.",
                "Bake at 350° for 40-45 minutes or until cake springs back when lightly touched. Place pan on a wire rack.",
                "Poke holes in cake with a skewer, about 1/2 in. apart. Combine syrup ingredients; slowly pour over cake, allowing mixture to absorb into cake. Let stand for 30 minutes. Cover and refrigerate for 2 hours.",
                "In a large bowl, beat cream until it begins to thicken. Add confectioners' sugar and vanilla; beat until soft peaks form. Spread over cake; sprinkle with coconut.",
                ""
            ],
            "nutrition": "1 piece: 491 calories, 29g fat (21g saturated fat), 66mg cholesterol, 363mg sodium, 52g carbohydrate (34g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Lemon Coconut Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemon-Coconut-Cupcakes_EXPS_TOHJJ22_36300_DR_01_20_3b-5.jpg?fit=700,1024",
            "expert": "Lemon plus coconut equals big smiles in this cupcake equation. These zesty gems are a hit with my family, friends and neighbors. —Debra Henderson, Booneville, Arkansas",
            "time": "Prep: 20 min. Bake: 20 min. + cooling",
            "makes": "15 cupcakes",
            "ingredients": [
                "3/4 cup butter, softened",
                "1 cup sugar",
                "3 large eggs, room temperature",
                "3 teaspoons grated lemon zest",
                "1/2 teaspoon vanilla extract",
                "1-1/2 cups all-purpose flour",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1/2 cup sour cream",
                "1/2 cup sweetened shredded coconut",
                "LEMON COCONUT FROSTING:",
                "4 ounces cream cheese, softened",
                "2 tablespoons butter, softened",
                "1 teaspoon grated lemon zest",
                "1/4 teaspoon vanilla extract",
                "1/4 teaspoon lemon juice",
                "1-1/4 cups confectioners' sugar",
                "3/4 cup sweetened shredded coconut, divided",
                "Lemon slices, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in lemon zest and vanilla. Combine flour, baking powder, baking soda and salt; add to creamed mixture alternately with sour cream. Beat just until combined. Fold in coconut.",
                "Fill paper-lined muffin cups three-fourths full. Bake until a toothpick inserted in the center comes out clean, 18-22 minutes. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "In a small bowl, beat cream cheese, butter, grated lemon zest, vanilla and lemon juice until fluffy. Gradually beat in confectioners' sugar until smooth; stir in 1/4 cup coconut. Frost cupcakes; sprinkle with remaining coconut. If desired, garnish with lemon slices."
            ],
            "nutrition": "1 cupcake: 327 calories, 18g fat (12g saturated fat), 85mg cholesterol, 262mg sodium, 37g carbohydrate (26g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "White Chocolate-Coconut Layer Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/White-Chocolate-Coconut-Layer-Cake_exps130618_BAFTB2307047C05_04_6b-1.jpg",
            "expert": "This cake is special to me because I took a recipe I had been making for years and added my own touches. I incorporated fresh peaches and macadamia nuts to the batter. I also switched from dark to white chocolate. My family gave the results a thumb's up. —Darl Collins, Marklevile, Indiana",
            "time": "Prep: 25 min. Bake: 35 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "8 ounces white baking chocolate, chopped",
                "3/4 cup butter, softened",
                "1-1/2 cups sugar",
                "1/8 teaspoon salt",
                "4 large eggs",
                "1 teaspoon coconut extract",
                "2-1/2 cups cake flour",
                "6 teaspoons baking powder",
                "1-1/4 cups 2% milk",
                "1 cup frozen unsweetened sliced peaches, thawed and finely chopped",
                "1/2 cup macadamia nuts, chopped, toasted",
                "FROSTING:",
                "6 ounces white baking chocolate, chopped",
                "1/4 cup heavy whipping cream",
                "1 cup butter, softened",
                "1/2 teaspoon coconut extract",
                "4 cups confectioners' sugar",
                "1 cup sweetened shredded coconut, toasted",
                "1/4 cup macadamia nuts, chopped, toasted"
            ],
            "directions": [
                "Line three 8-in. round baking pans with parchment; coat paper with cooking spray and set aside.",
                "In a small bowl, melt chocolate; set aside.",
                "In a large bowl, cream butter, sugar and salt until light and fluffy. Add eggs, 1 at a time, beating well after each addition. Beat in extract. Sift flour and baking powder; add to the creamed mixture alternately with milk, beating well after each addition.",
                "Pat peaches dry with paper towels. Fold peaches, chocolate and macadamia nuts into batter. Divide among prepared pans.",
                "Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Cool for 15 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a microwave, melt chocolate with cream; cool to room temperature. In a large bowl, beat butter and extract until fluffy; add cooled chocolate mixture. Gradually beat in confectioners' sugar.",
                "Spread between layers and over top and sides of cake. Sprinkle with coconut and macadamia nuts."
            ],
            "nutrition": ""
        },
        {
            "name": "Coconut Cake with White Chocolate Frosting",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps98108_SD163575D10_13_9b-1.jpg?fit=700,1024",
            "expert": "My husband adores coconut but not so much cake. When I take this beauty to family potlucks, he gets his coconut, too. —Sharon Rehm, New Blaine, Arkansas",
            "time": "Prep: 40 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "1-1/4 cups coconut milk (about 10 ounces)",
                "3 large eggs",
                "1/3 cup butter, melted",
                "FROSTING:",
                "1 cup butter, cubed",
                "12 ounces white baking chocolate, chopped",
                "1/2 cup coconut milk (about 4 ounces)",
                "2-1/2 cups confectioners' sugar, sifted",
                "1 to 2 cups unsweetened coconut flakes"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of two greased 8-in. round baking pans with parchment paper; grease paper.",
                "In a large bowl, combine cake mix, coconut milk, eggs and melted butter; beat on low speed 30 seconds. Beat on medium 1-1/2 minutes. Transfer to prepared pans. Bake and cool as package directs.",
                "For frosting, in a small saucepan, combine butter, chocolate and coconut milk; heat and stir over medium heat until blended. Remove from heat; gradually stir in confectioners' sugar until smooth. Transfer to a bowl.",
                "Place bowl in an ice-water bath. Using a hand mixer, beat frosting on high speed 6-8 minutes or until spreadable. Spread between layers and over top and sides of cake. Cover with coconut."
            ],
            "nutrition": "1 slice: 500 calories, 31g fat (21g saturated fat), 76mg cholesterol, 341mg sodium, 55g carbohydrate (43g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Pistachio and Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pistachio-Coconut-Cake_EXPS_THFM17_200562_A09_20_1b.jpg?fit=700,1024",
            "expert": "This coconut cake is good any time of the year, but the color is perfect for St. Patrick's Day. The secret is adding instant pistachio pudding mix into the cake mix and the frosting. —Dora May Meredith, Rockford, Illinois",
            "time": "Prep: 20 min. Bake: 40 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 white cake mix (regular size)",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 cup lemon-lime soda",
                "3/4 cup canola oil",
                "3 large eggs",
                "1/2 cup flaked coconut",
                "1/2 cup toasted shelled pistachios, chopped",
                "FROSTING:",
                "1-1/4 cups cold 2% milk",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 carton (8 ounces) frozen whipped topping, thawed",
                "TOPPINGS:",
                "1/4 cup flaked coconut, toasted",
                "1/4 cup toasted shelled pistachios, chopped"
            ],
            "directions": [
                "Preheat oven to 350°. Combine the first five ingredients; beat on low speed until moistened, about 30 seconds. Beat on medium for 2 minutes; stir in coconut and toasted pistachios.",
                "Pour into two greased 8-in. round baking pans or a greased 13x9-in. baking pan. Bake until a toothpick inserted in the center comes out clean, 40-45 minutes. Cool on a wire rack.",
                "For frosting, beat milk and pudding mix on low speed for 2 minutes. Fold in whipped topping. Spread frosting over top of cake, and, if using round pans, between layers. Top with toasted coconut and pistachios. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 380 calories, 21g fat (6g saturated fat), 36mg cholesterol, 431mg sodium, 41g carbohydrate (28g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Pistachio and Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pistachio-Coconut-Cake_EXPS_THFM17_200562_A09_20_1b.jpg?fit=700,1024",
            "expert": "This coconut cake is good any time of the year, but the color is perfect for St. Patrick's Day. The secret is adding instant pistachio pudding mix into the cake mix and the frosting. —Dora May Meredith, Rockford, Illinois",
            "time": "Prep: 20 min. Bake: 40 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 white cake mix (regular size)",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 cup lemon-lime soda",
                "3/4 cup canola oil",
                "3 large eggs",
                "1/2 cup flaked coconut",
                "1/2 cup toasted shelled pistachios, chopped",
                "FROSTING:",
                "1-1/4 cups cold 2% milk",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 carton (8 ounces) frozen whipped topping, thawed",
                "TOPPINGS:",
                "1/4 cup flaked coconut, toasted",
                "1/4 cup toasted shelled pistachios, chopped"
            ],
            "directions": [
                "Preheat oven to 350°. Combine the first five ingredients; beat on low speed until moistened, about 30 seconds. Beat on medium for 2 minutes; stir in coconut and toasted pistachios.",
                "Pour into two greased 8-in. round baking pans or a greased 13x9-in. baking pan. Bake until a toothpick inserted in the center comes out clean, 40-45 minutes. Cool on a wire rack.",
                "For frosting, beat milk and pudding mix on low speed for 2 minutes. Fold in whipped topping. Spread frosting over top of cake, and, if using round pans, between layers. Top with toasted coconut and pistachios. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 380 calories, 21g fat (6g saturated fat), 36mg cholesterol, 431mg sodium, 41g carbohydrate (28g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Pina Colada Tube Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps64352_TH153345B07_29_8b-9.jpg?fit=700,1024",
            "expert": "We named this a “pina colada” cake because it has coconut, pineapple and rum. It’s a soothing finish at the end of a big spread. —Debra Keil, Owasso, Oklahoma",
            "time": "Prep: 15 min. Bake: 45 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "1 package (3.4 ounces) instant coconut cream pudding mix",
                "1 cup canola oil",
                "3/4 cup water",
                "2 large eggs, room temperature",
                "1/4 cup rum",
                "1 cup drained crushed pineapple",
                "GLAZE:",
                "2 cups confectioners' sugar, divided",
                "2 tablespoons unsweetened pineapple juice",
                "1/4 cup cream of coconut",
                "1 tablespoon rum",
                "1/4 cup sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. fluted tube pan.",
                "In a large bowl, combine cake mix, pudding mix, oil, water, eggs and rum; beat on low speed 30 seconds. Beat on medium 2 minutes. Stir in pineapple. Transfer batter to prepared pan. Bake 45-50 minutes or until a toothpick inserted in center comes out clean. Cool in pan 15 minutes before removing to a wire rack.",
                "In a small bowl, mix 1 cup confectioners' sugar and pineapple juice; brush over warm cake. Cool cake completely.",
                "In another bowl, mix cream of coconut, rum and remaining confectioners' sugar; drizzle over cake. Sprinkle with coconut."
            ],
            "nutrition": "1 slice: 495 calories, 25g fat (5g saturated fat), 31mg cholesterol, 357mg sodium, 64g carbohydrate (47g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Snowflake Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps39944_HC1597097D189-4.jpg",
            "expert": "There will be a flurry of fuss when our eye-catching cake appears on your holiday table. Have fun fashioning snowflakes from fondant.—Taste of Home Test Kitchen",
            "time": "Prep: 2 hours + chilling Bake: 35 min./batch + cooling",
            "makes": "40 servings",
            "ingredients": [
                "CAKE BATTER:",
                "3-1/2 cups shortening",
                "7-1/2 cups sugar",
                "30 egg whites",
                "4 cups milk",
                "3 tablespoons plus 1 teaspoon clear vanilla extract",
                "10 cups all-purpose flour",
                "3 tablespoons plus 1 teaspoon baking powder",
                "1 teaspoon salt",
                "COCONUT FILLING:",
                "1 cup sugar",
                "1/3 cup cornstarch",
                "1/4 teaspoon salt",
                "2 cans (13.66 ounces each) coconut milk",
                "1 cup half-and-half cream",
                "8 egg yolks, beaten",
                "2 tablespoons butter",
                "1 teaspoon clear vanilla extract",
                "1 cup sweetened shredded coconut",
                "FROSTING:",
                "1 cup shortening",
                "1 cup butter, softened",
                "8 cups confectioners' sugar",
                "6 tablespoons milk",
                "2 teaspoons clear vanilla extract",
                "DECORATIONS AND ASSEMBLY:",
                "11 wooden dowels (eight 2-3/4 inches x 1/4 inch, three 3 inches x 1/4 inch)",
                "3 cardboard cake circles (one 8 inch, two 5 inch)",
                "3 packages (1-1/2 pounds each) ready-to-use rolled white fondant",
                "Assorted snowflake cookie cutters",
                "White edible glitter",
                "1 small new paintbrush",
                "Additional clear vanilla extract",
                "2 to 3 drops blue food coloring",
                "Pastry bag and round pastry tip #4",
                "Rock candy"
            ],
            "directions": [
                "In a large bowl, cream shortening and sugar until light and fluffy. In another bowl, combine the egg whites, milk and vanilla. Combine the flour, baking powder and salt; add to the creamed mixture alternately with egg white mixture, beating well after each addition.",
                "Pour 2 cups batter into each of four greased and floured 6-in. round baking pans. Pour 3 cups batter into each of four greased and floured 9-in. round baking pans. For 6-in. pans, bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. For 9-in. pans, bake at 350° for 27-33 minutes or until a toothpick inserted in the center comes out clean. (Smaller cake pans have a deeper fill and need to bake longer.) Cool the cakes for 10 minutes before removing from pans to wire racks to cool completely.",
                "For filling: In a large heavy saucepan, combine the sugar, cornstarch and salt. Gradually whisk in coconut milk and cream until smooth. Cook and stir over medium-high heat until thickened and bubbly. Reduce heat; cook and stir 2 minutes longer. Remove from the heat. Stir a small amount of hot filling into egg yolks; return all to the pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer. Remove from the heat; stir in butter and vanilla.",
                "Transfer to a large bowl. Cool to room temperature. Cover surface of filling with waxed paper; refrigerate until cooled. Stir in coconut.",
                "For frosting: In a large bowl, beat shortening and butter until light and fluffy. Add the confectioners’ sugar, milk and vanilla; beat until smooth.",
                "To assemble cake: Level cake tops if necessary. Place a 9-in. cake on a serving plate; spread with 1-1/4 cups filling. Top with second 9-in. cake; spread top with 3/4 cup frosting. Insert four 2-3/4-in. wooden dowels 1-2 in. apart into center of cake to support the next layers.",
                "Place third 9-in. cake on an 8-in. cardboard circle; place over cake on platter. Spread with 1-1/4 cups filling. Top with remaining 9-in. cake. Frost top and sides of cake with about 2 cups frosting, forming a crumb coating. Roll out 1-1/4 pounds of fondant into a 21-in. circle. Drape over cake and gently smooth, working from the center. Trim ends. Insert four 2-3/4-in. dowels 1 to 2 in. apart into center of cake. Set aside.",
                "On a work surface, place a 6-in. cake on a 5-in. cardboard circle. Spread with 1 cup filling; top with second 6-in. cake. Spread top with 1/2 cup frosting. Insert remaining dowels 1 to 2 in. apart into center of cake. Place third 6-in. cake on remaining cardboard circle and position on dowels; spread with 1 cup filling. Top with remaining cake. Frost top and sides of cake with about 1-1/4 cups frosting. Roll out 1-1/4 pounds of fondant into an 18-in. circle. Drape over cake and gently smooth, working from the center. Trim ends. Gently place 6-in. layer cake on 9-in. layer cake.",
                "Roll out remaining fondant to an 1/8-in. thickness. Cut with snowflake cookie cutters. Reroll scraps if desired. Place glitter in a small bowl. Press one side of each snowflake into glitter. With a paintbrush, brush vanilla over plain sides of snowflakes; secure onto cake.",
                "In a small bowl, beat food coloring and remaining frosting until smooth. Cut a small hole in the corner of a pastry bag; insert pastry tip. Fill with blue frosting; pipe desired design over cake. Decorate with rock candy. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 924 calories, 37g fat (15g saturated fat), 60mg cholesterol, 277mg sodium, 138g carbohydrate (112g sugars, 1g fiber), 8g protein."
        },
        {
            "name": "Coconut Layer Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Layer-Cake_EXPS_TOHDJ22_1634_E08_03_1b_V2-7.jpg?fit=700,1024",
            "expert": "This coconut layer cake recipe is my specialty. It's particularly wonderful for wedding or baby showers. —Marilyn Dick, Centralia, Missouri",
            "time": "Prep: 30 min. Bake: 40 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "5 large eggs, separated",
                "1/2 cup butter, softened",
                "1/2 cup shortening",
                "2 cups sugar",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1/2 teaspoon baking soda",
                "1 cup buttermilk",
                "2 cups sweetened shredded coconut",
                "1/2 cup chopped pecans",
                "FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "4 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "1/4 cup sweetened shredded coconut, toasted",
                "Pecan halves, optional"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 325°. Meanwhile, line bottoms of 2 greased 9-in. round baking pans with parchment; grease paper.",
                "Cream butter, shortening, sugar and vanilla until light and fluffy, 5-7 minutes. Add egg yolks, 1 at a time, beating well after each addition. In another bowl, whisk together flour and baking soda; beat into creamed mixture alternately with buttermilk. Stir in coconut and chopped pecans.",
                "With clean beaters, beat egg whites on medium speed until stiff peaks form; fold gently into batter. Transfer to prepared pans.",
                "Bake until a toothpick inserted in center comes out clean, 40-45 minutes. Cool 10 minutes before removing from pans to wire racks; remove paper. Cool completely.",
                "For frosting, beat cream cheese, butter, confectioners' sugar and vanilla until smooth and creamy. Spread between layers and over top and sides of cake. Top with coconut and pecan halves if desired. Store in refrigerator."
            ],
            "nutrition": "1 slice: 571 calories, 28g fat (15g saturated fat), 96mg cholesterol, 239mg sodium, 75g carbohydrate (62g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Hawaiian Sunset Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Hawaiian-Sunset-Cake_EXPS_BOBBZ22_19200_B10_06_4b.jpg?fit=700,1024",
            "expert": "This three-layer sunset cake is pretty enough for company, but it's so simple to make that you'll find yourself baking it often. A boxed mix keeps it convenient while the fruity filling makes it a crowd-pleaser. —Kara De la Vega, Suisun City, California",
            "time": "Prep: 20 min. + chilling Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package  white or orange cake mix (regular size)",
                "1-1/2 cups milk",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 package (3 ounces) orange gelatin",
                "4 large egg, room temperature",
                "1/2 cup canola oil",
                "FILLING:",
                "1 can (20 ounces) crushed pineapple, well drained",
                "2 cups sugar",
                "3-1/2 cups sweetened shredded coconut (about 10 ounces)",
                "1 cup sour cream",
                "1 carton (8 ounces) frozen whipped topping, thawed",
                "Optional: Additional toasted coconut, fresh pineapple, orange slices and fresh mint leaves"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, combine the first 6 ingredients; beat on low speed for 30 seconds. Beat on medium speed for 2 minutes.",
                "Pour into 3 greased and floured 9-in. round baking pans. Bake until a toothpick inserted in the center comes out clean, 25-30 minutes. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a large bowl, combine the pineapple, sugar, 3-1/2 cups coconut and sour cream. Set aside 1 cup for frosting. Place 1 cake on a serving plate; top with half of the remaining pineapple mixture. Repeat layers once; top with remaining cake.",
                "Fold whipped topping into the reserved pineapple mixture. Spread over top and sides of cake. If desired, top with additional coconut, sliced pineapple, orange slices and mint. Refrigerate until serving."
            ],
            "nutrition": "1 piece: 548 calories, 23g fat (12g saturated fat), 66mg cholesterol, 384mg sodium, 80g carbohydrate (61g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "Banana Skillet Upside-Down Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps173813_SD153320B12_11_8b.jpg?fit=700,1024",
            "expert": "My grandmother gave me my first cast iron skillet, and I've been cooking and baking with it ever since. Sometimes I add drained maraschino cherries to this banana skillet dessert and serve it with a ice cream. —Terri Merritts, Nashville, Tennessee",
            "time": "Prep: 25 min. Bake 35 min.",
            "makes": "10 servings",
            "ingredients": [
                "1 package (14 ounces) banana quick bread and muffin mix",
                "1/2 cup chopped walnuts",
                "1/4 cup butter, cubed",
                "3/4 cup packed brown sugar",
                "2 tablespoons lemon juice",
                "4 medium bananas, cut into 1/4-inch slices",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 375&deg. Prepare banana bread batter according to package directions; stir in walnuts.",
                "In a 10-in. ovenproof skillet, melt butter over medium heat; stir in brown sugar until dissolved. Add lemon juice; cook and stir until slightly thickened, 2-3 minutes longer. Remove from heat. Arrange bananas in a single layer over brown sugar mixture; sprinkle with coconut.",
                "Spoon prepared batter over coconut. Bake until dark golden and a toothpick inserted in center comes out clean, 35-40 minutes. Cool 5 minutes before inverting onto a serving plate. Serve warm."
            ],
            "nutrition": "1 piece: 554 calories, 22g fat (10g saturated fat), 49mg cholesterol, 459mg sodium, 82g carbohydrate (30g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Lemon-Filled Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_37945_TH1443682D22_RMS-2.jpg?fit=700,1024",
            "expert": "One of my coworkers brought this cake to a luncheon almost 40 years ago. It was so delicious that I asked for the recipe. I have baked it ever since, and it's always a hit! —Jackie Bergenheier, Wichita Falls, Texas",
            "time": "Prep: 35 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 cup butter, softened",
                "2 cups sugar",
                "3 large eggs",
                "2 teaspoons vanilla extract",
                "3-1/4 cups all-purpose flour",
                "3-1/4 teaspoons baking powder",
                "3/4 teaspoon salt",
                "1-1/2 cups 2% milk",
                "FILLING:",
                "1 cup sugar",
                "1/4 cup cornstarch",
                "1 cup water",
                "4 large egg yolks, lightly beaten",
                "1/3 cup lemon juice",
                "2 tablespoons butter",
                "FROSTING:",
                "1-1/2 cups sugar",
                "2 large egg whites",
                "1/3 cup water",
                "1/4 teaspoon cream of tartar",
                "1 teaspoon vanilla extract",
                "3 cups sweetened shredded coconut"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in vanilla. Combine the flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition.",
                "Transfer to three greased and floured 9-in. round baking pans. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For filling, in a small saucepan, combine the sugar, cornstarch and water until smooth. Bring to a boil; cook and stir 2 minutes longer or until thickened and bubbly. Remove from the heat.",
                "Stir a small amount of hot mixture into egg yolks; return all to the pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer. Remove from the heat; gently stir in lemon juice and butter. Cool to room temperature without stirring.",
                "Place one cake on serving plate; spread with half of the filling. Repeat layers. Top with remaining cake.",
                "For frosting, in a large heavy saucepan, combine the sugar, egg whites, water and cream of tartar. With a portable mixer, beat on low speed for 1 minute. Continue beating on low over low heat until frosting reaches 160°, about 10 minutes.",
                "Transfer to a large bowl; add vanilla. Beat on high until stiff peaks form, about 7 minutes. Frost top and sides of cake. Sprinkle with coconut. Store in the refrigerator."
            ],
            "nutrition": ""
        },
        {},
        {
            "name": "Coconut Tres Leches Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Tres-Leches-Cupcakes_EXPS_SDAM18_50867_D12_05_2b-2.jpg?fit=700,1024",
            "expert": "Three types of milk wonderfully moisten these cupcakes. Toasted coconut on top adds an elegant touch. —Taste of Home Test Kitchen",
            "time": "Prep: 35 min. + chilling Bake: 20 min. + cooling",
            "makes": "about 1-1/2 dozen",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "1-1/2 teaspoons vanilla extract",
                "4 large egg whites, room temperature",
                "2 cups all-purpose flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1-1/3 cups buttermilk",
                "1 can (14 ounces) sweetened condensed milk",
                "2/3 cup evaporated milk",
                "1/2 cup coconut milk",
                "WHIPPED CREAM:",
                "1-1/2 cups heavy whipping cream",
                "1/3 cup confectioners' sugar",
                "Toasted sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 350°. Line 18 muffin cups with paper liners.",
                "Cream butter and sugar until light and fluffy, 5-7 minutes. Beat in vanilla; add egg whites, 1 at a time, beating well after each addition. In another bowl, whisk together flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating after each addition.",
                "Fill prepared cups about two-thirds full. Bake until a toothpick inserted in center comes out clean, 17-20 minutes. Cool 10 minutes. Remove cupcakes to a 15x10x1-in. pan.",
                "In a bowl, mix sweetened condensed, evaporated and coconut milks. Poke holes in cupcakes, about 1/2 in. apart, with a skewer. Slowly spoon milk mixture over top, allowing it to absorb into cake. Refrigerate, covered, at least 2 hours.",
                "To serve, beat cream until it begins to thicken. Add confectioners' sugar; beat until soft peaks form. Spread or pipe over cupcakes. Top with coconut. Store in the refrigerator."
            ],
            "nutrition": "1 cupcake: 342 calories, 16g fat (11g saturated fat), 47mg cholesterol, 226mg sodium, 44g carbohydrate (33g sugars, 0 fiber), 6g protein."
        },
        {
            "name": "Holiday Snowflake Cake",
            "image_url": "",
            "expert": "The coconut sprinkled on this old-fashioned, fluffy white cake gives the impression of snow, without the cold. It's a beautiful dessert that is a fitting end to a delicious winter meal. It’s best to frost the cake just before serving as the frosting may soften over time. —Lynne Peterson, Salt Lake City, Utah",
            "time": "Prep: 40 min. Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "2 large eggs plus 4 large egg yolks, room temperature",
                "1-1/2 cups sugar",
                "1 cup 2% milk",
                "1/2 cup Kerrygold Salted Pure Irish Butter, cubed",
                "2-1/2 cups all-purpose flour",
                "1 tablespoon baking powder",
                "1 teaspoon vanilla extract",
                "1/2 cup chopped nuts, optional",
                "FROSTING:",
                "1-3/4 cups sugar",
                "1/2 cup water",
                "4 large egg whites",
                "1/2 teaspoon cream of tartar",
                "1 teaspoon vanilla extract",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "In a large bowl, beat the eggs, egg yolks and sugar until light and fluffy, about 5 minutes. In a small saucepan, heat milk and butter until butter melts. Combine flour and baking powder; add to egg mixture alternately with milk mixture. Beat until well mixed. Add vanilla. Fold in nuts if desired.",
                "Pour into 3 greased 9-in. round baking pans. Bake at 350° until a toothpick inserted in the center comes out clean, 15-18 minutes. Cool in pans 10 minutes before removing to wire racks to cool completely.",
                "For frosting, in a saucepan, combine sugar and water. Bring to a boil; cook over medium-high heat until a thermometer reads 244° (firm-ball stage).",
                "Meanwhile, beat egg whites and cream of tartar in a bowl on high speed until foamy. Slowly pour the hot sugar syrup over the egg whites while beating continuously. Continue beating on high until stiff glossy peaks form, about 7 minutes. Add vanilla; beat until frosting cools slightly and reaches desired consistency.",
                "Place 1 cake layer on a serving plate; spread with 3/4 cup frosting. Sprinkle with 1/4 cup coconut. Repeat layers. Top with remaining cake layer. Frost top and sides of cakes with remaining frosting; sprinkle with remaining coconut."
            ],
            "nutrition": "1 piece: 376 calories, 12g fat (8g saturated fat), 97mg cholesterol, 195mg sodium, 62g carbohydrate (45g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Easy Pineapple Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps13085_TH10134C37D.jpg",
            "expert": "Pairing pineapple with coconut lent a tropical flavor to the dessert served as the finale to our theme party. Shared by a former co-worker, this recipe has been in my file for 20 years and never fails to delight those who try a piece.\r\n-Gina Mueller, Converse, Texas",
            "time": "Prep: 15 min. + chilling Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package  yellow cake mix (regular size)",
                "1-1/4 cups cold 2% milk",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 can (20 ounces) crushed pineapple, drained",
                "1 envelope whipped topping mix (Dream Whip)",
                "3 ounces cream cheese, softened",
                "1/4 cup sugar",
                "1/2 teaspoon vanilla extract",
                "1/2 cup sweetened shredded coconut, toasted"
            ],
            "directions": [
                "Prepare and bake the cake according to package directions, using a greased 13x9-in. baking pan. Cool on a wire rack.",
                "In a large bowl, whisk milk and pudding mix for 2 minutes. Stir in pineapple. Spread over cake. Prepare whipped topping mix according to package directions; set aside.",
                "In a small bowl, beat the cream cheese, sugar and vanilla until smooth. Beat in 1 cup whipped topping. Fold in remaining topping. Spread over pudding. Sprinkle with coconut. Cover and refrigerate for 3 hours or overnight."
            ],
            "nutrition": ""
        },
        {
            "name": "Coconut Italian Cream Cake",
            "image_url": "",
            "expert": "I’d never tasted an Italian cream cake before moving to Colorado. Now I bake for people in the area, and this beauty is one of my most requested treats. —Ann Bush, Colorado City, Colorado",
            "time": "Prep: 50 min. Bake: 20 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "5 large eggs, separated",
                "1 cup butter, softened",
                "1-2/3 cups sugar",
                "1-1/2 teaspoons vanilla extract",
                "2 cups all-purpose flour",
                "3/4 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "1-1/3 cups sweetened shredded coconut",
                "1 cup chopped pecans, toasted",
                "FROSTING:",
                "12 ounces cream cheese, softened",
                "6 tablespoons butter, softened",
                "2-1/4 teaspoons vanilla extract",
                "5-2/3 cups confectioners' sugar",
                "3 to 4 tablespoons heavy whipping cream",
                "1/2 cup chopped pecans, toasted",
                "1/4 cup toasted sweetened shredded coconut, optional"
            ],
            "directions": [
                "Place egg whites in a small bowl; let stand at room temperature 30 minutes.",
                "Preheat oven to 350°. Line bottoms of three greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add egg yolks, one at a time, beating well after each addition. Beat in vanilla. In another bowl, whisk flour, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. Fold in coconut and pecans.",
                "With clean beaters, beat egg whites on medium speed until stiff peaks form. Gradually fold into batter. Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 20-25 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large bowl, beat cream cheese and butter until smooth. Beat in vanilla. Gradually beat in confectioners' sugar and enough cream to reach spreading consistency. Spread frosting between layers and over top and sides of cake. Sprinkle with pecans and, if desired, coconut. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 667 calories, 36g fat (18g saturated fat), 128mg cholesterol, 402mg sodium, 82g carbohydrate (68g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Pina Colada Icebox Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pina-Colada-Icebox-Cake_EXPS_SDAM18_206698_D11_29_3b-3.jpg?fit=700,1024",
            "expert": "This icebox cake has all the flavors of a pina colada. It takes just one bite to escape to a tropical island! —Rachel Lewis, Danville, Virginia",
            "time": "Prep: 25 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "1 package (8 ounces) cream cheese, softened",
                "1/2 cup confectioners' sugar",
                "1/2 teaspoon rum extract",
                "1 can (13.66 ounces) coconut milk, divided",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 container (8 ounces) frozen whipped topping, thawed",
                "15 whole graham crackers",
                "1 can (20 ounces) crushed pineapple, drained",
                "1 cup sweetened shredded coconut, toasted"
            ],
            "directions": [
                "In a large bowl, beat cream cheese, confectioners' sugar and extract until smooth. Gradually beat in 1 cup coconut milk. Add pudding mix; beat on low speed until smooth. Fold in whipped topping.",
                "Pour remaining coconut milk into a shallow dish. Quickly dip half the graham crackers into milk; allow excess to drip off. Arrange crackers in a single layer in the bottom of a 13x9-in. baking dish, breaking to fit as needed. Layer with half each of the cream cheese mixture, pineapple and coconut. Repeat layers. Refrigerate, covered, at least 4 hours before serving."
            ],
            "nutrition": "1 piece: 377 calories, 20g fat (15g saturated fat), 19mg cholesterol, 259mg sodium, 47g carbohydrate (33g sugars, 1g fiber), 3g protein."
        }
    ]
}