{
    "category": "German Chocolate Cakes",
    "recipes": [
        {
            "name": "German Chocolate Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps62822_THCA163696A05_28_5b-v2-2.jpg?fit=700,1024",
            "expert": "I first tried tres leches cake while in Ecuador several years ago. Since then, I’ve changed it up by adding some of my favorite ingredients, namely chocolate and coconut. This version also has a splash of rum for an adults-only treat. —Lisa Varner, El Paso, Texas",
            "time": "Prep: 20 min. + standing Bake: 25 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1 package chocolate cake mix",
                "1 can (14 ounces) sweetened condensed milk",
                "1 can (12 ounces) evaporated milk",
                "1-1/2 cups heavy whipping cream, divided",
                "1/4 cup rum",
                "3 tablespoons confectioners' sugar",
                "1/2 cup sweetened shredded coconut, toasted",
                "1/2 cup chopped pecans, toasted",
                "Chocolate syrup, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Prepare and bake cake mix according to package directions, using a 13x9-in. baking pan. Cool on a wire rack.",
                "Meanwhile, in a large bowl, whisk milks, 1/2 cup cream and rum. With a wooden skewer, poke holes in cake about 1/2 in. apart. Slowly pour milk mixture over cake, allowing mixture to absorb into cake. Let stand 30 minutes. Refrigerate, covered, 8 hours or overnight.",
                "In a small bowl, beat remaining cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Spread over top of cake. Sprinkle with coconut and pecans. If desired, drizzle servings with chocolate syrup."
            ],
            "nutrition": ""
        },
        {
            "name": "German Chocolate Dump Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_H13X9BZ_118026_C05_06_1b-4.jpg?fit=700,1024",
            "expert": "We make this for Sunday lunches when the whole family gets together. The cream cheese topping is so good, it doesn't need frosting.",
            "time": "Prep: 15 min. Bake: 35 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 cup sweetened shredded coconut",
                "1-1/2 cups chopped toasted pecans, divided",
                "1 package devil's food cake mix (regular size)",
                "8 ounces cream cheese, softened",
                "1/2 cup butter, melted",
                "2 teaspoons vanilla extract",
                "2 cups confectioners' sugar",
                "1/2 cup semisweet chocolate chips"
            ],
            "directions": [
                "Preheat oven to 350°. Grease a 13x9-in. baking pan.",
                "Sprinkle coconut and 1 cup pecans into baking pan. Prepare cake mix according to package directions. Pour batter into prepared pan.",
                "In a large bowl, beat cream cheese, butter and vanilla until smooth; beat in confectioners' sugar. Stir in chocolate chips and remaining 1/2 cup pecans. Spoon over batter. Cut through batter with a knife to swirl. Bake until a toothpick inserted in center comes out clean, 35-40 minutes. Cool completely in pan on a wire rack."
            ],
            "nutrition": "1 piece: 479 calories, 30g fat (12g saturated fat), 69mg cholesterol, 389mg sodium, 50g carbohydrate (36g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "German Chocolate Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps20855_BOTH1450745D128A-5.jpg",
            "expert": "These cupcakes disappear in a dash when I take them to the school where I teach. Pecans, coconut and brown sugar dress up the topping nicely.\r\n                                 —Lettice Charmasson, San Diego, California",
            "time": "Prep: 20 min. Bake: 15 min. + cooling",
            "makes": "about 2 dozen",
            "ingredients": [
                "1 package  German chocolate cake mix (regular size)",
                "1 cup water",
                "3 large eggs",
                "1/2 cup canola oil",
                "3 tablespoons chopped pecans",
                "3 tablespoons sweetened shredded coconut",
                "3 tablespoons brown sugar"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water, eggs and oil. Beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Fill paper-lined muffin cups three-fourths full. Combine the pecans, coconut and brown sugar; sprinkle over batter. Bake at 400° for 15-20 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely."
            ],
            "nutrition": "1 each: 156 calories, 8g fat (2g saturated fat), 27mg cholesterol, 146mg sodium, 19g carbohydrate (11g sugars, 0 fiber), 2g protein."
        },
        {
            "name": "German Chocolate Cake",
            "image_url": "",
            "expert": "According to my husband, this is the best German chocolate cake recipe in the whole world. Every bite has a light crunch from the pecans, a sweet taste of coconut and a drizzle of chocolate.  —Joyce Platfoot, Wapakoneta, Ohio",
            "time": "Prep: 30 min. Bake: 30 min. + cooling",
            "makes": "12 pieces",
            "ingredients": [
                "4 ounces German sweet chocolate, chopped",
                "1/2 cup water",
                "1 cup butter, softened",
                "2 cups sugar",
                "4 large eggs, separated, room temperature",
                "1 teaspoon vanilla extract",
                "2-1/2 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "FROSTING:",
                "1-1/2 cups sugar",
                "1-1/2 cups evaporated milk",
                "3/4 cup butter",
                "5 large egg yolks, room temperature, beaten",
                "2 cups sweetened shredded coconut",
                "1-1/2 cups chopped pecans",
                "1-1/2 teaspoons vanilla extract",
                "ICING:",
                "2 ounces semisweet chocolate",
                "1 teaspoon shortening"
            ],
            "directions": [
                "Line 3 greased 9-in. round baking pans with waxed paper. Grease waxed paper and set aside. In small saucepan, melt chocolate with water over low heat; cool.",
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Beat in 4 egg yolks, 1 at a time, beating well after each addition. Blend in melted chocolate and vanilla. Combine flour, baking soda and salt; add to the creamed mixture alternately with buttermilk, beating well after each addition.",
                "In a small bowl and with clean beaters, beat the 4 egg whites until stiff peaks form. Fold a fourth of the egg whites into creamed mixture; fold in remaining whites.",
                "Pour batter into prepared pans. Bake 24-28 minutes or until a toothpick inserted in center comes out clean. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "For the icing, in a small saucepan, heat sugar, milk, butter and egg yolks over medium-low heat until mixture is thickened and golden brown, stirring constantly. Remove from heat. Stir in coconut, pecans and vanilla. Cool until thick enough to spread. Spread a third of the frosting over each cake layer and stack the layers.",
                "In a microwave, melt chocolate and shortening; stir until smooth. Drizzle over cake."
            ],
            "nutrition": "1 piece: 910 calories, 53g fat (28g saturated fat), 237mg cholesterol, 511mg sodium, 103g carbohydrate (76g sugars, 4g fiber), 11g protein."
        },
        {
            "name": "German Chocolate Birthday Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps7488_TH1854C35B.jpg",
            "expert": "This moist, flavorful cake was the traditional birthday cake at our house when I was growing up. Everyone requested it. I especially like the sweet coconut-pecan frosting.                           —Lisa Andis, Morristown, Indiana",
            "time": "Prep: 25 min. Bake: 50 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "4 eggs, separated",
                "4 ounces German sweet chocolate, chopped",
                "1/2 cup water",
                "1 cup butter, softened",
                "2 cups sugar",
                "1 teaspoon vanilla extract",
                "2-1/2 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "COCONUT-PECAN FROSTING",
                "1 cup evaporated milk",
                "1 cup sugar",
                "3 egg yolks, lightly beaten",
                "1/2 cup butter, cubed",
                "1-1/3 cups sweetened shredded coconut",
                "1 cup chopped pecans",
                "1 teaspoon vanilla extract"
            ],
            "directions": [
                "Let eggs stand at room temperature for 30 minutes. Line a greased 13x9-in. baking pan with waxed paper. Grease and flour the paper; set aside.",
                "In a microwave, melt chocolate with water; stir until smooth. Cool. In a large bowl, cream butter and sugar until light and fluffy. Add egg yolks, one at a time, beating well after each addition. Beat in chocolate mixture and vanilla. Combine the flour, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. In a small bowl with clean beaters, beat egg whites until stiff peaks form; fold into batter.",
                "Spread batter evenly into prepared pan. Bake at 350° for 50-55 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before inverting onto a wire rack to cool completely. Remove waxed paper.",
                "For frosting, in a heavy saucepan, combine the milk, sugar, egg yolks and butter Cook and stir over medium-low heat until thickened and a thermometer reads 160° or is thick enough to coat the back of a metal spoon.",
                "Remove from the heat. Stir in the coconut, pecans and vanilla. Beat on high until frosting is cool and achieves spreading consistency. Place cake on a serving platter; frost top and sides of cake.",
                ""
            ],
            "nutrition": "1 piece: 590 calories, 33g fat (17g saturated fat), 154mg cholesterol, 421mg sodium, 70g carbohydrate (50g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "German Sweet Chocolate Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/themes/bumblebee-toh-child/images/recipes/Image-69-2x.png",
            "expert": "This is a real treat. My sister and I always enjoy preparing this together.—Patricia Peebles, Springfield, Missouri",
            "time": "Prep: 50 min. Bake: 30 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "4 ounces German sweet chocolate, chopped",
                "1/2 cup water",
                "1 cup butter, softened",
                "2 cups sugar",
                "4 eggs, separated",
                "1 teaspoon vanilla extract",
                "2-1/2 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "FROSTING:",
                "1 cup sugar",
                "1-1/3 cups evaporated milk, divided",
                "3 egg yolks, beaten",
                "1/2 cup butter, cubed",
                "1-1/3 cups sweetened shredded coconut",
                "1 cup chopped pecans",
                "1 teaspoon vanilla extract"
            ],
            "directions": [
                "Line three greased 9-in. round baking pans with waxed paper and grease the paper; set aside. In a small saucepan, heat chocolate and water over low heat until chocolate is melted. Remove from the heat; cool.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add egg yolks, one at a time, beating well after each addition. Beat in chocolate mixture and vanilla. Combine the flour, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "In a small bowl, beat egg whites until stiff peaks form; fold into batter. Transfer to prepared pans.",
                "Bake at 350° for 30 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely. Remove and discard waxed paper.",
                "For frosting, in a Dutch oven, combine sugar and 1 cup milk. Bring to a rapid boil over medium heat. Boil for 6-8 minutes or until mixture is thickened and light caramel-colored, whisking constantly. Remove from the heat; gradually whisk in remaining milk. Let stand for 5 minutes to cool slightly, stirring occasionally.",
                "Gradually whisk in yolks. Cook and stir over medium-low heat for 12-18 minutes or until frosting is slightly thickened and reaches 175°. (Frosting is done when a whisk pulled through the mixture exposes the bottom of the pan for a few seconds.) Remove from the heat; stir in butter until melted. Stir in coconut, pecans and vanilla. Cool to room temperature.",
                "Place one cake layer on a serving plate; spread with a third of the frosting. Repeat layers twice. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 553 calories, 31g fat (16g saturated fat), 145mg cholesterol, 395mg sodium, 66g carbohydrate (46g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "German Chocolate Upside Down Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/German-Chocolate-Upside-Down-Cake_exps34492_BOTH1753668A11_04_4bc_RMS.jpg?fit=700,1024",
            "expert": "This recipe is my mother's—she's an excellent baker and cook. There was always some new food for my three brothers and me to try when we were growing up! I enjoy baking, too, as well as gardening and making stained glass windows and lamps.—Juliann Nelson, Minneapolis, Minnesota",
            "time": "Prep: 30 min. Bake: 40 min.",
            "makes": "12-16 servings",
            "ingredients": [
                "1 package (4 ounces) German sweet chocolate",
                "1/2 cup water",
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "3 large eggs",
                "1 teaspoon vanilla extract",
                "1 cup sour cream",
                "2-1/2 cups sifted all-purpose flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "TOPPING:",
                "1 cup packed brown sugar",
                "1 cup sweetened shredded coconut",
                "1/4 cup butter, cubed",
                "1-1/4 cups water",
                "2 cups miniature marshmallows",
                "1 cup coarsely chopped pecans or walnuts"
            ],
            "directions": [
                "In a large heavy saucepan, melt chocolate in water over low heat, stirring until smooth. Cool.",
                "In a large bowl, cream butter and sugar until fluffy. Add eggs, one at a time, beating well after each addition. Add chocolate and vanilla. Beat in sour cream. Combine the flour, baking soda and salt; gradually add to creamed mixture. Beat for 2 minutes (batter will be thick); set aside.",
                "For topping, sprinkle brown sugar and coconut into a greased 13x9-in. baking pan. Melt butter in water; add to pan and mix with sugar and coconut. Sprinkle with marshmallows and nuts. Carefully spoon batter over topping.",
                "Bake at 350° for 40-45 minutes or until a toothpick inserted in the center comes out clean. Cool on a wire rack. Cut into squares and invert onto serving plates."
            ],
            "nutrition": "1 piece: 448 calories, 21g fat (11g saturated fat), 73mg cholesterol, 283mg sodium, 61g carbohydrate (43g sugars, 2g fiber), 5g protein."
        }
    ]
}