{
    "category": "Poke Cakes",
    "recipes": [
        {
            "name": "Coconut Cream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_THCA17_21759_C12_02_4b-3.jpg?fit=700,1024",
            "expert": "Have the urge to splurge? Try Deborah Protzman's moist and mouthwatering cake. \"No one who's ever eaten a piece can believe it's lower in fat\"—Deborah Protzman, Bloomington, Illinois.",
            "time": "Prep: 20 min. + chilling Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "3 large egg whites, room temperature",
                "1-1/4 cups water",
                "1/3 cup sweetened shredded coconut",
                "1 can (14 ounces) fat-free sweetened condensed milk",
                "1 teaspoon coconut extract",
                "TOPPING:",
                "1-1/2 cups reduced-fat whipped topping",
                "1/3 cup sweetened shredded coconut, toasted"
            ],
            "directions": [
                "Preheat oven to 350°. Coat a 13x9-in. pan with cooking spray.",
                "Beat cake mix, egg whites, water and coconut on low speed 30 seconds. Beat on medium 2 minutes. Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean, 20-25 minutes. Cool on a wire rack 10 minutes.",
                "Mix milk and extract. Using a large meat fork, poke holes in cake. Gently spread half of the milk mixture over cake; let stand 3 minutes. Spread with remaining milk mixture; cool 1 hour.",
                "Spread with whipped topping; sprinkle with toasted coconut. Refrigerate, covered, until cold, about 4 hours."
            ],
            "nutrition": "1 piece: 231 calories, 4g fat (3g saturated fat), 3mg cholesterol, 266mg sodium, 44g carbohydrate (32g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "German Chocolate Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps62822_THCA163696A05_28_5b-v2-2.jpg?fit=700,1024",
            "expert": "I first tried tres leches cake while in Ecuador several years ago. Since then, I’ve changed it up by adding some of my favorite ingredients, namely chocolate and coconut. This version also has a splash of rum for an adults-only treat. —Lisa Varner, El Paso, Texas",
            "time": "Prep: 20 min. + standing Bake: 25 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1 package chocolate cake mix",
                "1 can (14 ounces) sweetened condensed milk",
                "1 can (12 ounces) evaporated milk",
                "1-1/2 cups heavy whipping cream, divided",
                "1/4 cup rum",
                "3 tablespoons confectioners' sugar",
                "1/2 cup sweetened shredded coconut, toasted",
                "1/2 cup chopped pecans, toasted",
                "Chocolate syrup, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Prepare and bake cake mix according to package directions, using a 13x9-in. baking pan. Cool on a wire rack.",
                "Meanwhile, in a large bowl, whisk milks, 1/2 cup cream and rum. With a wooden skewer, poke holes in cake about 1/2 in. apart. Slowly pour milk mixture over cake, allowing mixture to absorb into cake. Let stand 30 minutes. Refrigerate, covered, 8 hours or overnight.",
                "In a small bowl, beat remaining cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Spread over top of cake. Sprinkle with coconut and pecans. If desired, drizzle servings with chocolate syrup."
            ],
            "nutrition": ""
        },
        {
            "name": "Peanut Butter Chocolate Poke Cake",
            "image_url": "",
            "expert": "When my family is planning a get-together, I can count on three or four people asking if I'm bringing this chocolate peanut butter poke cake. If you don't have a chocolate cake mix, use a white or yellow one and stir in 3 tablespoons of baking cocoa. —Fay Moreland, Wichita Falls, Texas",
            "time": "Prep: 20 min. Bake: 25 min. + chilling",
            "makes": "20 servings",
            "ingredients": [
                "1 package chocolate cake mix (regular size)",
                "2 teaspoons vanilla extract, divided",
                "Dash salt",
                "2/3 cup creamy peanut butter",
                "2 cans (14 ounces each) sweetened condensed milk",
                "1 cup confectioners' sugar",
                "Topping: Chopped peanut butter-filled sandwich cookies, peanut butter cups or a combination of the two"
            ],
            "directions": [
                "Preheat oven to 350°. Prepare cake mix according to package directions, adding 1 teaspoon vanilla and salt before mixing batter. Transfer to a greased 13x9-in. baking pan. Bake and cool completely as package directs.",
                "Whisk peanut butter and milk until blended. Using the end of a wooden spoon handle, poke holes in cake 2 in. apart. Slowly pour 2 cups peanut butter mixture over cake, filling each hole. Refrigerate cake and remaining peanut butter mixture, covered, until cake is cold, 2-3 hours.",
                "Combine remaining vanilla and remaining peanut butter mixture; gradually beat in enough confectioners' sugar to reach a spreading consistency. Spread over cake. Add toppings as desired. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 360 calories, 16g fat (4g saturated fat), 41mg cholesterol, 312mg sodium, 49g carbohydrate (40g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Cherry Dream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cherry-Dream-Cake_exps19231_HB133235C07_19_3b_RMS-1.jpg?fit=700,1024",
            "expert": "I serve this cherry cake for holidays because it's so festive and easy. No one will know your secret is adding a package of cherry gelatin to a boxed cake mix! —Margaret McNeil, Germantown, Tennessee",
            "time": "Prep: 15 min. + chilling Bake: 30 min. + cooling",
            "makes": "20 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1 package (3 ounces) cherry gelatin",
                "1-1/2 cups boiling water",
                "1 package (8 ounces) cream cheese, softened",
                "2 cups frozen whipped topping",
                "1 can (21 ounces) cherry pie filling"
            ],
            "directions": [
                "Prepare cake mix according to package directions, using a greased 13x9-in. baking pan. Bake at 350° for 30-35 minutes or until a toothpick comes out clean.",
                "Dissolve gelatin in boiling water. Cool cake on a wire rack for 3-5 minutes. Poke holes in cake with a meat fork or wooden skewer; gradually pour gelatin over cake. Cool for 15 minutes. Cover and refrigerate for 30 minutes.",
                "In a large bowl, beat cream cheese until fluffy. Fold in whipped topping. Carefully spread over cake. Top with pie filling. Cover and refrigerate for at least 2 hours before serving."
            ],
            "nutrition": "1 piece: 245 calories, 11g fat (5g saturated fat), 39mg cholesterol, 242mg sodium, 34g carbohydrate (22g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Cuppa Joe Caramel Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Cuppa-Joe-Caramel-Cake_EXPS_FBMZ18_122038_D05_09_5b.jpg?fit=700,1024",
            "expert": "I get compliments on this cake wherever I take it. It is very much an adult cake, with the hit of coffee and the warmth of the brown sugar and caramel.—Leigh Doutt, Pueblo West, Colorado",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 cup buttermilk",
                "4 teaspoons instant coffee granules",
                "1/2 cup butter, softened",
                "1 cup packed brown sugar",
                "2 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "2 tablespoons cornstarch",
                "1-1/2 teaspoons baking powder",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1/4 teaspoon ground nutmeg",
                "3/4 cup caramel ice cream topping, divided",
                "FROSTING:",
                "1 tablespoon baking cocoa",
                "2 teaspoons instant coffee granules",
                "1/4 cup boiling water",
                "1/2 cup butter, softened",
                "1/4 cup confectioners' sugar",
                "3/4 cup semisweet chocolate chips, melted"
            ],
            "directions": [
                "Microwave buttermilk just until warmed, 30-45 seconds. Stir in coffee granules until dissolved.",
                "In a large bowl, cream butter and brown sugar until light and fluffy. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. Combine the flour, cornstarch, baking powder, baking soda, salt and nutmeg; add to creamed mixture alternately with buttermilk mixture, beating well after each addition.",
                "Transfer to a greased 13x9-in. baking pan. Bake at 350° until a toothpick inserted in the center comes out clean, 20-25 minutes. Cool on a wire rack for 5 minutes.",
                "Using the end of a wooden spoon handle, poke holes in cake 2 in. apart. Pour 1/2 cup caramel topping into holes. Spoon remaining caramel topping over cake. Cool completely.",
                "For frosting, in a small bowl, stir cocoa and coffee granules into boiling water until dissolved; cool to room temperature. In a small bowl, cream butter and confectioners' sugar until light and fluffy. Stir in melted chocolate and cocoa mixture until well combined. Frost cake."
            ],
            "nutrition": "1 piece: 335 calories, 16g fat (10g saturated fat), 61mg cholesterol, 338mg sodium, 47g carbohydrate (22g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Coconut Cream Yummy Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Cream-Yummy-Cake_exps50685_TH1999633D08_03_2bC_RMS-5.jpg?fit=700,1024",
            "expert": "\"I found this recipe as a kid in one of my mother's cookbooks. I didn't make it until I was older and now it is requested every Christmas. Sometimes I tint the coconut red and green for the holiday.\" – Angela Renae Fox, Gober, Texas",
            "time": "Prep: 30 min. Bake: 40 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "6 large egg whites",
                "3/4 cup butter, softened",
                "1-1/3 cups sugar",
                "1 cup coconut milk",
                "1/2 cup 2% milk",
                "2 teaspoons vanilla extract",
                "2-1/4 cups cake flour",
                "2-1/2 teaspoons baking powder",
                "1 teaspoon salt",
                "SYRUP:",
                "1 can (13.66 ounces) coconut milk",
                "1 can (14 ounces) sweetened condensed milk",
                "TOPPING:",
                "1-1/2 cups heavy whipping cream",
                "3 tablespoons confectioners' sugar",
                "1/4 teaspoon vanilla extract",
                "Sweetened shredded coconut"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes.",
                "Meanwhile, in another large bowl, cream butter and sugar until light and fluffy. Combine the coconut milk, milk and vanilla. Combine the flour, baking powder and salt; add to creamed mixture alternately with milk mixture.",
                "With clean beaters, beat egg whites on medium speed until soft peaks form. Gradually fold into batter. Spread into a greased 13-in. x 9-in. baking pan.",
                "Bake at 350° for 40-45 minutes or until cake springs back when lightly touched. Place pan on a wire rack.",
                "Poke holes in cake with a skewer, about 1/2 in. apart. Combine syrup ingredients; slowly pour over cake, allowing mixture to absorb into cake. Let stand for 30 minutes. Cover and refrigerate for 2 hours.",
                "In a large bowl, beat cream until it begins to thicken. Add confectioners' sugar and vanilla; beat until soft peaks form. Spread over cake; sprinkle with coconut.",
                ""
            ],
            "nutrition": "1 piece: 491 calories, 29g fat (21g saturated fat), 66mg cholesterol, 363mg sodium, 52g carbohydrate (34g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps36995_LT1115459D34-6.jpg",
            "expert": "Finish off a fiesta with a piece of this moist and refreshing cake from Anna Yeatts of Pinehurst, North Carolina. Though it’s been lightened, the sweet flavors of this traditional Mexican dessert aren’t lost, making it the perfect end to any meal.",
            "time": "Prep: 35 min. Bake: 20 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "5 eggs",
                "1 cup sugar, divided",
                "1 tablespoon butter, softened",
                "1/3 cup fat-free milk",
                "1 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "1 teaspoon baking powder",
                "MILK SYRUP:",
                "1 can (14 ounces) fat-free sweetened condensed milk",
                "1 can (12 ounces) fat-free evaporated milk",
                "1 cup fat-free half-and-half",
                "3 teaspoons vanilla extract",
                "15 tablespoons frozen reduced-fat whipped topping",
                "15 fresh strawberries"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Coat a 13-in. x 9-in. baking dish with cooking spray and dust with flour; set aside.",
                "In a large bowl, beat egg yolks on high speed for 5 minutes or until thick and lemon-colored. Gradually beat in 3/4 cup sugar and butter. Stir in milk and vanilla. Sift flour and baking powder; gradually add to yolk mixture and mix well (batter will be thick).",
                "With clean beaters, beat egg whites on medium speed until soft peaks form. Gradually beat in remaining sugar, 1 tablespoon at a time, on high until stiff peaks form. Gradually fold into batter.",
                "Spread evenly into prepared dish. Bake at 350° for 18-22 minutes or until cake springs back when lightly touched. Place on a wire rack.",
                "In a large saucepan, combine the condensed milk, evaporated milk and half-and-half. Bring to a boil over medium heat, stirring constantly; cook and stir for 2 minutes. Remove from the heat; stir in vanilla. Cool slightly.",
                "Cut cake into 15 pieces, leaving cake in the baking dish. Poke holes in cake with a skewer. Slowly pour a third of the milk syrup over cake, allowing syrup to absorb into the cake. Repeat twice. Let stand for 30 minutes.",
                "Cover and refrigerate for 2 hours before serving. Top each piece with whipped topping and a strawberry."
            ],
            "nutrition": "1 piece: 233 calories, 3g fat (2g saturated fat), 76mg cholesterol, 126mg sodium, 42g carbohydrate (34g sugars, 1g fiber), 8g protein."
        },
        {
            "name": "Caramel Crunch Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps23632_LT943675D35C.jpg",
            "expert": "I received this recipe from my sister-in-law, and I love how the cake comes together with a convenient mix, water and egg whites. Crushed candy bars make a fun addition to the moist treat. —Heather Dollins of Poplar Bluff, Missouri",
            "time": "Prep: 15 min. Bake: 35 min. + cooling",
            "makes": "18 servings",
            "ingredients": [
                "1 package  devil's food cake mix (regular size)",
                "1-1/3 cups water",
                "5 large egg whites",
                "1 can (14 ounces) fat-free sweetened condensed milk",
                "1/2 cup fat-free caramel ice cream topping",
                "5 fun-size Butterfinger candy bars, crushed",
                "1 carton (8 ounces) frozen fat-free whipped topping, thawed"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water and egg whites; beat on low speed for 30 seconds. Beat on medium for 2 minutes. Pour into a 13x9-in. baking pan coated with cooking spray.",
                "Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Cool on a wire rack.",
                "With a meat fork or wooden skewer, poke holes about 2 in. apart into cake. Slowly pour condensed milk and caramel topping over cake; sprinkle with two-thirds of the crushed candy bars. Spread with whipped topping; sprinkle with remaining candy bars. Refrigerate until serving."
            ],
            "nutrition": "1 piece: 250 calories, 4g fat (2g saturated fat), 2mg cholesterol, 290mg sodium, 47g carbohydrate (31g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Classic Tres Leches Cake",
            "image_url": "",
            "expert": "Tres leches means \"three milks.\" This cake gets its name because it uses three kinds of milk—evaporated, condensed and cream. This tres leches cake's light and airy texture has made it a classic in Mexican kitchens for generations. —Taste of Home Test Kitchen",
            "time": "Prep: 45 min. Bake: 20 min. + chilling",
            "makes": "10 servings",
            "ingredients": [
                "4 large eggs, separated, room temperature",
                "2/3 cup sugar, divided",
                "2/3 cup cake flour",
                "Dash salt",
                "3/4 cup heavy whipping cream",
                "3/4 cup evaporated milk",
                "3/4 cup sweetened condensed milk",
                "2 teaspoons vanilla extract",
                "1/4 teaspoon rum extract",
                "TOPPING:",
                "1-1/4 cups heavy whipping cream",
                "3 tablespoons sugar",
                "Optional: Dulce de leche or sliced fresh strawberries"
            ],
            "directions": [
                "Place egg whites in a large bowl. Line bottom of a 9-in. springform pan with parchment; grease the paper.",
                "Meanwhile, preheat oven to 350°. In another large bowl, beat egg yolks until slightly thickened. Gradually add 1/3 cup sugar, beating on high speed until thick and lemon-colored. Fold in flour, a third at a time.",
                "Add salt to egg whites; with clean beaters, beat on medium until soft peaks form. Gradually add remaining 1/3 cup sugar, 1 tablespoon at a time, beating on high after each addition until sugar is dissolved. Continue beating until soft glossy peaks form. Fold a third of the whites into batter, then fold in remaining whites. Gently spread into prepared pan.",
                "Bake until top springs back when lightly touched, 20-25 minutes. Cool 10 minutes before removing from pan to a wire rack to cool completely.",
                "Place cake on a rimmed serving plate. Poke holes in top with a skewer. In a small bowl, mix cream, evaporated milk, sweetened condensed milk and extracts; brush or pour slowly over cake. Refrigerate, covered, 2 hours.",
                "For topping, beat cream until it begins to thicken. Add sugar; beat until peaks form. Spread over top of cake.  If desired, top cake with dulce de leche or strawberries just before serving."
            ],
            "nutrition": "1 piece: 392 calories, 23g fat (14g saturated fat), 142mg cholesterol, 104mg sodium, 40g carbohydrate (33g sugars, 0 fiber), 8g protein."
        },
        {
            "name": "Wearing o’ Green Cake",
            "image_url": "",
            "expert": "One bite of this moist, colorful cake and you'll think you've found the pot o' gold at the end of the rainbow. It's the perfect dessert to round out your St. Patrick's Day feast. —Marge Nicol, Shannon, Illinois",
            "time": "Prep: 25 min. Bake: 30 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "2 packages (3 ounces each) lime gelatin",
                "1 cup boiling water",
                "1/2 cup cold water",
                "TOPPING:",
                "1 cup cold milk",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 carton (8 ounces) frozen whipped topping, thawed",
                "Green sprinkles"
            ],
            "directions": [
                "Prepare and bake cake according to package directions, using a greased 13x9-in. baking dish. Cool on a wire rack 1 hour. In a small bowl, dissolve gelatin in boiling water; stir in cold water and set aside.",
                "With a meat fork or wooden skewer, poke holes about 2 in. apart into cooled cake. Slowly pour gelatin over cake. Cover and refrigerate.",
                "In a large bowl, whisk milk and pudding mix 2 minutes (mixture will be thick). Fold in whipped topping. Spread over cake. Decorate with sprinkles. Cover and refrigerate until serving."
            ],
            "nutrition": "1 piece: 303 calories, 11g fat (4g saturated fat), 39mg cholesterol, 328mg sodium, 48g carbohydrate (33g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Margarita Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Margarita-Tres-Leches-Cake_EXPS_FT21_89418_F_0408_1.jpg?fit=700,1024",
            "expert": "The first time I ever had tres leches cake I felt as if I were in heaven. I have made it at home using several techniques and flavors, and this margarita twist on the classic is my favorite. —Laurie Lufkin, Essex, Massachusetts",
            "time": "Prep: 20 min. Bake: 20 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "4 large eggs, separated",
                "1 cup sugar",
                "1/2 cup tequila",
                "1/2 cup butter, melted",
                "6 tablespoons Key lime juice, divided",
                "1 teaspoon vanilla extract",
                "1-3/4 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1/2 cup confectioners' sugar",
                "1 teaspoon cream of tartar",
                "1 can (14 ounces) sweetened condensed milk",
                "1 cup 2% milk",
                "1/2 cup evaporated milk",
                "1/2 cup heavy whipping cream",
                "Optional: Whipped cream, and lime slices and zest"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Grease and flour a 13x9-in. baking pan; set aside. Preheat oven to 375°.",
                "Beat sugar, tequila, butter, yolks, 3 tablespoons lime juice and vanilla until well blended. Combine flour, baking soda and salt; gradually beat into yolk mixture until blended.",
                "Add confectioners' sugar and cream of tarter to egg whites; beat with clean beaters until stiff peaks form. Fold into batter. Transfer to prepared pan.",
                "Bake until a toothpick inserted in the center comes out clean, 18-20 minutes. Place pan on a wire rack. With a wooden skewer, poke holes in cake about 1/2 in. apart.",
                "Beat condensed milk, 2% milk, evaporated milk, whipping cream and remaining lime juice until blended. Drizzle over cake; let stand for 30 minutes. Refrigerate for 2 hours before serving.",
                "Cut cake into squares. If desired, garnish with whipped cream, and lime slices and zest."
            ],
            "nutrition": "1 piece: 345 calories, 14g fat (8g saturated fat), 88mg cholesterol, 282mg sodium, 46g carbohydrate (34g sugars, 0 fiber), 7g protein."
        },
        {
            "name": "Strawberry Shortcake Dessert",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps35648_SD1113248D50A-2.jpg",
            "expert": "This recipe was given to me by a co-worker, and it gets rave reviews every time. I've tried it with other fruits, including blueberries, cherries, and peaches. All work out great. — Michele Trachier, Pasadena, Texas",
            "time": "Prep: 15 min. Bake: 30 min. + chilling",
            "makes": "20 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1-1/3 cups water",
                "1/4 cup unsweetened applesauce",
                "2 large egg whites, room temperature",
                "1 large egg, room temperature",
                "1 package (.6 ounce) sugar-free strawberry gelatin",
                "2 cups boiling water",
                "1 package (16 ounces) frozen unsweetened whole strawberries, thawed, drained and sliced",
                "1 carton (16 ounces) frozen reduced-fat whipped topping, thawed",
                "10 fresh strawberries, halved"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water, applesauce, egg whites and egg; beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Pour into a 13x9-in. baking dish coated with cooking spray. Bake at 350° for 30-35 minutes or until a toothpick inserted in the center comes out clean.",
                "In a large bowl, dissolve gelatin in boiling water. Stir in strawberries. Using a sharp knife, cut a diamond pattern across top of hot cake; immediately pour gelatin mixture over cake. Cool on a wire rack.",
                "Refrigerate for at least 6 hours. Spread with whipped topping. Garnish with fresh strawberries."
            ],
            "nutrition": "1 piece: 179 calories, 5g fat (3g saturated fat), 11mg cholesterol, 192mg sodium, 29g carbohydrate (16g sugars, 1g fiber), 2g protein."
        },
        {
            "name": "Tres Leches Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps158142_CW163682D02_23_4b-2.jpg?fit=700,1024",
            "expert": "This cupcake version of tres leches cake actually uses four types of milk, including the cream, but \"quatro leches cake\" just doesn’t have the same delicious ring to it. If you love dairy, you won’t be disappointed with this special take on the classic. —Taste of Home Test Kitchen",
            "time": "Prep: 45 min. + chilling Bake: 15 min. + cooling",
            "makes": "4 dozen",
            "ingredients": [
                "1 package  yellow cake mix (regular size)",
                "1-1/4 cups water",
                "4 large eggs, room temperature",
                "1 can (14 ounces) sweetened condensed milk",
                "1 cup coconut milk",
                "1 can (5 ounces) evaporated milk",
                "Dash salt",
                "WHIPPED CREAM:",
                "3 cups heavy whipping cream",
                "1/3 cup confectioners' sugar",
                "Assorted fresh berries"
            ],
            "directions": [
                "Preheat oven to 350°. Line 48 muffin cups with paper liners.",
                "In a large bowl, combine cake mix, water and eggs; beat on low speed 30 seconds. Beat on medium 2 minutes.",
                "Fill prepared cups halfway, allowing room in liners for milk mixture. Bake 11-13 minutes or until a toothpick inserted in center comes out clean. Cool 5 minutes before removing from pans to wire racks; cool slightly.",
                "Place cupcakes in 15x10x1-in. pans. Poke holes in cupcakes with a skewer. In a small bowl, mix milks and salt; spoon scant 1 tablespoon mixture over each cupcake. Refrigerate, covered, overnight.",
                "In a large bowl, beat cream until it begins to thicken. Add confectioners' sugar; beat until soft peaks form. Spread over cupcakes; top with berries. Store in the refrigerator."
            ],
            "nutrition": "1 cupcake (calculated without berries): 143 calories, 9g fat (5g saturated fat), 40mg cholesterol, 99mg sodium, 15g carbohydrate (11g sugars, 0 fiber), 2g protein."
        },
        {
            "name": "Toffee Poke Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Toffee-Poke-Cake_EXPS_FT20_43286_F_0427_1_HOME-5.jpg?fit=700,1024",
            "expert": "This toffee poke cake recipe is a favorite among my family and friends. I love making it because it is so simple.—Ms. Jeanette Hoffman, Oshkosh, Wisconsin",
            "time": "Prep: 25 min. Bake: 25 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1 package  chocolate cake mix (regular size)",
                "1 jar (17 ounces) butterscotch-caramel ice cream topping",
                "1 carton (12 ounces) frozen whipped topping, thawed",
                "3 Heath candy bars (1.4 ounces each), chopped"
            ],
            "directions": [
                "Prepare and bake cake according to package directions, using a greased 13x9-in. baking pan. Cool on a wire rack.",
                "Using the handle of a wooden spoon, poke holes in cake. Pour 3/4 cup caramel topping into holes. Spoon remaining caramel over cake. Top with whipped topping. Sprinkle with candy. Refrigerate for at least 2 hours before serving."
            ],
            "nutrition": "1 piece: 404 calories, 16g fat (8g saturated fat), 48mg cholesterol, 322mg sodium, 60g carbohydrate (39g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Coconut Tres Leches Cupcakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Coconut-Tres-Leches-Cupcakes_EXPS_SDAM18_50867_D12_05_2b-2.jpg?fit=700,1024",
            "expert": "Three types of milk wonderfully moisten these cupcakes. Toasted coconut on top adds an elegant touch. —Taste of Home Test Kitchen",
            "time": "Prep: 35 min. + chilling Bake: 20 min. + cooling",
            "makes": "about 1-1/2 dozen",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "1-1/2 teaspoons vanilla extract",
                "4 large egg whites, room temperature",
                "2 cups all-purpose flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1-1/3 cups buttermilk",
                "1 can (14 ounces) sweetened condensed milk",
                "2/3 cup evaporated milk",
                "1/2 cup coconut milk",
                "WHIPPED CREAM:",
                "1-1/2 cups heavy whipping cream",
                "1/3 cup confectioners' sugar",
                "Toasted sweetened shredded coconut"
            ],
            "directions": [
                "Preheat oven to 350°. Line 18 muffin cups with paper liners.",
                "Cream butter and sugar until light and fluffy, 5-7 minutes. Beat in vanilla; add egg whites, 1 at a time, beating well after each addition. In another bowl, whisk together flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating after each addition.",
                "Fill prepared cups about two-thirds full. Bake until a toothpick inserted in center comes out clean, 17-20 minutes. Cool 10 minutes. Remove cupcakes to a 15x10x1-in. pan.",
                "In a bowl, mix sweetened condensed, evaporated and coconut milks. Poke holes in cupcakes, about 1/2 in. apart, with a skewer. Slowly spoon milk mixture over top, allowing it to absorb into cake. Refrigerate, covered, at least 2 hours.",
                "To serve, beat cream until it begins to thicken. Add confectioners' sugar; beat until soft peaks form. Spread or pipe over cupcakes. Top with coconut. Store in the refrigerator."
            ],
            "nutrition": "1 cupcake: 342 calories, 16g fat (11g saturated fat), 47mg cholesterol, 226mg sodium, 44g carbohydrate (33g sugars, 0 fiber), 6g protein."
        },
        {
            "name": "Red, White & Blueberry Poke Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps153634_TH2379798B02_24_1b_WEB-2.jpg?fit=700,1024",
            "expert": "A sweet treat in the summer, this patriotic poke cake with dazzling red and blue stripes is a fun one to make with the kids. —Elisabeth Schulz, Blossvale, New York",
            "time": "Prep: 40 min. + cooling Bake: 25 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1-1/4 cups water",
                "2 large eggs, room temperature",
                "1/4 cup canola oil",
                "STRAWBERRY GELATIN:",
                "1 cup fresh strawberries",
                "2/3 cup sugar",
                "1/4 cup water",
                "2-1/4 teaspoons strawberry gelatin",
                "BLUEBERRY GELATIN:",
                "3/4 cup fresh blueberries",
                "1/2 cup water",
                "4-1/2 teaspoons sugar",
                "4-1/2 teaspoons berry blue gelatin",
                "FROSTING AND FILLING:",
                "2-1/2 cups heavy whipping cream",
                "1/3 cup confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of two 9-in. round baking pans with parchment or waxed paper; coat paper with cooking spray. In a large bowl, combine cake mix, water, eggs and oil; beat on low speed 30 seconds. Beat on medium 2 minutes.",
                "Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean. Cool completely in pans on wire racks.",
                "For strawberry gelatin, in a small saucepan, combine strawberries, sugar and water; bring to a boil. Reduce heat; simmer, uncovered, 2-3 minutes or until berries are soft. Strain into a small bowl, pressing berries lightly; discard pulp. Add gelatin to syrup, stirring to dissolve completely. Cool to room temperature. Repeat steps to make blueberry gelatin.",
                "Using a wooden skewer, pierce tops of cakes to within 1 inch of edge; twist skewer gently to make slightly larger holes. Gradually pour cooled strawberry mixture over 1 cake, being careful to fill each hole. Repeat with blueberry mixture and remaining cake. Refrigerate, covered, overnight.",
                "In a large bowl, beat cream until it begins to thicken. Add confectioners' sugar; beat until soft peaks form.",
                "Run a knife around sides of pans to loosen cakes. Remove strawberry cake from pan; remove paper. Place cake on a serving plate. Spread with 1 cup whipped cream.",
                "Remove blueberry cake from pan; remove paper. Place cake over whipped cream layer. Frost top and sides with remaining cream. Refrigerate at least 1 hour before serving."
            ],
            "nutrition": "1 slice: 477 calories, 28g fat (13g saturated fat), 100mg cholesterol, 328mg sodium, 55g carbohydrate (38g sugars, 0 fiber), 4g protein."
        },
        {
            "name": "Strawberry Poke Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Strawberry-Poke-Cake_EXPS_GFA22_17672_E06_10_3b.jpg?fit=700,1024",
            "expert": "That classic spring treat—strawberry shortcake—takes on a wonderful new twist with this strawberry poke cake recipe. Strawberry gelatin and strawberries liven up each pretty slice of this lovely layered cake that's made from a convenient boxed mix. —Mary Jo Griggs, West Bend, Wisconsin",
            "time": "Prep: 25 min. Bake: 25 min. + chilling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1-1/4 cups water",
                "2 large eggs, room temperature",
                "1/4 cup canola oil",
                "2 packages (10 ounces each) frozen sweetened sliced strawberries, thawed",
                "2 packages (3 ounces each) strawberry gelatin",
                "1 carton (12 ounces) frozen whipped topping, thawed, divided",
                "Fresh strawberries, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, combine the cake mix, water, eggs and oil; beat on low speed for 30 seconds. Beat on medium speed for 2 minutes.",
                "Pour into 2 greased and floured 9-in. round baking pans. Bake until a toothpick inserted in the center comes out clean, 25-35 minutes. Cool for 10 minutes; remove from pans to wire racks to cool completely.",
                "Using a serrated knife, level tops of cakes if necessary. Return layers, top side up, to 2 clean 9-in. round baking pans. Pierce cakes with a meat fork or wooden skewer at 1/2-in. intervals.",
                "Drain juice from strawberries into a 2-cup measuring cup; refrigerate berries. Add water to juice to measure 2 cups; pour into a small saucepan. Bring to a boil; stir in gelatin until dissolved. Chill for 30 minutes. Gently spoon over each cake layer. Chill for 2-3 hours.",
                "Dip bottom of 1 pan into warm water for 10 seconds. Invert cake onto a serving platter. Top with chilled strawberries and 1 cup whipped topping. Place second cake layer over topping.",
                "Frost cake with remaining whipped topping. Chill for at least 1 hour. Serve with fresh berries if desired. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 376 calories, 14g fat (7g saturated fat), 35mg cholesterol, 301mg sodium, 56g carbohydrate (37g sugars, 1g fiber), 4g protein."
        }
    ]
}