{
    "category": "Pudding Cakes",
    "recipes": [
        {
            "name": "Six-Layer Coconut Cake with Lemon Filling",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps178251_SF143315C10_23_5b_WEB-5.jpg?fit=700,1024",
            "expert": "I found this recipe when going through my grandmother's old files. It was originally made with an orange filling, but using lemon pudding in the filling makes it easier to prepare. It is simply the best. —Angela Leinenbach, Mechanicsvlle, Virginia",
            "time": "Prep: 1 hour + chilling Bake: 25 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "FILLING:",
                "3-1/2 cups cold whole milk",
                "2 packages (3.4 ounces each) instant lemon pudding mix",
                "1 teaspoon grated lemon zest",
                "CAKE:",
                "6 large egg whites",
                "1 cup butter, softened",
                "3 cups sugar",
                "3 teaspoons vanilla extract",
                "4 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "2 cups buttermilk",
                "FROSTING:",
                "1 cup sugar",
                "2 large egg whites, room temperature",
                "1/2 cup water",
                "1/4 teaspoon salt",
                "1/8 teaspoon cream of tartar",
                "1/4 teaspoon vanilla extract",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "In a large bowl, whisk milk, pudding mix and zest 2 minutes. Cover and refrigerate at least 1 hour.",
                "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 350°. Line bottoms of three greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in vanilla. In another bowl, whisk flour, baking soda, baking powder and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. With clean beaters, beat egg whites on high speed until stiff peaks form; gently fold into batter.",
                "Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean.  Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large heavy saucepan, combine sugar, egg whites, water, salt and cream of tartar over low heat or in a double boiler over simmering water. With a portable mixer, beat on low speed 1 minute. Continue beating on low over low heat until frosting reaches 160°, about 12 minutes.",
                "Pour into the bowl of a heavy-duty stand mixer; add vanilla. Beat on high until frosting forms stiff peaks, about 7 minutes.",
                "Using a long serrated knife, cut each cake horizontally in half. Place one cake layer on a serving plate; spread with 3/4 cup filling to within 1-inch of edge. Repeat four more times. Top with remaining cake layer. Frost top and sides of cake. Sprinkle top with coconut; gently press coconut into frosting on sides of cake. Store in the refrigerator."
            ],
            "nutrition": ""
        },
        {
            "name": "Pressure Cooker Molten Mocha Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pressure-Cooker-Molten-Mocha-Cake_EXPS_CFCSBZ17_207891_B09_07_5b-1.jpg?fit=700,1024",
            "expert": "When I first made my decadent chocolate cake, my husband's and daughter's expressions said it all. She says it's one of her \"most favorites.\" Later, I took one of these to our next-door neighbors. Their teenage son, who answered the door, ate the whole thing without telling anyone else about it! —Aimee Fortney, Fairview, Tennessee",
            "time": "Prep: 10 min. Cook: 25 min. + releasing",
            "makes": "6 servings",
            "ingredients": [
                "4 large eggs, room temperature",
                "1-1/2 cups sugar",
                "1/2 cup butter, melted",
                "1 tablespoon vanilla extract",
                "1 cup all-purpose flour",
                "1/2 cup baking cocoa",
                "1 tablespoon instant coffee granules",
                "1/4 teaspoon salt",
                "Fresh raspberries or sliced fresh strawberries and vanilla ice cream, optional"
            ],
            "directions": [
                "Place trivet insert and 1 cup water in a 6-qt. electric pressure cooker. In a large bowl, beat eggs, sugar, butter and vanilla until blended. In another bowl, whisk flour, cocoa, coffee granules and salt; gradually beat into egg mixture.",
                "Transfer to a greased 1-1/2-qt. baking dish. Cover loosely with foil to prevent moisture from getting into dish. Fold and 18x12-in. piece of foil into thirds, making a sling. Use the sling to lower the dish onto the trivet. Lock lid; close pressure-release valve. Adjust to pressure-cook on high for 25 minutes.",
                "Allow pressure to naturally release for 10 minutes, then quick-release any remaining pressure. A toothpick should come out with moist crumbs. Using foil sling, carefully remove baking dish. If desired, serve warm cake with berries and ice cream."
            ],
            "nutrition": "1 serving: 723 calories, 29g fat (16g saturated fat), 247mg cholesterol, 403mg sodium, 107g carbohydrate (76g sugars, 3g fiber), 12g protein."
        },
        {
            "name": "Turkey Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2021/10/Turkey-Cake_EXPS_FT21_259626_F_0618_1.jpg?fit=700,1024",
            "expert": "Create a simple centerpiece for your Thanksgiving dessert table. This turkey cake comes together fast with the help of a mix, and melted candy coating keeps decorating easy. —Taste of Home Test Kitchen",
            "time": "Prep: 30 min. Bake: 40 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package  dark chocolate cake mix (regular size)",
                "1 package (3.9 ounces) instant chocolate pudding mix",
                "4 large eggs, room temperature",
                "1 cup sour cream",
                "3/4 cup canola oil",
                "3/4 cup water",
                "FROSTING:",
                "3-3/4 cups confectioners' sugar",
                "1/3 cup baking cocoa",
                "1 cup butter, softened",
                "2 teaspoons vanilla extract",
                "3 to 5 tablespoons 2% milk",
                "8 ounces each red, yellow and orange candy coating disks, melted separately",
                "2 black nonpareils"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 3 greased 8-in. round baking pans with parchment; grease paper. In a large bowl, combine the first 6 ingredients; beat on low speed for 30 seconds. Beat on medium for 2 minutes. Transfer batter to prepared pans.",
                "Bake until a toothpick inserted near the center comes out clean, 35-40 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, sift confectioners' sugar and cocoa together. In a large bowl, beat butter and vanilla until blended. Beat in confectioners' sugar mixture. Beat in enough milk to reach desired consistency. Spread frosting between layers and over top and sides of cake.",
                "For decorations, place each color of melted candy coating in a piping bag fitted with a medium round tip; pipe various size circles of each color onto parchment. Drag the back of an offset spatula through each circle, creating oblong shapes for turkey feathers. Let stand until set.",
                "Arrange turkey feathers upright into top of cake. Using a small round tip, pipe melted white candy coating into two small discs, adding a black nonpareil in the center for the eyes. With another small round tip, pipe melted red candy coating into a comma shape for the wattle. Cut a yellow candy coating disc into a triangle for the beak. Attach eyes, beak, and wattle to the front of the cake using extra frosting."
            ],
            "nutrition": "1 slice: 736 calories, 40g fat (23g saturated fat), 82mg cholesterol, 440mg sodium, 91g carbohydrate (74g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Mint Swirl Fudge Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2019/06/Mint-Swirl-Fudge-Cake_EXPS_TOHCA19_78874_B03_21_1b-10.jpg?fit=700,1024",
            "expert": "Mint pairs with a silky, mild chocolate flavor for this colorful, beautiful cake that will be the talk of the holiday buffet. —Heidi Kelly, Norwood, Missouri",
            "time": "Prep: 15 min. Bake: 40 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package white cake mix (regular size)",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1/2 cup + 3 tablespoons water, divided",
                "3 ounces cream cheese, softened",
                "1/4 cup canola oil",
                "3 large eggs, room temperature",
                "1/4 cup creme de menthe flavoring syrup or  creme de menthe",
                "1/2 teaspoon peppermint extract",
                "Green food coloring, optional",
                "3 tablespoons water",
                "2 tablespoons baking cocoa",
                "6 ounces unsweetened chocolate, melted",
                "GLAZE:",
                "1-1/2 cups confectioners' sugar",
                "1 ounce semisweet chocolate, melted",
                "2 to 3 tablespoons water",
                "Crushed spearmint candies, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. fluted tube pan.",
                "In a large bowl, combine cake mix, pudding mix, 1/2 cup water, cream cheese, oil and eggs; beat on low speed 30 seconds. Beat on medium 2 minutes. Remove 1-1/2 cups batter to a small bowl; stir in creme de menthe syrup, extract, and if using, food coloring until blended.",
                "In a small bowl, whisk 3 tablespoons water and cocoa powder until smooth; add to untinted batter. Add melted chocolate. Spoon half of the chocolate batter into prepared pan. Carefully top with green batter; do not swirl. Top with remaining chocolate batter.",
                "Bake until a toothpick inserted in center comes out clean, 40-50 minutes. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "In a small bowl, mix confectioners' sugar, chocolate and enough water to reach a drizzling consistency. Spoon over cake; if desired, sprinkle with crushed candies."
            ],
            "nutrition": "1 slice: 436 calories, 18g fat (8g saturated fat), 54mg cholesterol, 366mg sodium, 62g carbohydrate (41g sugars, 3g fiber), 6g protein."
        },
        {
            "name": "Slow-Cooker Lava Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Slow-Cooker-Lava-Cake_EXPS_SCMBZ18_158191_D01_03_5b-5.jpg?fit=700,1024",
            "expert": "I love chocolate. Perhaps that's why this decadent slow-cooker cake has long been a family favorite. Sometimes I serve it warm, with vanilla ice cream; the cake can also be served cold. —Elizabeth Farrell, Hamilton, Montana",
            "time": "Prep: 15 min. Cook: 2 hours + standing",
            "makes": "8 servings",
            "ingredients": [
                "1 cup all-purpose flour",
                "1 cup packed brown sugar, divided",
                "5 tablespoons baking cocoa, divided",
                "2 teaspoons baking powder",
                "1/4 teaspoon salt",
                "1/2 cup fat-free milk",
                "2 tablespoons canola oil",
                "1/2 teaspoon vanilla extract",
                "1/8 teaspoon ground cinnamon",
                "1-1/4 cups hot water"
            ],
            "directions": [
                "In a large bowl, whisk flour, 1/2 cup brown sugar, 3 tablespoons cocoa, baking powder and salt. In another bowl, whisk milk, oil and vanilla until blended. Add to flour mixture; stir just until moistened.",
                "Spread into a 3-qt. slow cooker coated with cooking spray. In a small bowl, mix cinnamon and the remaining brown sugar and cocoa; stir in hot water. Pour over batter (do not stir).",
                "Cook, covered, on high 2 to 2-1/2 hours or until a toothpick inserted in cake portion comes out clean. Turn off slow cooker; let stand 15 minutes before serving."
            ],
            "nutrition": "1 serving: 207 calories, 4g fat (0 saturated fat), 0 cholesterol, 191mg sodium, 41g carbohydrate (28g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Dr Pepper Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Dr-Pepper-Cake_EXPS_FT22_123139_F_0513_1.jpg?fit=700,1024",
            "expert": "This Dr Pepper cake is my favorite \"go-to\" recipe for any time I have to take food anywhere. Everyone loves it. When it's baked in layers rather than in a single layer, its presence makes people say \"wow.\" It is a crowd-pleaser! —Shannon Parum, Vernon, Texas",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 package German chocolate cake mix (regular size)",
                "1 package (3.4 ounces) cook-and-serve chocolate pudding mix",
                "4 large eggs, room temperature",
                "1 can (12 ounces) Dr Pepper",
                "1 teaspoon vanilla extract",
                "FROSTING:",
                "1 container (12 ounces) whipped cream cheese, room temperature",
                "1/3 cup butter, softened",
                "1/3 cup baking cocoa",
                "3-1/2 cups confectioners' sugar",
                "1-1/2 teaspoons vanilla extract"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 3 greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, combine cake and pudding mixes. Add eggs, 1 at a time, beating well after each addition. Gradually beat in Dr Pepper and vanilla.",
                "Transfer batter to prepared pans. Bake until top springs back when lightly touched, 20-25 minutes. Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large bowl, beat cream cheese and butter until smooth. Beat in cocoa. Add confectioners' sugar and vanilla; beat until creamy.",
                "Place 1 cake layer on a serving plate; spread with 1/2 cup frosting. Repeat layers. Top with remaining cake layer. Frost top and sides of cake with remaining frosting."
            ],
            "nutrition": "1 piece: 413 calories, 15g fat (8g saturated fat), 78mg cholesterol, 439mg sodium, 66g carbohydrate (48g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Spumoni Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps132710_THCA173831D03_18_6b-2.jpg?fit=700,1024",
            "expert": "I made up this recipe to end a big Italian Christmas Eve dinner. I thought it would be nice and light after a heavy meal. The cake frosts the best when it's been stored in the freezer for a day. —Lynne Ogg, East Bethel, Minnesota",
            "time": "Prep: 30 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "2 packages white cake mix (regular size)",
                "1 teaspoon almond extract",
                "FILLING:",
                "2-1/4 cups heavy whipping cream",
                "1 cup confectioners' sugar, divided",
                "1/2 cup 2% milk",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "6 tablespoons cream cheese, softened, divided",
                "1/4 cup baking cocoa",
                "1 cup chopped maraschino cherries",
                "1/2 teaspoon almond extract"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 3 greased 9-in. round baking pans with parchment; grease paper. Prepare cake mix batter according to package directions, adding almond extract before mixing batter. Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean. Cool as package directs.",
                "In a small bowl, beat cream until it begins to thicken. Add 2/3 cup confectioners' sugar; beat until soft peaks form. Place 1-1/2 cups whipped cream in each of 3 bowls. In another bowl, whisk milk and pudding mix 2 minutes. Let stand 2 minutes or until soft-set. Fold pudding into 1 bowl of whipped cream. In second bowl of whipped cream, beat in 3 tablespoon cream cheese, cocoa and remaining confectioners' sugar until combined. In third bowl, beat in maraschino cherries, almond extract and remaining cream cheese.",
                "Place 1 cake layer on a serving plate; spread with pistachio filling. Top with another cake layer; spread with maraschino filling. Top with remaining cake layer; spread with chocolate filling. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 307 calories, 24g fat (10g saturated fat), 44mg cholesterol, 145mg sodium, 20g carbohydrate (16g sugars, 0 fiber), 3g protein."
        },
        {
            "name": "Old-Fashioned Rhubarb Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps31925_TH1115229D7A-2.jpg",
            "expert": "“At 100 years old, my mom-Frances Beechner of Lincoln, Nebraska-still cooks, bakes, drives her own car and lives in her own home. She's amazing!\" says Barbara Collins. Andover, Massachusetts. “And, this is one of her best desserts.”",
            "time": "Prep: 30 min. Bake: 30 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "4 cups diced fresh or frozen rhubarb",
                "1-1/2 cups sugar, divided",
                "1/4 cup shortening",
                "1 egg",
                "1/2 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "2 teaspoons baking powder",
                "1/4 teaspoon salt",
                "1/2 cup milk"
            ],
            "directions": [
                "Preheat oven to 350°. In a large saucepan, combine rhubarb and 1 cup sugar. Cook over medium heat for 12-15 minutes or until rhubarb is tender.",
                "Meanwhile, in a small bowl, cream shortening and remaining sugar until light and fluffy; beat in egg and vanilla. Combine flour, baking powder and salt; add to creamed mixture alternately with milk. Beat just until combined.",
                "Pour into a greased 9-in. square baking dish. Pour rhubarb mixture over batter. Bake 30-35 minutes or until a toothpick inserted in the center comes out clean. Cool on a wire rack."
            ],
            "nutrition": "1 piece: 257 calories, 7g fat (2g saturated fat), 25mg cholesterol, 171mg sodium, 47g carbohydrate (35g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Chocolate Banana Cream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps46658_TH1789926D49D-2.jpg",
            "expert": "My inspiration for this cake came from my desire to create a dessert combining my father’s love for cake, my mother’s love for chocolate and my love for bananas. It’s divine! —Susie Pattison, Dublin, Ohio",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/4 cups sugar",
                "2 large eggs, separated",
                "1-1/2 cups mashed ripe bananas (about 3 medium)",
                "1/4 cup sour cream",
                "2 teaspoons vanilla extract",
                "1-1/2 cups all-purpose flour",
                "1 teaspoon baking soda",
                "1/4 teaspoon salt",
                "FILLING/FROSTING:",
                "1-1/2 cups cold 2% milk",
                "1 package (3.4 ounces) instant banana cream pudding mix",
                "1 can (16 ounces) chocolate frosting",
                "2 medium firm bananas, sliced",
                "3 tablespoons lemon juice"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in egg yolks. Beat in the bananas, sour cream and vanilla. Combine the flour, baking soda and salt; add to the creamed mixture and mix well.",
                "In a small bowl, beat egg whites until stiff peaks form. Fold into batter. Transfer to two greased and floured 9-in. round baking pans. Bake at 350° for 20-25 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For filling, in a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Cover and refrigerate until chilled.",
                "In a small bowl, beat frosting until light and fluffy. Place bananas in a small bowl; toss with lemon juice.",
                "Place one cake layer on a serving plate; spread with 3 tablespoons frosting. Stir pudding; spread half over the frosting. Top with half of the bananas and the remaining cake layer. Repeat frosting, filling and banana layers. Frost sides and decorate top edge of cake with remaining frosting. Store in the refrigerator."
            ],
            "nutrition": "1 slice: 490 calories, 20g fat (10g saturated fat), 62mg cholesterol, 459mg sodium, 74g carbohydrate (52g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Bananas & Cream Pound Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Bananas-Cream-Pound-Cake_EXPS_FT20_156769_F_0818_1-10.jpg?fit=700,1024",
            "expert": "This banana pound cake got me a date with my future husband. At a church event, he loved it so much, he asked for another piece. The rest is history! —Courtney Farnon, Cartersville, Georgia",
            "time": "Prep: 20 min. Bake: 40 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "3 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "1-1/2 cups all-purpose flour",
                "1/4 teaspoon salt",
                "1/8 teaspoon baking soda",
                "1/2 cup buttermilk",
                "LAYERS:",
                "2 cups 2% milk",
                "1 package (3.4 ounces) instant French vanilla pudding mix",
                "1 package (8 ounces) cream cheese, softened",
                "1/2 cup sweetened condensed milk",
                "1 package (12 ounces) frozen whipped topping, thawed, divided",
                "5 medium ripe bananas"
            ],
            "directions": [
                "Preheat oven to 325°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. In another bowl, mix the flour, salt and baking soda; add to the creamed mixture alternately with buttermilk, beating well after each addition.",
                "Transfer to a greased and floured 9x5-in. loaf pan. Bake until a toothpick inserted in center comes out clean, 40-45 minutes. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "In a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes. In a large bowl, beat cream cheese and condensed milk until smooth; fold in pudding. Fold in 3-1/2 cups whipped topping.",
                "Cut cake into 8 pieces; arrange on bottom of an ungreased 13x9-in. dish, trimming to fit as necessary. Slice bananas; arrange over cake. Spread pudding mixture over top. Refrigerate, covered, for 3 hours. Serve with remaining whipped topping and, if desired, additional bananas."
            ],
            "nutrition": "1 piece: 419 calories, 18g fat (12g saturated fat), 75mg cholesterol, 295mg sodium, 57g carbohydrate (43g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Come-Home-to-Mama Chocolate Cake",
            "image_url": "",
            "expert": "You'll spend less than a half hour whipping up this cure-all cake that starts with a mix. Sour cream and chocolate pudding make it rich and moist, and chocolate, chocolate and more chocolate make it decadent comfort food at its finest. —Taste of Home Test Kitchen",
            "time": "Prep: 25 min. Bake: 40 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  devil's food cake mix (regular size)",
                "1 cup sour cream",
                "1 package (3.9 ounces) instant chocolate fudge pudding mix",
                "4 large eggs, room temperature",
                "1/3 cup canola oil",
                "1/4 cup water",
                "1/4 cup buttermilk",
                "2 tablespoons chocolate syrup",
                "2 teaspoons vanilla extract",
                "FROSTING:",
                "1 pound semisweet chocolate, chopped",
                "6 tablespoons Dutch-process cocoa powder",
                "6 tablespoons boiling water",
                "1-1/2 cups butter, softened",
                "1/2 cup confectioners' sugar"
            ],
            "directions": [
                "In a large bowl, combine the first nine ingredients; beat on low speed for 30 seconds. Beat on medium for 2 minutes. Pour into two greased and floured 8-in. baking pans.",
                "Bake at 350° until a toothpick inserted in the center comes out clean, 38-43 minutes. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, in a microwave, melt chocolate; stir until smooth. Let cool to room temperature, 20-30 minutes. Meanwhile, dissolve cocoa in boiling water; cool.",
                "In a large bowl, beat butter and confectioners' sugar until fluffy. Add melted chocolate; beat on low speed until combined, scraping sides of the bowl as needed. Beat in cocoa mixture.",
                "Place one cake layer on a serving plate; spread with 1-1/2 cups frosting. Top with remaining cake layer. Spread remaining frosting over top and sides of cake."
            ],
            "nutrition": "1 slice: 754 calories, 49g fat (25g saturated fat), 144mg cholesterol, 655mg sodium, 75g carbohydrate (53g sugars, 6g fiber), 9g protein."
        },
        {
            "name": "Lemon Bundt Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/themes/bumblebee-toh-child/images/recipes/Image-69-2x.png",
            "expert": "Convenient lemon cake and pudding mixes hurry along this moist glazed cake shared by Ann Anderson of Andrews, North Carolina.",
            "time": "Prep: 15 min. Bake: 35 min.",
            "makes": "12 servings",
            "ingredients": [
                "1 package  lemon cake mix (regular size)",
                "1 package (3.4 ounces) instant lemon pudding mix",
                "4 eggs",
                "1 cup water",
                "1/3 cup canola oil",
                "1 cup confectioners' sugar",
                "1 tablespoon butter, melted",
                "1/4 cup orange juice"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, pudding mix, eggs, water and oil; beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Pour into a greased and floured 10-in. fluted tube pan. Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Cool on a wire rack for 6-8 minutes.",
                "Meanwhile, for glaze, in a small bowl, combine the confectioners' sugar, butter and orange juice until smooth.",
                "Remove cake from pan to a serving platter; poke holes in cake with a meat fork. Slowly drizzle with glaze. Cool completely."
            ],
            "nutrition": ""
        },
        {
            "name": "Grandma Pietz’s Cranberry Cake Pudding",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps179194_TH143193C04_23_3b-5.jpg?fit=700,1024",
            "expert": "For generations, our family has handed down this cake recipe starring cranberries. Simple and unusual, it remains a treasured family heirloom. —Lisa Potter, Camp Douglas, Wisconsin",
            "time": "Prep: 30 min. Bake: 20 min.",
            "makes": "15 servings (2 cups sauce)",
            "ingredients": [
                "3 tablespoons butter, softened",
                "1 cup sugar",
                "1 large egg, room temperature",
                "2 cups all-purpose flour",
                "2 teaspoons baking powder",
                "Dash salt",
                "1 cup 2% milk",
                "2 cups fresh or frozen cranberries, thawed",
                "SAUCE:",
                "2 cups packed brown sugar",
                "1 cup water",
                "1/2 cup sugar",
                "3 tablespoons butter",
                "1/4 teaspoon vanilla extract"
            ],
            "directions": [
                "Preheat oven to 350°. Grease a 13x9-in. baking pan.",
                "In a large bowl, beat butter and sugar until crumbly. Beat in egg. In another bowl, whisk flour, baking powder and salt; add to butter mixture alternately with milk, beating well after each addition. If desired, coarsely chop cranberries. Fold cranberries into batter.",
                "Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean, 20-25 minutes.",
                "In a large saucepan, combine brown sugar, water, sugar and butter; bring to a boil over medium heat, stirring constantly to dissolve sugar. Cook and stir until slightly thickened; stir in vanilla. Serve warm with cake."
            ],
            "nutrition": "1 piece with 2 tablespoons sauce: 311 calories, 5g fat (3g saturated fat), 26mg cholesterol, 125mg sodium, 64g carbohydrate (50g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Chocolate-Peanut Butter Dump Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/12/Chocolate-Peanut-Butter-Dump-Cake-_EXPS_SDFM19_228787_B10_10_8b-1.jpg?fit=700,1024",
            "expert": "I am a huge fan of the chocolate-peanut butter combination. I'm also a fan of easy recipes, including dump cakes. On occasion, I've omitted the peanut butter chips and used 1 1/2 cups semisweet chocolate chips with very tasty results. —Lisa Varner, El Paso, Texas",
            "time": "Prep: 15 min. Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package (3.9 ounces) instant chocolate pudding mix",
                "1-3/4 cups 2% milk",
                "1 package chocolate cake mix or devil's food cake mix (regular size)",
                "6 packages (1-1/2 ounces each) peanut butter cups, chopped",
                "3/4 cup peanut butter chips",
                "3/4 cup semisweet chocolate chips",
                "1/2 cup chopped unsalted peanuts",
                "Optional: Vanilla ice cream or sweetened whipped cream"
            ],
            "directions": [
                "Preheat oven to 350°. Grease a 13x9-in. baking pan. In a large bowl, combine pudding mix and milk until blended. Stir in cake mix (batter will be thick). Fold in peanut butter cups, peanut butter chips and chocolate chips. Spread into prepared pan. Sprinkle with peanuts.",
                "Bake until a toothpick inserted in center comes out with moist crumbs, 20-25 minutes. Cool completely in pan on a wire rack. Serve with ice cream or whipped cream if desired."
            ],
            "nutrition": "1 piece: 349 calories, 14g fat (6g saturated fat), 3mg cholesterol, 373mg sodium, 51g carbohydrate (33g sugars, 3g fiber), 7g protein."
        },
        {},
        {
            "name": "Lemony Daffodil Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemony-Daffodil-Cake_exps58617_TH2379797D12_13_5b_RMS.jpg?fit=700,1024",
            "expert": "The lemony yellow color of a daffodil reminds us of springtime and new beginnings. My grandma used to make this cake around Easter every year. In our family, we like to serve this cake cold, right out of the refrigerator. —Lori Kampstra, Franklin, Wisconsin",
            "time": "Prep: 45 min. + cooling Bake: 45 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1-1/4 cups egg whites (about 9)",
                "1 package (2.9 ounces) cook-and-serve lemon pudding mix",
                "1 teaspoon cream of tartar",
                "1/2 teaspoon salt",
                "1-1/3 cups sugar",
                "1 cup all-purpose flour",
                "1/2 teaspoon vanilla extract",
                "4 egg yolks",
                "1/4 teaspoon almond extract",
                "1 cup heavy whipping cream",
                "1/4 cup confectioners' sugar",
                "DAFFODILS:",
                "21 Kraft StackerMallows",
                "2 tablespoons light corn syrup, warmed",
                "2 tablespoons yellow colored sugar"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Meanwhile, prepare pudding according to package directions, reducing water to 2 cups. Transfer to a large bowl; cover and cool to room temperature.",
                "Add cream of tartar and salt to egg whites; beat on medium speed until soft peaks form. Gradually add sugar, 2 tablespoons at a time, beating on high until stiff glossy peaks form. Gradually fold in flour, 1/4 cup at a time.",
                "Divide mixture in half. Fold vanilla into 1 portion; set aside. In another bowl, beat egg yolks on high speed until thick and lemon-colored. Stir in almond extract. Fold in unflavored egg white batter.",
                "Alternately spoon white and yellow batters into an ungreased 10-in. tube pan. Gently cut through batter with a knife to swirl. Bake on the lowest rack at 325° for 45-55 minutes or until top springs back when lightly touched. Immediately invert pan; cool completely, about 1 hour.",
                "In a small bowl, beat cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Using a whisk, fold into cooled pudding. Cover and refrigerate until chilled.",
                "Cut six marshmallows with a 1-1/4-in. scalloped round cookie cutter; cut holes in the centers with an apple corer or 3/4-in. round cutter. Brush tops with warm corn syrup; dip tops and sides in sugar. Cut 15 marshmallows with a 2-in. teardrop-shaped cookie cutter; brush with corn syrup and coat with sugar.",
                "Run a knife around sides and center tube of pan. Remove cake to a serving plate; split into two horizontal layers. Spread pudding mixture between layers and over top and sides of cake. Just before serving, decorate with cutouts to make daffodils."
            ],
            "nutrition": "1 slice (calculated without daffodils): 290 calories, 10g fat (5g saturated fat), 130mg cholesterol, 186mg sodium, 46g carbohydrate (34g sugars, 0 fiber), 6g protein."
        },
        {
            "name": "Pineapple Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pineapple-Pudding-Cake_EXPS_FT20_26937_F_0406_1_HOME-17.jpg?fit=700,1024",
            "expert": "My mother used to love making this easy pineapple sunshine cake in the summertime. It's so cool and refreshing that it never lasts very long! —Kathleen Worden, North Andover, Massachusetts",
            "time": "Prep: 25 min. Bake: 15 min. + chilling",
            "makes": "20 servings",
            "ingredients": [
                "1 package (9 ounces) yellow cake mix",
                "1-1/2 cups cold fat-free milk",
                "1 package (1 ounce) sugar-free instant vanilla pudding mix",
                "1 package (8 ounces) reduced-fat cream cheese",
                "1 can (20 ounces) unsweetened crushed pineapple, well drained",
                "1 carton (8 ounces) frozen reduced-fat whipped topping, thawed",
                "1/4 cup chopped walnuts, toasted",
                "20 maraschino cherries, well drained"
            ],
            "directions": [
                "Preheat oven to 350&deg; . Prepare cake mix batter according to package directions; pour into a greased 13x9-in. baking pan. Bake until a toothpick inserted near the center comes out clean, 15-20 minutes. Cool completely on a wire rack.",
                "In a large bowl, whisk milk and pudding mix for 2 minutes. Let stand 2 minutes or until soft-set.",
                "In a small bowl, beat cream cheese until smooth. Beat in pudding mixture until blended. Spread evenly over cake. Sprinkle with pineapple; spread with whipped topping. Sprinkle with walnuts and garnish with cherries. Refrigerate until serving."
            ],
            "nutrition": "1 piece: 152 calories, 5g fat (3g saturated fat), 18mg cholesterol, 173mg sodium, 22g carbohydrate (15g sugars, 1g fiber), 3g protein. Diabetic Exchanges: 1-1/2 starch, 1/2 fat."
        },
        {
            "name": "Slow-Cooker Spumoni Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2020/03/Slow-Cooker-Spumoni-Cake_EXPS_TOHESCODR20_161008_E02_19_6b-1.jpg?fit=700,1024",
            "expert": "I created this spumoni cake for a holiday potluck one year. It has become my most requested dessert. If you prefer, substitute semisweet chocolate chips for the white chocolate. —Lisa Renshaw, Kansas City, Missouri",
            "time": "Prep: 10 min. Cook: 4 hours + standing",
            "makes": "10 servings",
            "ingredients": [
                "3 cups cold 2% milk",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 package white cake mix (regular size)",
                "3/4 cup chopped maraschino cherries",
                "1 cup white baking chips",
                "1 cup semisweet chocolate chips",
                "1 cup pistachios, chopped"
            ],
            "directions": [
                "In a large bowl, whisk milk and pudding mix for 2 minutes. Transfer to a greased 5-qt. slow cooker. Prepare cake mix batter according to package directions, folding cherries into batter. Pour into slow cooker.",
                "Cook, covered, on low about 4 hours, until edges of cake are golden brown.",
                "Remove slow-cooker insert; sprinkle cake with baking chips and chocolate chips. Let cake stand, uncovered, 10 minutes. Sprinkle with pistachios before serving."
            ],
            "nutrition": "1 serving: 588 calories, 27g fat (9g saturated fat), 9mg cholesterol, 594mg sodium, 79g carbohydrate (54g sugars, 3g fiber), 10g protein."
        },
        {
            "name": "Fluted Lemon Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps30176_CX944052D51D-3.jpg",
            "expert": "My great-grandmother used to make this cake, which has been a family favorite for years. You won’t believe it starts with a cake mix! Lemon pudding and apricot nectar add a tanginess and moistness. It’s delicious plain or served with ice cream or whipped cream.",
            "time": "Prep: 15 min. Bake: 45 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  yellow cake mix (regular size)",
                "1 package (3.4 ounces) instant lemon pudding mix",
                "1 cup apricot nectar",
                "1/2 cup canola oil",
                "4 large eggs",
                "1 teaspoon lemon extract",
                "LEMON GLAZE:",
                "1 cup confectioners' sugar",
                "2 tablespoons lemon juice"
            ],
            "directions": [
                "In a large bowl, combine the cake and dry pudding mixes, apricot nectar, oil, eggs and extract; beat on low for 30 seconds. Beat on medium speed for 2 minutes. Pour into a greased and floured 10-in. fluted tube pan.",
                "Bake at 350° for 45-55 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pan to a wire rack to cool completely.",
                "In a small bowl, combine glaze ingredients until smooth; drizzle over warm cake."
            ],
            "nutrition": "1 slice: 369 calories, 15g fat (3g saturated fat), 71mg cholesterol, 406mg sodium, 55g carbohydrate (38g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Rhubarb Custard Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Rhubarb-Custard-Cake_EXPS_FT20_12577_F_0624_1-2.jpg?fit=700,1024",
            "expert": "Rhubarb thrives in my northern garden and is one of the few crops the pesky moose don't bother! Of all the desserts I've tried, this rhubarb custard cake is my first choice. It has old-fashioned appeal but is so simple to prepare. —Evelyn Gebhardt, Kasilof, Alaska",
            "time": "Prep: 10 min. Bake: 40 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package  yellow cake mix (regular size)",
                "4 cups chopped fresh or frozen rhubarb",
                "1 cup sugar",
                "1 cup heavy whipping cream",
                "Whipped cream and fresh mint, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Prepare cake batter according to package directions. Pour into a greased 13x9-in. baking dish. Sprinkle with rhubarb and sugar. Slowly pour cream over top.",
                "Bake until golden brown, 40-45 minutes. Cool on a wire rack for 15 minutes before serving. Garnish with whipped cream and mint if desired. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 300 calories, 13g fat (5g saturated fat), 55mg cholesterol, 269mg sodium, 44g carbohydrate (29g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Pistachio Cake with Walnuts",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pistachio-Cake-with-Walnuts_exps165789_TH2847293C12_13_1bC_RMS-11.jpg?fit=700,1024",
            "expert": "It didn't take long for this cake from the 1970s to become the favorite birthday cake of my husband, Joe. —Patty LaNoue Stearns, Traverse City, Michigan",
            "time": "Prep: 20 min. Bake: 40 min + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "3 large eggs",
                "1 cup club soda",
                "3/4 cup canola oil",
                "1 cup chopped walnuts",
                "FROSTING:",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 cup 2% milk",
                "1 carton (8 ounces) frozen whipped topping, thawed"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. fluted tube pan.",
                "In a large bowl, combine the first 5 ingredients; beat on low speed 30 seconds. Beat on medium 2 minutes. Fold in walnuts. Transfer to prepared pan. Bake 40-45 minutes or until a toothpick inserted in center comes out clean. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "For frosting, in a large bowl, combine pudding mix and milk; beat on low speed 1 minute. Fold in whipped topping. Spread over cake. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 476 calories, 27g fat (6g saturated fat), 54mg cholesterol, 534mg sodium, 51g carbohydrate (31g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Chocolate Eclair Delight",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps36613_HCK143243D09_20_5b_WEB-1.jpg?fit=700,1024",
            "expert": "It's amazing how the layers of this eclair torte soften overnight into a cakelike texture. Just before serving this dessert, I like to dust the top with cocoa. —Agnes Ward, Stratford, Ontario",
            "time": "Prep: 15 min. Cook: 15 min. + chilling",
            "makes": "9 servings",
            "ingredients": [
                "1/2 cup sugar",
                "1/3 cup baking cocoa",
                "2 tablespoons plus 1 teaspoon cornstarch",
                "1/8 teaspoon salt",
                "1/8 teaspoon ground cinnamon",
                "1 can (12 ounces) fat-free evaporated milk",
                "1 cup fat-free milk",
                "1/2 cup egg substitute",
                "1 teaspoon vanilla extract",
                "TOPPING:",
                "2 cups reduced-fat whipped topping",
                "1 tablespoon plus 1/2 teaspoon baking cocoa, divided",
                "9 whole graham crackers, halved"
            ],
            "directions": [
                "In a large heavy saucepan, combine the first 5 ingredients. Gradually whisk in milks until smooth. Cook and stir over medium heat until mixture comes to a boil. Reduce heat; cook and stir until thickened, about 2 minutes longer.",
                "Remove from the heat. Stir a small amount of hot filling into egg substitute; return all to pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer. Remove from the heat. Gently stir in vanilla. Press plastic wrap onto surface of filling; cover and refrigerate until cooled.",
                "Meanwhile, in a small bowl, combine whipped topping and 1 tablespoon cocoa; set aside. Arrange half the crackers in a 9-in. square pan coated with cooking spray. Layer half of the filling and topping over the crackers. Repeat layers. Cover and refrigerate overnight. Just before serving, sprinkle with remaining cocoa."
            ],
            "nutrition": "1 piece: 209 calories, 4g fat (2g saturated fat), 2mg cholesterol, 213mg sodium, 37g carbohydrate (22g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Double-Chocolate Toffee Icebox Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps115134__SD143206C04_01_11b-3.jpg?fit=700,1024",
            "expert": "My mother-in-law taught me that anything tastes good if you use enough chocolate or cream. This no-bake dessert proves she was right. Sometimes I use chocolate graham crackers and stack up the layers in a 9-inch square pan. —Bee Engelhart, Bloomfield Township, Michigan",
            "time": "Prep: 30 min. + chilling",
            "makes": "8 servings",
            "ingredients": [
                "3 cups 2% milk",
                "1 package (5.9 ounces) instant chocolate pudding mix",
                "1-1/2 cups heavy whipping cream",
                "2 packages (9 ounces each) chocolate wafers",
                "2 Heath candy bars (1.4 ounces each), crushed"
            ],
            "directions": [
                "In a large bowl, whisk milk and pudding mix 2 minutes. Let stand 2 minutes or until soft-set. In another large bowl, beat cream until stiff peaks form.",
                "Arrange 20 cookies on bottom of an 8-in. square baking dish. Spread a fourth of the chocolate pudding and a fourth of the whipped cream over cookies. Repeat layers 3 times. Sprinkle with crushed candy bars. Refrigerate overnight."
            ],
            "nutrition": "1 piece: 538 calories, 28g fat (14g saturated fat), 64mg cholesterol, 493mg sodium, 68g carbohydrate (40g sugars, 3g fiber), 8g protein."
        },
        {
            "name": "Chocolate Hazelnut Pudding Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/EXPS_THCA17_186608_C12_02_5b.jpg?fit=700,1024",
            "expert": "This recipe is a busy mom's twist on a favorite dessert—tiramisu. The dish is simple to assemble and perfect to make the day before you want to serve it. The hardest thing about this recipe is waiting for it to chill so you can eat it! —Cheryl Snavely, Hagerstown, Maryland",
            "time": "Prep: 15 min. + chilling",
            "makes": "8 servings",
            "ingredients": [
                "24 soft ladyfingers, divided",
                "1/2 cup Nutella, divided",
                "1-1/2 cups half-and-half cream",
                "1 package (3.4 ounces) instant French vanilla pudding mix",
                "1 carton (12 ounces) frozen whipped topping, thawed",
                "Grated or shaved chocolate"
            ],
            "directions": [
                "Arrange 12 ladyfingers in an 11x7-in. dish. Spread with half the Nutella.",
                "In a large bowl, whisk cream and pudding mix 2 minutes. Stir in whipped topping. Spread half the mixture over the Nutella. Top with remaining ladyfingers; spread with remaining Nutella and then remaining pudding mixture. Sprinkle with grated or shaved chocolate. Refrigerate, covered, 8 hours or overnight. Refrigerate leftovers."
            ],
            "nutrition": "1 piece: 390 calories, 18g fat (11g saturated fat), 67mg cholesterol, 347mg sodium, 46g carbohydrate (37g sugars, 1g fiber), 5g protein."
        },
        {},
        {
            "name": "Cardamom Pumpkin Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/12/Cardamom-Pumpkin-Pudding-Cake_EXPS_SDFM19_229407_B10_10_7b-24.jpg?fit=700,1024",
            "expert": "This no-egg cake is quick, easy and bursting with flavor. I like to serve it with ice cream or whipped cream. —J. Fleming, Almonte, Ontario",
            "time": "Prep: 20 min. Bake: 25 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "1-1/4 cups all-purpose flour",
                "3/4 cup sugar",
                "2 teaspoons baking soda",
                "1-1/4 teaspoons ground cinnamon",
                "1 teaspoon ground cardamom",
                "1/4 teaspoon salt",
                "1/2 cup evaporated milk",
                "1/2 cup canned pumpkin",
                "1/4 cup butter, melted",
                "1 teaspoon vanilla extract",
                "1/2 cup chopped pecans",
                "TOPPING:",
                "1 cup packed brown sugar",
                "1/2 teaspoon ground cinnamon",
                "1-1/2 cups boiling water",
                "Optional: Vanilla ice cream or sweetened whipped cream"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, combine the first 6 ingredients. Add milk, pumpkin, butter and vanilla; mix until blended. Stir in pecans. Transfer to a greased 9-in. square baking pan. For topping, combine brown sugar and cinnamon; sprinkle over batter. Pour water over top (do not stir).",
                "Bake until a toothpick inserted in center comes out clean and liquid is bubbling around the edges, 25-30 minutes. Cool completely in pan on a wire rack. Serve with ice cream or whipped cream if desired."
            ],
            "nutrition": "1 piece: 334 calories, 11g fat (4g saturated fat), 18mg cholesterol, 407mg sodium, 58g carbohydrate (43g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "White Chocolate-Strawberry Tiramisu",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/White-Chocolate-Strawberry-Tiramisu_exps25469_SD142780D08_15_9bC_RMS.jpg?fit=700,1024",
            "expert": "Here's a twist on a classic dessert that highlights another flavor combo my husband and I love: strawberries and white chocolate. Lighten it up if you'd like—I've had good luck with light nondairy whipped topping and reduced-fat cream cheese. —Anna Ginsberg, Chicago, Illinois",
            "time": "Prep/Total Time: 30 min.",
            "makes": "15 servings",
            "ingredients": [
                "2 cups heavy whipping cream",
                "1 package (8 ounces) cream cheese, softened",
                "1/2 cup (4 ounces) mascarpone cheese",
                "9 ounces white baking chocolate, melted and cooled",
                "1 cup confectioners' sugar, divided",
                "1 teaspoon vanilla extract",
                "2 packages (3 ounces each) ladyfingers, split",
                "2/3 cup orange juice",
                "4 cups sliced fresh strawberries",
                "Chocolate syrup, optional"
            ],
            "directions": [
                "In a large bowl, beat cream until soft peaks form. In another bowl, beat cheeses until light and fluffy. Beat in cooled chocolate, 1/2 cup confectioners' sugar and vanilla. Fold in 2 cups whipped cream.",
                "Brush half of the ladyfingers with half of the orange juice; arrange in a 13x9-in. dish. Spread with 2 cups cream cheese mixture; top with half of the strawberries. Brush remaining ladyfingers with remaining orange juice; arrange over berries.",
                "Gently stir remaining confectioners' sugar into remaining cream cheese mixture; fold in remaining whipped cream. Spread over ladyfingers. Top with remaining strawberries. Refrigerate until serving. If desired, drizzle with chocolate syrup before serving."
            ],
            "nutrition": "1 piece: 404 calories, 30g fat (18g saturated fat), 103mg cholesterol, 169mg sodium, 33g carbohydrate (27g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Slow-Cooker Hot Fudge Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Slow-Cooker-Hot-Fudge-Cake_EXPS_QEBZ20_30683_B01_29_8b-2.jpg?fit=700,1024",
            "expert": "A cake baked in a slow cooker may seem unusual, but after-dinner smiles prove how tasty it is. Sometimes, for a change of pace, I substitute butterscotch chips for chocolate. —Marleen Adkins, Placentia, California",
            "time": "Prep: 20 min. Cook: 4 hours",
            "makes": "8 servings",
            "ingredients": [
                "1-3/4 cups packed brown sugar, divided",
                "1 cup all-purpose flour",
                "6 tablespoons baking cocoa, divided",
                "2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1/2 cup 2% milk",
                "2 tablespoons butter, melted",
                "1/2 teaspoon vanilla extract",
                "1-1/2 cups semisweet chocolate chips",
                "1-3/4 cups boiling water",
                "Vanilla ice cream"
            ],
            "directions": [
                "In a small bowl, combine 1 cup brown sugar, flour, 3 tablespoons cocoa, baking powder and salt. Combine the milk, butter and vanilla; stir into dry ingredients just until combined.",
                "Spread into a 3-qt. slow cooker coated with cooking spray. Sprinkle with chocolate chips. In another bowl, combine the remaining brown sugar and cocoa; stir in boiling water. Pour over batter (do not stir).",
                "Cover and cook on high for 4 to 4-1/2 hours or until a toothpick inserted in the center of cake comes out clean. Serve warm with ice cream."
            ],
            "nutrition": "1 piece: 435 calories, 13g fat (8g saturated fat), 10mg cholesterol, 306mg sodium, 82g carbohydrate (66g sugars, 3g fiber), 4g protein."
        },
        {
            "name": "Lemon Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemon-Pudding-Cake_EXPS_CF2BZ19_6435_B12_03_6b-28.jpg?fit=700,1024",
            "expert": "My husband, Lloyd, loves this cake because it tastes like lemon meringue pie. The cake is no-fuss and makes just enough for the two of us.—Dawn Fagerstrom, Warren, Minnesota",
            "time": "Prep: 15 min. Bake: 40 min.",
            "makes": "2 servings",
            "ingredients": [
                "1 large egg, separated, room temperature",
                "1/2 cup sugar",
                "1/3 cup whole milk",
                "2 tablespoons all-purpose flour",
                "2 tablespoons lemon juice",
                "1 teaspoon grated lemon zest",
                "1/8 teaspoon salt",
                "Optional: Confectioners' sugar, lemon slices and whipped cream"
            ],
            "directions": [
                "Preheat oven to 325°. In a bowl, beat egg yolk. Add sugar, milk, flour, lemon juice, zest and salt; beat until smooth. Beat egg white until stiff peaks form; gently fold into lemon mixture. Pour into 2 ungreased 6-oz. custard cups (cups will be very full).",
                "Place the cups in an 8-in. square baking pan. Pour boiling water into pan to a depth of 1 in. Bake until a knife inserted in the center comes out clean and top is golden, 40-45 minutes. If desired, top with confectioners' sugar, lemon slices and whipped cream."
            ],
            "nutrition": "1 cake: 288 calories, 4g fat (2g saturated fat), 112mg cholesterol, 200mg sodium, 60g carbohydrate (51g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Six-Layer Coconut Cake with Lemon Filling",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps178251_SF143315C10_23_5b_WEB-5.jpg?fit=700,1024",
            "expert": "I found this recipe when going through my grandmother's old files. It was originally made with an orange filling, but using lemon pudding in the filling makes it easier to prepare. It is simply the best. —Angela Leinenbach, Mechanicsvlle, Virginia",
            "time": "Prep: 1 hour + chilling Bake: 25 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "FILLING:",
                "3-1/2 cups cold whole milk",
                "2 packages (3.4 ounces each) instant lemon pudding mix",
                "1 teaspoon grated lemon zest",
                "CAKE:",
                "6 large egg whites",
                "1 cup butter, softened",
                "3 cups sugar",
                "3 teaspoons vanilla extract",
                "4 cups cake flour",
                "1 teaspoon baking soda",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "2 cups buttermilk",
                "FROSTING:",
                "1 cup sugar",
                "2 large egg whites, room temperature",
                "1/2 cup water",
                "1/4 teaspoon salt",
                "1/8 teaspoon cream of tartar",
                "1/4 teaspoon vanilla extract",
                "2 cups sweetened shredded coconut"
            ],
            "directions": [
                "In a large bowl, whisk milk, pudding mix and zest 2 minutes. Cover and refrigerate at least 1 hour.",
                "Place egg whites in a large bowl; let stand at room temperature 30 minutes. Preheat oven to 350°. Line bottoms of three greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in vanilla. In another bowl, whisk flour, baking soda, baking powder and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. With clean beaters, beat egg whites on high speed until stiff peaks form; gently fold into batter.",
                "Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean.  Cool in pans 10 minutes before removing to wire racks; remove paper. Cool completely.",
                "For frosting, in a large heavy saucepan, combine sugar, egg whites, water, salt and cream of tartar over low heat or in a double boiler over simmering water. With a portable mixer, beat on low speed 1 minute. Continue beating on low over low heat until frosting reaches 160°, about 12 minutes.",
                "Pour into the bowl of a heavy-duty stand mixer; add vanilla. Beat on high until frosting forms stiff peaks, about 7 minutes.",
                "Using a long serrated knife, cut each cake horizontally in half. Place one cake layer on a serving plate; spread with 3/4 cup filling to within 1-inch of edge. Repeat four more times. Top with remaining cake layer. Frost top and sides of cake. Sprinkle top with coconut; gently press coconut into frosting on sides of cake. Store in the refrigerator."
            ],
            "nutrition": ""
        },
        {
            "name": "Lemon Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemon-Pudding-Cake_EXPS_CF2BZ19_6435_B12_03_6b-28.jpg?fit=700,1024",
            "expert": "My husband, Lloyd, loves this cake because it tastes like lemon meringue pie. The cake is no-fuss and makes just enough for the two of us.—Dawn Fagerstrom, Warren, Minnesota",
            "time": "Prep: 15 min. Bake: 40 min.",
            "makes": "2 servings",
            "ingredients": [
                "1 large egg, separated, room temperature",
                "1/2 cup sugar",
                "1/3 cup whole milk",
                "2 tablespoons all-purpose flour",
                "2 tablespoons lemon juice",
                "1 teaspoon grated lemon zest",
                "1/8 teaspoon salt",
                "Optional: Confectioners' sugar, lemon slices and whipped cream"
            ],
            "directions": [
                "Preheat oven to 325°. In a bowl, beat egg yolk. Add sugar, milk, flour, lemon juice, zest and salt; beat until smooth. Beat egg white until stiff peaks form; gently fold into lemon mixture. Pour into 2 ungreased 6-oz. custard cups (cups will be very full).",
                "Place the cups in an 8-in. square baking pan. Pour boiling water into pan to a depth of 1 in. Bake until a knife inserted in the center comes out clean and top is golden, 40-45 minutes. If desired, top with confectioners' sugar, lemon slices and whipped cream."
            ],
            "nutrition": "1 cake: 288 calories, 4g fat (2g saturated fat), 112mg cholesterol, 200mg sodium, 60g carbohydrate (51g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Pistachio and Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Pistachio-Coconut-Cake_EXPS_THFM17_200562_A09_20_1b.jpg?fit=700,1024",
            "expert": "This coconut cake is good any time of the year, but the color is perfect for St. Patrick's Day. The secret is adding instant pistachio pudding mix into the cake mix and the frosting. —Dora May Meredith, Rockford, Illinois",
            "time": "Prep: 20 min. Bake: 40 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 white cake mix (regular size)",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 cup lemon-lime soda",
                "3/4 cup canola oil",
                "3 large eggs",
                "1/2 cup flaked coconut",
                "1/2 cup toasted shelled pistachios, chopped",
                "FROSTING:",
                "1-1/4 cups cold 2% milk",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "1 carton (8 ounces) frozen whipped topping, thawed",
                "TOPPINGS:",
                "1/4 cup flaked coconut, toasted",
                "1/4 cup toasted shelled pistachios, chopped"
            ],
            "directions": [
                "Preheat oven to 350°. Combine the first five ingredients; beat on low speed until moistened, about 30 seconds. Beat on medium for 2 minutes; stir in coconut and toasted pistachios.",
                "Pour into two greased 8-in. round baking pans or a greased 13x9-in. baking pan. Bake until a toothpick inserted in the center comes out clean, 40-45 minutes. Cool on a wire rack.",
                "For frosting, beat milk and pudding mix on low speed for 2 minutes. Fold in whipped topping. Spread frosting over top of cake, and, if using round pans, between layers. Top with toasted coconut and pistachios. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 380 calories, 21g fat (6g saturated fat), 36mg cholesterol, 431mg sodium, 41g carbohydrate (28g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Banana Split Icebox Cake",
            "image_url": "",
            "expert": "One day a friend showed me how to make a traditional icebox cake with just cream and graham crackers. I make it extra special with the fruit. Now everyone at the potluck can have a banana split with no fuss! —Shelly Flye, Albion, Maine",
            "time": "Prep: 30 min. + chilling",
            "makes": "10 servings",
            "ingredients": [
                "1 carton (16 ounces) frozen whipped topping, thawed",
                "1 cup sour cream",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 can (8 ounces) crushed pineapple, drained",
                "24 whole graham crackers",
                "2 medium bananas, sliced",
                "Toppings: Chocolate syrup, halved fresh strawberries and additional banana slices"
            ],
            "directions": [
                "In a large bowl, mix whipped topping, sour cream and pudding mix until blended; fold in pineapple. Cut a small hole in the tip of a pastry bag. Transfer pudding mixture to bag.",
                "On a flat serving plate, arrange 4 crackers in a rectangle. Pipe about 1 cup pudding mixture over crackers; top with about 1/4 cup banana slices. Repeat layers 5 times. Refrigerate, covered, overnight.",
                "Just before serving, top with chocolate syrup, strawberries and additional banana slices."
            ],
            "nutrition": "1 piece: 405 calories, 15g fat (11g saturated fat), 16mg cholesterol, 372mg sodium, 60g carbohydrate (30g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Warm Rocky Road Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Warm-Rocky-Road-Cake_exps111991_SD142780C08_15_5bC_RMS-4.jpg?fit=700,1024",
            "expert": "When it's warm, this reminds me of super moist lava cake. And until I made this, I didn't think a slow-cooker cake could be so attractive. It's a real winner. —Scarlett Elrod, Newnan, Georgia",
            "time": "Prep: 20 min. Cook: 3 hours",
            "makes": "16 servings",
            "ingredients": [
                "1 package German chocolate cake mix (regular size)",
                "1 package (3.9 ounces) instant chocolate pudding mix",
                "1 cup sour cream",
                "1/3 cup butter, melted",
                "3 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "3-1/4 cups 2% milk, divided",
                "1 package (3.4 ounces) cook-and-serve chocolate pudding mix",
                "1-1/2 cups miniature marshmallows",
                "1 cup semisweet chocolate chips",
                "1/2 cup chopped pecans, toasted",
                "Vanilla ice cream, optional"
            ],
            "directions": [
                "In a large bowl, combine the first 6 ingredients; add 1-1/4 cups milk. Beat on low speed 30 seconds. Beat on medium 2 minutes. Transfer to a greased 4- or 5-qt. slow cooker. Sprinkle cook-and-serve pudding mix over batter.",
                "In a small saucepan, heat remaining milk until bubbles form around side of pan; gradually pour over contents of slow cooker.",
                "Cook, covered, on high 3-4 hours or until a toothpick inserted in cake portion comes out with moist crumbs.",
                "Turn off slow cooker. Sprinkle marshmallows, chocolate chips and pecans over cake; let stand, covered, until marshmallows begin to melt, about 5 minutes. Serve warm. If desired, serve with ice cream."
            ],
            "nutrition": "3/4 cup (calculated without ice cream): 386 calories, 17g fat (8g saturated fat), 59mg cholesterol, 431mg sodium, 55g carbohydrate (34g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Light Black Forest Dessert",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps45655_HC1785943D63-5.jpg",
            "expert": "Applesauce is used to keep this light version of Black Forest Cake healthy. Now, even people who are on a diet can enjoy a slice of rich chocolate cake! —Nancy Zimmerman, Cape May Court House, New Jersey",
            "time": "Prep: 40 min. Bake: 35 min. + cooling",
            "makes": "24 servings",
            "ingredients": [
                "2 cups cherry juice blend",
                "1-3/4 cups sugar",
                "1/2 cup unsweetened applesauce",
                "1/4 cup canola oil",
                "2 eggs",
                "2 tablespoons cider vinegar",
                "3 teaspoons vanilla extract",
                "3 cups all-purpose flour",
                "1/3 cup baking cocoa",
                "2 teaspoons baking soda",
                "1 teaspoon salt",
                "1-1/2 cups cold fat-free milk",
                "1 package (1.4 ounces) sugar-free instant chocolate pudding mix",
                "1 can (20 ounces) reduced-sugar cherry pie filling",
                "1-1/2 cups frozen fat-free whipped topping, thawed"
            ],
            "directions": [
                "In a large bowl, beat the cherry juice, sugar, applesauce, oil, eggs, vinegar and vanilla until well blended.",
                "In a large bowl, combine the flour, cocoa, baking soda and salt; gradually beat into cherry juice mixture until blended.",
                "Pour into a 13x9-in. baking pan coated with cooking spray. Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Cool completely on a wire rack.",
                "In a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Frost top of cake with pudding. Cover and refrigerate for 15 minutes. Top with pie filling. Chill until serving. Serve with whipped topping."
            ],
            "nutrition": "1 piece: 186 calories, 3g fat (0 saturated fat), 18mg cholesterol, 272mg sodium, 36g carbohydrate (21g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Light Black Forest Dessert",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps45655_HC1785943D63-5.jpg",
            "expert": "Applesauce is used to keep this light version of Black Forest Cake healthy. Now, even people who are on a diet can enjoy a slice of rich chocolate cake! —Nancy Zimmerman, Cape May Court House, New Jersey",
            "time": "Prep: 40 min. Bake: 35 min. + cooling",
            "makes": "24 servings",
            "ingredients": [
                "2 cups cherry juice blend",
                "1-3/4 cups sugar",
                "1/2 cup unsweetened applesauce",
                "1/4 cup canola oil",
                "2 eggs",
                "2 tablespoons cider vinegar",
                "3 teaspoons vanilla extract",
                "3 cups all-purpose flour",
                "1/3 cup baking cocoa",
                "2 teaspoons baking soda",
                "1 teaspoon salt",
                "1-1/2 cups cold fat-free milk",
                "1 package (1.4 ounces) sugar-free instant chocolate pudding mix",
                "1 can (20 ounces) reduced-sugar cherry pie filling",
                "1-1/2 cups frozen fat-free whipped topping, thawed"
            ],
            "directions": [
                "In a large bowl, beat the cherry juice, sugar, applesauce, oil, eggs, vinegar and vanilla until well blended.",
                "In a large bowl, combine the flour, cocoa, baking soda and salt; gradually beat into cherry juice mixture until blended.",
                "Pour into a 13x9-in. baking pan coated with cooking spray. Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Cool completely on a wire rack.",
                "In a small bowl, whisk milk and pudding mix for 2 minutes. Let stand for 2 minutes or until soft-set. Frost top of cake with pudding. Cover and refrigerate for 15 minutes. Top with pie filling. Chill until serving. Serve with whipped topping."
            ],
            "nutrition": "1 piece: 186 calories, 3g fat (0 saturated fat), 18mg cholesterol, 272mg sodium, 36g carbohydrate (21g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Easy Pistachio Tube Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps193156__SD163324D08_06_5b-5.jpg?fit=700,1024",
            "expert": "Mixes make this light cake easy, and a fluted tube pan gets it holiday party-ready. Go for the pistachios on top—the extra crunch is worth it. —Dina Crowell, Fredericksburg, Virginia",
            "time": "Prep: 15 min. Bake: 35 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package yellow cake mix (regular size)",
                "1 package (3.4 ounces) instant pistachio pudding mix",
                "4 large eggs, room temperature",
                "1-1/2 cups water",
                "1/4 cup canola oil",
                "1/2 teaspoon almond extract",
                "Confectioners' sugar",
                "Finely chopped pistachios, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 10-in. fluted tube pan.",
                "In a large bowl, combine the first 6 ingredients; beat on low speed 30 seconds. Beat on medium 2 minutes. Transfer to prepared pan. Bake until a toothpick inserted near the center comes out clean, 35-40 minutes. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "Dust with confectioners' sugar. If desired, sprinkle with pistachios."
            ],
            "nutrition": "1 piece (calculated without pistachios): 266 calories, 10g fat (2g saturated fat), 62mg cholesterol, 416mg sodium, 41g carbohydrate (24g sugars, 0 fiber), 4g protein."
        },
        {
            "name": "Blueberry Pudding Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Blueberry-Pudding-Cake_EXPS_FT21_8707_F_0413_1.jpg?fit=700,1024",
            "expert": "My father-in-law has a number of blueberry bushes near his house, so I have an abundant supply every year. I'm always looking for new ways to use them. This blueberry pudding cake is one of my latest creations.  —Jan Bamford, Sedgwick, Maine",
            "time": "Prep: 15 min. Bake: 45 min.",
            "makes": "9 servings",
            "ingredients": [
                "2 cups fresh or frozen blueberries",
                "1 teaspoon ground cinnamon",
                "1 teaspoon lemon juice",
                "1 cup all-purpose flour",
                "3/4 cup sugar",
                "1 teaspoon baking powder",
                "1/2 cup 2% milk",
                "3 tablespoons butter, melted",
                "TOPPING:",
                "3/4 cup sugar",
                "1 tablespoon cornstarch",
                "1 cup boiling water",
                "Whipped cream, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Toss blueberries with cinnamon and lemon juice; pour into a greased 8-in. square baking dish. In a small bowl, combine flour, sugar and baking powder; stir in milk and butter. Spoon over berries.",
                "Combine sugar and cornstarch; sprinkle over batter. Slowly pour boiling water over all. Bake until a toothpick inserted into the cake portion comes out clean, 45-50 minutes. Serve warm. If desired, top with whipped cream and additional blueberries."
            ],
            "nutrition": "1 serving: 244 calories, 4g fat (3g saturated fat), 11mg cholesterol, 91mg sodium, 51g carbohydrate (37g sugars, 1g fiber), 2g protein."
        },
        {
            "name": "Chocolate Caramel Cake with Butterscotch Frosting",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps32595_SD950750D31A-3.jpg",
            "expert": "Chocolate cake from a boxed mix gets a special treatment when spread with an easy butterscotch frosting and draped with a caramel-nut topping. “I love to make this cake for guests or to take to potlucks,” writes Gloria Guadron of Washington, Indiana. “It’s easy yet looks like it took all day.”",
            "time": "Prep: 25 min. + cooling Bake: 30 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 package  German chocolate cake mix (regular size)",
                "3/4 cup packed brown sugar",
                "6 tablespoons butter, cubed",
                "2 tablespoons heavy whipping cream",
                "1/2 cup finely chopped pecans",
                "1 package (3.4 ounces) instant butterscotch pudding mix",
                "1 cup cold 2% milk",
                "2-1/2 cups whipped topping"
            ],
            "directions": [
                "Prepare and bake cake according to package directions for two 9-in. round baking pans. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "Meanwhile, in a small saucepan, combine the brown sugar, butter and cream. Cook and stir over low heat until sugar is dissolved. Increase heat to medium. Do not stir. Cook for 3-6 minutes or until bubbles form in center of mixture and color is amber brown. Remove from the heat; stir in pecans. Cool at room temperature for 30 minutes, stirring occasionally.",
                "In a small bowl, whisk pudding mix and milk for 2 minutes. Let stand for 2 minutes or until soft-set. Fold in whipped topping. Cover and refrigerate until thickened, about 20 minutes.",
                "Place one cake layer on a serving platter; spread with 3/4 cup pudding mixture. Top with remaining cake layer; spread remaining pudding mixture over top and sides of cake.",
                "If necessary, reheat pecan mixture over low heat to achieve a spreading consistency. Spoon pecan mixture around edge of cake. Store in the refrigerator."
            ],
            "nutrition": ""
        },
        {
            "name": "Lemon Custard Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemon-Custard-Cake_EXPS_HHRBZ22_1034_P3_CK_08_11_1b.jpg?fit=700,1024",
            "expert": "This custard cake recipe comes from my grandma— it's nice to whip up when unexpected company stops in. It's a cool, creamy dessert that tastes like you fussed. —Sue Gronholz, Beaver Dam, Wisconsin",
            "time": "Prep/Total Time: 15 min.",
            "makes": "12 servings",
            "ingredients": [
                "1 prepared angel food cake (8 to 10 ounces)",
                "1 package (3.4 ounces) instant lemon pudding mix",
                "1-1/2 cups cold 2% milk",
                "1 cup sour cream",
                "1 can (21 ounces) cherry or strawberry pie filling"
            ],
            "directions": [
                "Tear angel food cake into bite-sized pieces. Place in a 13 x 9-in. pan. In a bowl, combine the pudding mix, milk and sour cream. Beat until thickened, about 2 minutes. Spread over cake. Spoon pie filling on top. Chill until serving time."
            ],
            "nutrition": "1 serving: 184 calories, 5g fat (3g saturated fat), 7mg cholesterol, 270mg sodium, 31g carbohydrate (18g sugars, 1g fiber), 3g protein."
        },
        {
            "name": "Chocolate Mint Cream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps27677_CWX1384296D56.jpg",
            "expert": "This recipe is fun and I had a lot of fun 'dreaming' this one up. It's easy, but very impressive when serving.—Patty Thompson, Jefferson, Iowa",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1 cup water",
                "1/2 cup canola oil",
                "3 large eggs",
                "1/2 teaspoon peppermint extract",
                "1 cup crushed mint creme Oreo cookies",
                "TOPPING:",
                "2 packages (3.9 ounces each) instant chocolate pudding mix",
                "1/3 cup confectioners' sugar",
                "1-1/2 cups cold 2% milk",
                "1/2 to 1 teaspoon peppermint extract",
                "1 carton (12 ounces) frozen whipped topping, thawed",
                "1/2 cup crushed mint creme Oreo cookies",
                "15 mint Andes candies"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water, oil, eggs and extract; beat on low speed for 30 seconds. Beat on medium speed for 2 minutes. Fold in crushed cookies.",
                "Pour into three greased and floured 9-in. round baking pans. Bake at 350° for 18-24 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For topping, combine the dry pudding mixes, confectioners' sugar, milk and extract until thickened. Fold in whipped topping and crushed cookies.",
                "Place one cake layer on a serving plate; spread with topping. Repeat layers twice. Frost sides of cake with remaining topping.",
                "Chop eight candies; sprinkle over center of cake. Cut remaining candies in half; garnish each serving with a half candy. Store in the refrigerator."
            ],
            "nutrition": "1 slice: 492 calories, 23g fat (10g saturated fat), 48mg cholesterol, 574mg sodium, 67g carbohydrate (43g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Easy Pineapple Coconut Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps13085_TH10134C37D.jpg",
            "expert": "Pairing pineapple with coconut lent a tropical flavor to the dessert served as the finale to our theme party. Shared by a former co-worker, this recipe has been in my file for 20 years and never fails to delight those who try a piece.\r\n-Gina Mueller, Converse, Texas",
            "time": "Prep: 15 min. + chilling Bake: 20 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 package  yellow cake mix (regular size)",
                "1-1/4 cups cold 2% milk",
                "1 package (3.4 ounces) instant vanilla pudding mix",
                "1 can (20 ounces) crushed pineapple, drained",
                "1 envelope whipped topping mix (Dream Whip)",
                "3 ounces cream cheese, softened",
                "1/4 cup sugar",
                "1/2 teaspoon vanilla extract",
                "1/2 cup sweetened shredded coconut, toasted"
            ],
            "directions": [
                "Prepare and bake the cake according to package directions, using a greased 13x9-in. baking pan. Cool on a wire rack.",
                "In a large bowl, whisk milk and pudding mix for 2 minutes. Stir in pineapple. Spread over cake. Prepare whipped topping mix according to package directions; set aside.",
                "In a small bowl, beat the cream cheese, sugar and vanilla until smooth. Beat in 1 cup whipped topping. Fold in remaining topping. Spread over pudding. Sprinkle with coconut. Cover and refrigerate for 3 hours or overnight."
            ],
            "nutrition": ""
        }
    ]
}