{
    "category": "Red Velvet Cakes",
    "recipes": [
        {
            "name": "Peppermint Red Velvet Cake",
            "expert": "A couple of years ago, I saw a recipe for a peppermint red velvet cake that called for cake mixes. I prefer homemade cakes, so I developed this one from scratch. It is a beautiful, elegant dessert. In the summer, I omit the peppermint and use fresh berries, adding them between the layers and on top of the frosting. —Aimee Fortney, Fairview, Tennessee",
            "time": "Prep: 20 min. Bake: 25 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "3/4 cup butter, softened",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "1/2 cup sour cream",
                "1 bottle (1 ounce) red food coloring, optional",
                "1 teaspoon white vinegar",
                "2-1/2 cups cake flour",
                "4 teaspoons baking cocoa",
                "1 teaspoon baking powder",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "FROSTING:",
                "2 packages (8 ounces each) cream cheese, softened",
                "1/2 cup butter, softened",
                "1-1/2 teaspoons peppermint extract",
                "2 cups confectioners' sugar",
                "1 cup crushed peppermint candies",
                "31 peppermint candies"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in sour cream, food coloring if desired, and vinegar. Combine the flour, baking cocoa, baking powder, baking soda and salt; add to the creamed mixture alternately with the buttermilk, beating well after each addition.",
                "Transfer to two greased and floured 9-in. round baking pans. Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean.",
                "Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, beat cream cheese and butter until combined. Beat in extract. Gradually add confectioners' sugar; beat until smooth. Spread frosting between layers and over top and sides of cake. Press crushed candies on top and sides of cake. Arrange whole candies around bottom of cake."
            ],
            "nutrition": "1 slice: 702 calories, 35g fat (22g saturated fat), 134mg cholesterol, 528mg sodium, 90g carbohydrate (58g sugars, 1g fiber), 8g protein."
        },
        {
            "name": "Blue-Ribbon Red Velvet Cake",
            "expert": "This two-layer beauty features a striking red interior. It calls for more cocoa than most red velvet cakes, making it extra chocolaty. Feel free to change the color of the food coloring to suit the occasion. This recipe won a blue ribbon in the holiday cake division at the 2006 Alaska State Fair. I think this cake will be a winner in your house, too! —Cindi DeClue, Anchorage, Alaska",
            "time": "Prep: 35 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1-1/2 cups canola oil",
                "1 cup buttermilk",
                "2 large eggs, room temperature",
                "2 tablespoons red food coloring",
                "1 teaspoon white vinegar",
                "2-1/2 cups all-purpose flour",
                "1-1/2 cups sugar",
                "3 tablespoons baking cocoa",
                "1 teaspoon baking soda",
                "FROSTING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/2 cup butter, softened",
                "2 teaspoons vanilla extract",
                "3-3/4 cups confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 2 greased 9-in. round pans with parchment; grease parchment. Beat the first 5 ingredients until well blended. In another bowl, whisk together flour, sugar, baking cocoa and baking soda; gradually beat into oil mixture.",
                "Transfer batter to prepared pans. Bake until a toothpick inserted in center comes out clean, 25-30 minutes. Cool in pans 10 minutes before removing to wire racks; remove parchment. Cool completely.",
                "For frosting, beat cream cheese, butter and vanilla until blended. Gradually beat in confectioners’ sugar until smooth. Using a long serrated knife, trim tops of cakes; set tops aside. Place 1 cake layer on a serving plate. Spread with 3/4 cup frosting. Top with remaining cake layer, bottom side up. Frost top and sides with remaining frosting.",
                "Break cake tops into pieces. Pulse in a food processor until fine crumbs form. Decorate cake with crumbs as desired."
            ],
            "nutrition": "1 piece: 559 calories, 33g fat (8g saturated fat), 53mg cholesterol, 208mg sodium, 64g carbohydrate (48g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Red Velvet Crepe Cakes",
            "expert": "It's well worth the time to make this beautiful and delicious cake. Each moist layer is separated by a rich and creamy filling. Treat your family on special occasions with this cake. —Crystal Heaton, Alton, Utah",
            "time": "Prep: 1-1/4 hours Cook: 25 min.",
            "makes": "2 crepe cakes (8 servings each)",
            "ingredients": [
                "1 package  red velvet cake mix (regular size)",
                "2-3/4 cups whole milk",
                "1 cup all-purpose flour",
                "3 large eggs",
                "3 large egg yolks",
                "1/4 cup butter, melted",
                "3 teaspoons vanilla extract",
                "FROSTING:",
                "2 packages (8 ounces each ) cream cheese, softened",
                "1-1/4 cups butter, softened",
                "1/2 teaspoon salt",
                "12 cups confectioners' sugar",
                "5 teaspoons vanilla extract",
                "Fresh blueberries"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, milk, flour, eggs, egg yolks, butter and vanilla; beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Heat a lightly greased 8-in. nonstick skillet over medium heat; pour 1/4 cup batter into center of skillet. Lift and tilt pan to coat bottom evenly. Cook until top appears dry; turn and cook 15-20 seconds longer. Remove to a wire rack. Repeat with remaining batter, greasing skillet as needed. When cool, stack crepes with waxed paper or paper towels in between.",
                "For frosting, in a large bowl, beat the cream cheese, butter and salt until fluffy. Add confectioners' sugar and vanilla; beat until smooth.",
                "To assemble two crepe cakes, place one crepe on each of two cake plates. Spread each with one rounded tablespoon frosting to within 1/2 in. of edges. Repeat layers until all crepes are used. Spread remaining frosting over tops and sides of crepe cakes. Garnish with blueberries."
            ],
            "nutrition": "1 slice: 812 calories, 33g fat (19g saturated fat), 157mg cholesterol, 521mg sodium, 125g carbohydrate (102g sugars, 0 fiber), 7g protein."
        },
        {
            "name": "Cheesecake Layered Red Velvet Cake",
            "expert": "I love both red velvet cake and cheesecake. So why not combine them into one stunning red velvet cheesecake recipe? It's best when served chilled, right out of the fridge. —Melissa Gaines, Knoxville, Tennessee",
            "time": "Prep: 35 min. Bake: 70 min. + chilling",
            "makes": "16 servings",
            "ingredients": [
                "2 packages (8 ounces each) cream cheese, softened",
                "1/2 cup sugar",
                "1/2 cup sour cream",
                "4 teaspoons all-purpose flour",
                "1-1/2 teaspoons vanilla extract",
                "2 large eggs, room temperature, lightly beaten",
                "CAKE:",
                "1-1/2 cups sugar",
                "1-1/2 cups canola oil",
                "1 cup buttermilk",
                "2 large eggs, room temperature",
                "1 bottle (1 ounce) red food coloring",
                "2 teaspoons cider vinegar",
                "1 teaspoon vanilla extract",
                "2-1/2 cups cake flour",
                "2 tablespoons baking cocoa",
                "1-1/2 teaspoons baking soda",
                "1 teaspoon salt",
                "FROSTING:",
                "3 packages (8 ounces each) cream cheese, softened",
                "1-1/2 cups butter, softened",
                "1 tablespoon vanilla extract",
                "3 to 3-1/2 cups confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 325°. Line bottom of a 9-in. springform pan with parchment; grease paper.",
                "In a large bowl, beat cream cheese and sugar until smooth. Beat in sour cream, flour and vanilla. Add eggs; beat on low speed just until blended. Pour into prepared pan. Place on a baking sheet.",
                "Bake until center is set, 40-50 minutes. Cool on a wire rack 10 minutes. Loosen sides from pan with a knife. Cool 1 hour longer. Refrigerate until ready to assemble, covering when completely cooled.",
                "For cake, increase oven setting to 350°. Line bottoms of 2 greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, beat sugar, oil, buttermilk, eggs, food coloring, vinegar and vanilla until well blended. In another bowl, whisk flour, cocoa, baking soda and salt; gradually beat into sugar mixture.",
                "Transfer to prepared pans. Bake until a toothpick inserted in center comes out clean, 30-35 minutes. Cool in pans 10 minutes before removing to wire racks; remove parchment. Cool completely.",
                "For frosting, in a large bowl, beat cream cheese, butter and vanilla until smooth. Gradually beat in enough confectioners' sugar to reach desired consistency. Place 1 cake layer on a serving plate. Spread with 1 cup frosting. Carefully place cheesecake over frosting.",
                "Spread cheesecake with another 1 cup frosting. Top with remaining cake layer. Frost top and sides of cake with remaining frosting. Refrigerate overnight before serving."
            ],
            "nutrition": "1 piece: 896 calories, 66g fat (28g saturated fat), 166mg cholesterol, 676mg sodium, 70g carbohydrate (51g sugars, 1g fiber), 9g protein."
        },
        {
            "name": "Red Velvet Marble Cake",
            "expert": "I watched my grandma prepare her red velvet showstopper many times for family get-togethers. The fluffy butter frosting perfectly complements the flavor of this gorgeous cake.—Jodi Anderson, Overbrook, Kansas",
            "time": "Prep: 20 min. Bake: 30 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "3/4 cup butter, softened",
                "2-1/4 cups sugar",
                "3 large eggs",
                "4-1/2 teaspoons white vinegar",
                "1-1/2 teaspoons vanilla extract",
                "3-3/4 cups cake flour",
                "1-1/2 teaspoons baking soda",
                "1-1/2 cups buttermilk",
                "3 tablespoons baking cocoa",
                "4-1/2 teaspoons red food coloring",
                "FROSTING:",
                "1 cup butter, softened",
                "9 cups confectioners' sugar",
                "3 teaspoons vanilla extract",
                "2/3 to 3/4 cup 2% milk"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 2 greased 9-in. round baking pans with parchment; grease paper.",
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, 1 at a time, beating well after each addition. Beat in vinegar and vanilla. In another bowl, whisk flour and baking soda; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Transfer half the batter to another bowl; stir in cocoa and food coloring until blended. Alternately drop plain and chocolate batters by 1/4 cupfuls into prepared pans, dividing batter evenly between pans. To make batter level in pans, bang cake pans several times on counter.",
                "Bake 30-35 minutes or until a toothpick inserted in center comes out clean. Cool 10 minutes before removing from pans to wire racks to cool completely.",
                "In a large bowl, beat butter, confectioners’ sugar, vanilla and enough milk to reach a spreading consistency. Spread frosting between layers and over top and sides of cake."
            ],
            "nutrition": "1 piece: 701 calories, 22g fat (13g saturated fat), 90mg cholesterol, 342mg sodium, 123g carbohydrate (96g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Best Red Velvet Cake",
            "expert": "It's just not Christmas at our house until this festive cake appears. This is different from other red velvet cake recipes I’ve had; the icing is as light as snow. —Kathryn Davison, Charlotte, North Carolina",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "14 servings",
            "ingredients": [
                "1/2 cup butter, softened",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "2 bottles (1 ounce each) red food coloring",
                "1 tablespoon white vinegar",
                "1 teaspoon vanilla extract",
                "2-1/4 cups cake flour",
                "2 tablespoons baking cocoa",
                "1 teaspoon baking soda",
                "1 teaspoon salt",
                "1 cup buttermilk",
                "FROSTING:",
                "1/2 cup cold water",
                "1 tablespoon cornstarch",
                "2 cups butter, softened",
                "2 teaspoons vanilla extract",
                "3-1/2 cups confectioners' sugar"
            ],
            "directions": [
                "Preheat oven to 350°. Cream butter and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in food coloring, vinegar and vanilla. In another bowl, whisk together flour, cocoa, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Pour into 2 greased and floured 9-in. round baking pans. Bake until a toothpick inserted in the center comes out clean, 20-25 minutes. Cool layers 10 minutes before removing from pans to wire racks to cool completely.",
                "For frosting, combine water and cornstarch in a small saucepan over medium heat. Stir until thickened and opaque, 2-3 minutes. Cool to room temperature. Beat butter and vanilla until light and fluffy. Beat in cornstarch mixture. Gradually add confectioners' sugar; beat until light and fluffy. Spread between layers and over top and side of cake."
            ],
            "nutrition": "1 piece: 595 calories, 34g fat (21g saturated fat), 115mg cholesterol, 564mg sodium, 71g carbohydrate (52g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "“Fishy” Red Velvet Cake",
            "expert": "Based on an old-fashioned recipe, this unusual birthday cake will steal the show at your party. The vibrant red color is sure to make everyone's eyes open wide. The taste will bring them back for seconds. It's a \"reel\" fun dessert.\r\n-Elizabeth LeBlanc, Bourg, Louisiana",
            "time": "Prep: 30 min. + cooling Bake: 15 min. + cooling",
            "makes": "12-16 servings",
            "ingredients": [
                "1 cup butter, softened",
                "1-1/2 cups sugar",
                "2 eggs",
                "1 teaspoon vanilla extract",
                "1 teaspoon butter flavoring",
                "1 bottle (1 ounce) red food coloring, optional",
                "2-1/2 cups cake flour",
                "2 tablespoons baking cocoa",
                "1 teaspoon baking soda",
                "1 cup buttermilk",
                "1 teaspoon vinegar",
                "FLUFFY FROSTING:",
                "1-1/2 cups 2% milk",
                "1/2 cup all-purpose flour",
                "1-1/2 cups butter, softened",
                "1-1/2 cups sugar",
                "1-1/2 teaspoons vanilla extract",
                "1-1/2 teaspoons butter flavoring",
                "Gummy fish and worms, optional"
            ],
            "directions": [
                "In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in vanilla, butter flavoring and food coloring if desired. Combine flour, cocoa and baking soda. Combine buttermilk and vinegar. Add flour mixture alternately with buttermilk mixture to creamed mixture. beating well after each addition.",
                "Pour into three greased and floured 9-in. round baking pans. Bake at 350° for 15-20 minutes or until a toothpick inserted in the center comes out clean. Cool in pans for 10 minutes before removing to wire racks to cool completely.",
                "For frosting, whisk together milk and flour in a saucepan. Cook, over medium heat stirring constantly, for 5 minutes or until thickened. Cover and cool.",
                "In a large bowl, cream butter and sugar until light and fluffy. Beat in vanilla and butter flavoring. Gradually add cooled milk mixture and beat 4 minutes or until light and fluffy. Frost cooled cake. Decorate with gummy fish and worms if desired."
            ],
            "nutrition": "1 piece: 524 calories, 30g fat (18g saturated fat), 107mg cholesterol, 404mg sodium, 59g carbohydrate (39g sugars, 1g fiber), 5g protein."
        },
        {
            "name": "Sugared Red Velvet Cake Roll",
            "expert": "Moist and tender, this classic cake wrapped around luxurious cream cheese frosting is a sweet feast for the eyes. You’ll love its melt-in-your-mouth texture.—Kristie Gentry, King, North Carolina",
            "time": "Prep: 30 min. Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs",
                "3/4 cup sugar",
                "1 bottle (1 ounce) red food coloring",
                "2 tablespoons buttermilk",
                "1 tablespoon canola oil",
                "1 teaspoon cider vinegar",
                "1 teaspoon vanilla extract",
                "3/4 cup cake flour",
                "1/4 cup baking cocoa",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "Confectioners' sugar",
                "FILLING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter, softened",
                "3 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "Additional confectioners' sugar"
            ],
            "directions": [
                "Line a greased 15x10x1-in. baking pan with waxed paper; grease the paper and set aside.",
                "In a large bowl, beat eggs on high speed for 3 minutes. Gradually add sugar, beating until mixture becomes thick and lemon-colored. Beat in the food coloring, buttermilk, oil, vinegar and vanilla. Combine the flour, cocoa, baking powder and salt; fold into egg mixture. Spread into prepared pan.",
                "Bake at 350° for 12-15 minutes or until cake springs back when lightly touched. Cool for 5 minutes. Invert onto a kitchen towel dusted with confectioners' sugar. Gently peel off waxed paper. Roll up cake in the towel jelly-roll style, starting with a short side. Cool completely on a wire rack.",
                "In a small bowl, beat cream cheese and butter until smooth. Beat in confectioners' sugar and vanilla. Unroll cake; spread filling over cake to within 1/2 in. of edges. Roll up again. Place seam side down on a serving platter. Dust with additional confectioners' sugar. Refrigerate for 1 hour."
            ],
            "nutrition": "1 slice: 337 calories, 13g fat (7g saturated fat), 101mg cholesterol, 241mg sodium, 51g carbohydrate (41g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Red Velvet Pound Cake",
            "expert": "This delicious red velvet pound cake is the perfect combination of flavors. Make sure the cake has cooled before icing it; for extra crunch sprinkle some roasted pecans on top. &mdash;Robin Smith, Old Fort, North Carolina",
            "time": "Prep: 30 min. Bake: 70 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "1 cup butter, softened",
                "1/2 cup shortening",
                "3 cups sugar",
                "6 large eggs, room temperature",
                "2 bottles (1 ounce each) red food coloring",
                "1 teaspoon lemon extract",
                "1 teaspoon vanilla extract",
                "3-1/4 cups all-purpose flour",
                "1 tablespoon baking cocoa",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "3/4 cup 2% milk",
                "ICING:",
                "1 package (8 ounces) cream cheese, softened",
                "1/4 cup butter or margarine, softened",
                "1/2 teaspoon vanilla extract",
                "3-3/4 cups confectioners' sugar",
                "1/2 cup chopped pecans, toasted"
            ],
            "directions": [
                "Preheat oven to 325°. Grease and flour a 10-in. fluted tube pan.",
                "In a large bowl, cream butter, shortening and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in food coloring and extracts (mixture may appear curdled). In another bowl, whisk flour, baking cocoa, baking powder and salt; add to creamed mixture alternately with milk, beating after each addition just until combined.",
                "Transfer to prepared pan. Bake until a toothpick inserted in center comes out clean, 70-75 minutes. Cool in pan 15 minutes before removing to a wire rack to cool completely.",
                "For icing, in a large bowl, beat cream cheese and butter until creamy. Beat in vanilla. Gradually beat in confectioners’ sugar until smooth. Spread over cake; sprinkle with pecans. Store in refrigerator."
            ],
            "nutrition": "1 piece: 639 calories, 30g fat (14g saturated fat), 123mg cholesterol, 281mg sodium, 87g carbohydrate (67g sugars, 1g fiber), 7g protein."
        },
        {
            "name": "Red Velvet Cupcakes with Coconut Frosting",
            "expert": "There's no better way to celebrate being together than with these fun-loving cupcakes. —Marie Rizzio, Interlochen, Michigan",
            "time": "Prep: 25 min. Bake: 20 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "3/4 cup butter, softened",
                "1-1/2 cups sugar",
                "2 large eggs, room temperature",
                "1 tablespoon red food coloring",
                "1 teaspoon vanilla extract",
                "1-3/4 cups all-purpose flour",
                "1/4 cup baking cocoa",
                "3/4 teaspoon baking soda",
                "3/4 teaspoon salt",
                "1 cup buttermilk",
                "1 teaspoon white vinegar",
                "FROSTING:",
                "2 packages (8 ounces each) cream cheese, softened",
                "1/4 cup butter, softened",
                "1-1/2 cups confectioners' sugar",
                "1 teaspoon vanilla extract",
                "2 cups sweetened shredded coconut, divided"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy, 5-7 minutes. Add eggs, one at a time, beating well after each addition. Stir in food coloring and vanilla. Combine flour, cocoa, baking soda and salt. Combine buttermilk and vinegar. Add dry ingredients to creamed mixture alternately with buttermilk mixture, beating well after each addition.",
                "Fill foil or paper-lined muffin cups two-thirds full. Bake until a toothpick inserted in center comes out clean, 18-22 minutes. Cool 10 minutes before removing from pans to wire rack to cool completely.",
                "For frosting, in a large bowl, beat cream cheese and butter until fluffy, 3-5 minutes. Add confectioners’ sugar and vanilla; beat until smooth. Stir in 1 cup coconut. Frost cupcakes.",
                "Toast remaining 1 cup coconut; sprinkle over cupcakes. Store in the refrigerator."
            ],
            "nutrition": "1 cupcake: 296 calories, 18g fat (12g saturated fat), 59mg cholesterol, 260mg sodium, 32g carbohydrate (23g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Doughnut Hole Cake",
            "expert": "This is the easiest, most impressive cake I’ve ever made! You can use chocolate, lemon or strawberry cake mix in the place of red velvet if you prefer. —Robert Pickart, Chicago, Illinois",
            "time": "Prep: 15 min. Bake: 35 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "32 vanilla cake doughnut holes",
                "1 package red velvet cake mix (regular size)",
                "1 can (16 ounces) vanilla frosting"
            ],
            "directions": [
                "Preheat oven to 350°. Place 16 doughnut holes in each of 2 greased 8-in. round baking pans. Prepare cake mix according to package directions. Pour batter over doughnuts, dividing evenly.",
                "Bake until a toothpick inserted in cake comes out clean, 35-40 minutes. Cool in pans 10 minutes before removing to a wire rack to cool completely. Spread frosting between layers and over top of cake."
            ],
            "nutrition": "1 piece: 420 calories, 20g fat (7g saturated fat), 38mg cholesterol, 401mg sodium, 57g carbohydrate (36g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Red Velvet Cake Bites",
            "expert": "Everyone loves red velvet, but any cake mix can work here. I've even rolled chopped macadamia nuts into pineapple cake and dipped them into white chocolate. Whatever you do, have fun! —Anne Powers, Munford, Alabama",
            "time": "Prep: 45 min. + chilling Bake: 25 min. + cooling",
            "makes": "5 dozen",
            "ingredients": [
                "1 package  red velvet cake mix (regular size)",
                "1 can (16 ounces) cream cheese frosting",
                "1 pound each white, milk chocolate  and dark chocolate candy coating"
            ],
            "directions": [
                "Prepare and bake cake mix according to package directions using a 13x9-in. baking pan. Cool completely.",
                "Crumble cake into a large bowl. Add frosting; beat well. Refrigerate until easy to handle, about 1 hour. Shape into 1-1/2-inch balls; transfer to waxed paper-lined baking sheets. Refrigerate at least 1 hour.",
                "In a microwave, melt white candy coating; stir until smooth. Dip first 20 cake balls into coating; allow excess to drip off. Return to baking sheets; let stand until set. Repeat with milk chocolate and dark chocolate coatings and remaining cake balls. If desired, drizzle with additional candy coating. Store in airtight containers."
            ],
            "nutrition": "1 cake ball: 206 calories, 11g fat (7g saturated fat), 11mg cholesterol, 79mg sodium, 28g carbohydrate (24g sugars, 0 fiber), 1g protein."
        },
        {
            "name": "Pink Velvet Cupcakes",
            "expert": "My daughter loves all things pink, so this recipe was just right for her birthday. Even my teenage son (not a fan of pink) ate his share, too. —Paulette Smith, Winston-Salem, North Carolina",
            "time": "Prep: 30 min. + chilling Bake: 25 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "1 cup butter, softened",
                "1-1/4 cups sugar",
                "1/8 teaspoon pink paste food coloring",
                "3 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "2-1/2 cups all-purpose flour",
                "1-1/2 teaspoons baking powder",
                "1/4 teaspoon baking soda",
                "1/4 teaspoon salt",
                "1 cup buttermilk",
                "WHITE CHOCOLATE GANACHE:",
                "2 cups white baking chips",
                "1/2 cup heavy whipping cream",
                "1 tablespoon butter",
                "Pink coarse sugar and sugar pearls"
            ],
            "directions": [
                "In a large bowl, cream the butter, sugar and food coloring until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. Combine the flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Fill 24 paper-lined muffin cups two-thirds full. Bake at 350° until a toothpick inserted in the center comes out clean, 23-27 minutes. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "Meanwhile, place white chips in a small bowl. In a small saucepan, bring cream just to a boil. Pour over chips; whisk until smooth. Stir in butter. Transfer to a large bowl. Chill for 30 minutes, stirring once.",
                "Beat on high speed until soft peaks form and frosting is light and fluffy, 2-3 minutes. Frost cupcakes. Top cupcakes with coarse sugar and sugar pearls. Store in the refrigerator."
            ],
            "nutrition": "1 each: 266 calories, 15g fat (9g saturated fat), 57mg cholesterol, 154mg sodium, 29g carbohydrate (20g sugars, 0 fiber), 3g protein."
        },
        {
            "name": "Surprise Red Cupcakes",
            "expert": "Catch your honey red-handed this Valentine's Day with a batch of these confections. Our family loves these filled cupcakes. They disappear in a day. —Betty B. Claycomb, Alverton, Pennsylvania",
            "time": "Prep: 1 hour Bake: 20 min. + cooling",
            "makes": "2 dozen",
            "ingredients": [
                "2 cups sugar, divided",
                "3 tablespoons plus 2 cups all-purpose flour, divided",
                "1/2 cup milk",
                "1/2 cup plus 1/3 cup shortening, divided",
                "2 large eggs",
                "1 bottle (1 ounce) red food coloring",
                "1 tablespoon white vinegar",
                "2 teaspoons vanilla extract, divided",
                "3 tablespoons baking cocoa",
                "1 teaspoon baking soda",
                "1 cup buttermilk",
                "1/2 cup butter, softened",
                "3 tablespoons confectioners' sugar",
                "FROSTING:",
                "1 cup semisweet chocolate chips",
                "1/3 cup plus 1 to 3 teaspoons evaporated milk, divided",
                "1-1/2 cups confectioners' sugar"
            ],
            "directions": [
                "In a heavy saucepan, combine 1/2 cup sugar, 3 tablespoons flour and milk until smooth. Bring to a boil; cook and stir for 1-2 minutes or until thickened. Remove from the heat; cool.",
                "In a large bowl, cream 1/2 cup shortening and remaining sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in the food coloring, vinegar and 1 teaspoon vanilla. Combine the cocoa, baking soda and remaining flour; gradually add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Fill paper-lined muffin cups two-thirds full. Bake at 350° for 20-25 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a small bowl, beat butter and remaining shortening until smooth. Beat in the confectioners' sugar, cooled sugar mixture and remaining vanilla until light and fluffy, about 3 minutes. Insert a large round tip into a pastry or plastic bag; fill with filling. Insert the tip halfway into the center of each cupcake and fill with a small amount of filling.",
                "For frosting, in a heavy saucepan, melt chips with 1/3 cup evaporated milk over low heat; stir until smooth. Remove from the heat. Beat in confectioners' sugar. Add enough remaining milk to achieve spreading consistency. Frost cupcakes."
            ],
            "nutrition": "1 each: 288 calories, 14g fat (6g saturated fat), 30mg cholesterol, 114mg sodium, 40g carbohydrate (29g sugars, 1g fiber), 3g protein."
        }
    ]
}