{
    "category": "Shortcakes",
    "recipes": [
        {
            "name": "Pineapple RumChata Shortcakes",
            "expert": "This deliciously different dessert is made in the slow cooker instead of in the oven. When done, add final touches to the cooled pineapple shortcake jars and serve. —Joan Hallford, North Richland Hills, Texas",
            "time": "Prep: 20 min. Cook: 1-1/2 hours + cooling",
            "makes": "6 cakes",
            "ingredients": [
                "1-1/2 cups all-purpose flour",
                "1/4 cup sugar",
                "1 teaspoon baking powder",
                "1/2 teaspoon salt",
                "1/4 teaspoon baking soda",
                "1/3 cup cold butter",
                "1 large egg, room temperature",
                "3/4 cup sour cream",
                "3 tablespoons RumChata liqueur",
                "TOPPING:",
                "1-1/2 cups fresh pineapple, cut into 1/2-inch pieces",
                "3 tablespoons sugar, divided",
                "1 to 2 tablespoons RumChata liqueur",
                "1 teaspoon grated lime zest",
                "1/2 cup heavy whipping cream",
                "1 medium lime, thinly sliced, optional"
            ],
            "directions": [
                "In a large bowl, whisk flour, sugar, baking powder, salt and baking soda. Cut in butter until mixture resembles coarse crumbs. In another bowl, whisk egg, sour cream and RumChata. Add to flour mixture; stir just until moistened.",
                "Spoon mixture into 6 greased half-pint jars. Center lids on jars and screw on bands until fingertip tight. Place jars in a 6- or 7-qt. oval slow cooker; add enough hot water to reach halfway up the jars, about 5 cups. Cook, covered, on high 1-1/2 to 2 hours or until a toothpick inserted in center of shortcake comes out clean.",
                "Meanwhile, for the topping, combine pineapple, 2 tablespoons sugar, RumChata and lime zest. Refrigerate, covered, at least 1 hour. Remove jars from slow cooker to wire racks to cool completely. In a large bowl, beat cream until it begins to thicken. Add remaining 1 tablespoon sugar; beat until soft peaks form.",
                "Top shortcakes with pineapple mixture, whipped cream and, if desired, lime slices."
            ],
            "nutrition": "1 serving: 463 calories, 28g fat (17g saturated fat), 101mg cholesterol, 442mg sodium, 47g carbohydrate (20g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Strawberry Buttermilk Skillet Shortcake",
            "expert": "This scratch-made strawberry buttermilk cake is a family favorite. The recipe is over 100 years old, and I remember my grandma making it. We still carry on the family tradition by making this old-fashioned recipe each summer. —Claudia Lamascolo, Melbourne, Florida",
            "time": "Prep: 25 min. Bake: 50 min.",
            "makes": "10 servings",
            "ingredients": [
                "10 tablespoons shortening",
                "1/4 cup butter, softened",
                "1 cup sugar",
                "2 large eggs, room temperature",
                "2-1/2 cups all-purpose flour",
                "3 teaspoons baking powder",
                "1/2 teaspoon salt",
                "2/3 cup buttermilk",
                "STREUSEL TOPPING:",
                "2/3 cup all-purpose flour",
                "1/2 cup sugar",
                "1 teaspoon ground cinnamon",
                "1/4 teaspoon ground allspice",
                "1/2 cup butter, softened",
                "2 cups sliced fresh strawberries",
                "Whipped cream"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream shortening, butter and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. In another bowl, whisk flour, baking powder and salt; add to creamed mixture alternately with buttermilk, beating well after each addition. Transfer to a 10 to 12-in. cast-iron or other ovenproof skillet.",
                "For streusel topping, in a small bowl, mix flour, sugar, cinnamon and allspice; cut in butter until crumbly. Sprinkle over batter. Top with strawberries. Bake until center is puffed and edges are golden brown, 50-60 minutes. Serve warm with whipped cream."
            ],
            "nutrition": "1 piece: 526 calories, 27g fat (12g saturated fat), 74mg cholesterol, 418mg sodium, 64g carbohydrate (33g sugars, 2g fiber), 6g protein."
        },
        {},
        {
            "name": "Strawberry Shortcake Puffs",
            "expert": "When my wonderful friend Kelly brought me a pint of strawberries, I didn’t want to just eat them straight (tempting as it was). I decided to make strawberry shortcake with my own pretty, elegant spin. These light and airy puff pastry stacks let the fruit shine. —Jenny Dubinsky, Inwood, West Virginia",
            "time": "Prep: 25 min. Bake: 15 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1 sheet frozen puff pastry, thawed",
                "4 cups fresh strawberries, sliced",
                "1/4 cup plus 3 tablespoons sugar, divided",
                "1-1/2 cups heavy whipping cream",
                "1/2 teaspoon vanilla extract"
            ],
            "directions": [
                "Preheat oven to 400°. On a lightly floured surface, roll puff pastry to a 10-in. square; cut into 12 rectangles (approx. 3x2-1/2 in.). Place on ungreased baking sheets. Bake until golden brown, 12-15 minutes. Remove to wire racks; cool completely.",
                "In a large bowl, toss strawberries with 1/4 cup sugar. Let stand 30 minutes, stirring occasionally. In another bowl, beat cream until it begins to thicken. Add vanilla and remaining sugar; beat until stiff peaks form.",
                "To serve, split pastries horizontally in half. Top each bottom half with 2 tablespoons whipped cream and 1 tablespoon strawberries; replace top half. Top with remaining whipped cream and strawberries."
            ],
            "nutrition": "1 serving: 246 calories, 16g fat (8g saturated fat), 34mg cholesterol, 76mg sodium, 23g carbohydrate (11g sugars, 2g fiber), 3g protein."
        },
        {
            "name": "Strawberries and Cream Scones",
            "expert": "I took a leap and veered from Mom's original shortcake recipe to create this scone recipe with cream and strawberries. Instead of a short biscuit, I made light sweet-cream scones for the shortcake part. The difference was delightful! —Martha Laviolette, South Rockwood, Michigan",
            "time": "Prep: 20 min. + freezing Bake: 15 min.",
            "makes": "8 servings",
            "ingredients": [
                "2 pints fresh strawberries, sliced",
                "1 container (16 ounces) frozen sweetened sliced strawberries, thawed",
                "3 cups all-purpose flour",
                "1/3 cup sugar",
                "1 tablespoon baking powder",
                "3/4 teaspoon salt",
                "2-1/2 cups heavy whipping cream, divided",
                "1-1/2 teaspoons vanilla extract",
                "3 tablespoons confectioners' sugar",
                "Grated citrus zest, optional"
            ],
            "directions": [
                "In a large bowl, combine fresh and thawed strawberries. Cover and refrigerate until serving.",
                "Line an 8-in. round cake pan with plastic wrap, letting edges hang over sides; set aside. In a large bowl, combine flour, sugar, baking powder and salt. In a small bowl, stir together 1-1/2 cups cream and vanilla. Stir into flour mixture just until moistened. Transfer to prepared pan; pat into an even layer. Cover and freeze 45 minutes or until slightly firm. Preheat oven to 425°.",
                "Turn dough onto a lightly floured surface. Cut into 8 wedges. Place wedges on a parchment-lined baking sheet. Brush with 1 tablespoon whipping cream and, if desired, sprinkle with additional sugar. Bake until golden brown, 15-18 minutes.",
                "Meanwhile, combine remaining whipping cream and confectioners' sugar; whip until stiff peaks form. To serve, cut scones in half; top with reserved strawberries and whipped cream. Garnish as desired."
            ],
            "nutrition": "1 scone with 2/3 cup strawberries and 1/4 cup whipped cream: 549 calories, 28g fat (17g saturated fat), 85mg cholesterol, 425mg sodium, 69g carbohydrate (31g sugars, 4g fiber), 8g protein."
        },
        {
            "name": "Shortcake for 50",
            "expert": "Folks are always impressed to see these individual shortcakes on the buffet table. They're surprisingly easy to make.—Clara Honeyager, Mukwonago, Wisconsin",
            "time": "Prep: 40 min. Bake: 1 hour",
            "makes": "50 servings",
            "ingredients": [
                "10-1/2 cups all-purpose flour",
                "4-1/4 cups sugar, divided",
                "1/2 cup plus 1 tablespoon baking powder",
                "4 teaspoons salt",
                "1 cup cold butter, cubed",
                "3 cups heavy whipping cream",
                "1-1/2 cups water",
                "8 quarts fresh strawberries, sliced",
                "Whipped cream or ice cream"
            ],
            "directions": [
                "In a large bowl, combine flour, 2-1/4 cups sugar, baking powder and salt; cut in butter until crumbly. Stir in cream and water just until moistened.",
                "Drop by 1/4 cupfuls 2 in. apart onto ungreased baking sheets. Bake at 450° for 15 minutes or until golden brown. Cool on wire racks. Combine berries and remaining sugar.",
                "To serve, cut shortcakes horizontally; spoon about 1/3 cup berries and whipped cream on bottom halves. Replace tops; top with another 1/3 cup of berries and additional cream."
            ],
            "nutrition": "1 each: 270 calories, 10g fat (6g saturated fat), 29mg cholesterol, 449mg sodium, 44g carbohydrate (22g sugars, 3g fiber), 4g protein."
        },
        {
            "name": "Strawberry Lemon Shortcake",
            "expert": "I love a good strawberry shortcake, but this recipe is my favorite by far. The citrus zest in the dough adds a refreshing zip to the sweet dessert. —Nancy Hooper, Glen Burnie, Maryland",
            "time": "Prep: 20 min. Bake: 10 min. + cooling",
            "makes": "4 servings",
            "ingredients": [
                "1 tablespoon butter, softened",
                "1/4 teaspoon grated lemon zest",
                "1-1/2 cups sliced fresh strawberries",
                "2 tablespoons sugar",
                "SHORTCAKES:",
                "1 cup all-purpose flour",
                "3 tablespoons sugar",
                "1 teaspoon baking powder",
                "3/4 teaspoon grated lemon zest",
                "1/8 teaspoon salt",
                "3 tablespoons cold butter, cubed",
                "1/3 cup 2% milk",
                "1 large egg yolk",
                "WHIPPED CREAM:",
                "1/3 cup heavy whipping cream",
                "1 teaspoon sugar"
            ],
            "directions": [
                "Preheat oven to 450°. In a small bowl, mix softened butter and lemon zest until blended. In another bowl, toss strawberries with sugar; let stand while preparing shortcakes.",
                "In a large bowl, whisk flour, sugar, baking powder, lemon zest and salt; cut in cold butter until mixture resembles coarse crumbs. In another bowl, whisk milk and egg yolk until blended; add to flour mixture, stirring with a fork just until moistened.",
                "Turn dough onto a lightly floured surface; knead gently 4-5 times. Divide dough into 4 portions; pat each into a 3/4-in.-thick circle. Place 2 in. apart on a parchment-lined baking sheet. Bake 8-10 minutes or until golden brown. Remove from pan to a wire rack.",
                "Meanwhile, in a small bowl, beat cream until it begins to thicken. Add sugar; beat until soft peaks form.",
                "To serve, split shortcakes in half. Top bottoms with whipped cream and strawberries. Spread tops with lemon-butter mixture; place over strawberries."
            ],
            "nutrition": "1 shortcake: 394 calories, 21g fat (13g saturated fat), 106mg cholesterol, 286mg sodium, 47g carbohydrate (21g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Citrus Berry Shortcake",
            "expert": "Here's a quick and easy classic with a soft shortcake layer. Sometimes, I'll sprinkle blueberries over the top for an especially colorful finish. —Meryl Herr, Grand Rapids, Michigan",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "1-1/3 cups all-purpose flour",
                "1/2 cup sugar",
                "2 teaspoons baking powder",
                "1/4 teaspoon salt",
                "2/3 cup buttermilk",
                "1/4 cup butter, melted",
                "1 large egg",
                "1 tablespoon orange juice",
                "1 teaspoon grated orange zest",
                "1 teaspoon vanilla extract",
                "1 cup sliced fresh strawberries",
                "TOPPING:",
                "1-1/2 cups sliced fresh strawberries",
                "1 tablespoon lemon juice",
                "1 teaspoon sugar",
                "2 cups whipped topping",
                "2 teaspoons orange liqueur or  orange juice"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottom of a greased 9-in. round baking pan with parchment; grease paper.",
                "In a large bowl, whisk flour, sugar, baking powder and salt. In another bowl, whisk buttermilk, melted butter, egg, orange juice, orange zest and vanilla. Stir into dry ingredients just until moistened. Fold in 1 cup sliced strawberries. Transfer to prepared pan.",
                "Bake 20-25 minutes or until a toothpick inserted in center comes out clean. Cool in pan 10 minutes before removing from pan to a wire rack; remove parchment. Cool completely.",
                "For topping, in a small bowl, toss strawberries with lemon juice and sugar. Refrigerate until serving. In another bowl, mix whipped topping and liqueur; spread over cake. Drain strawberries; arrange over top."
            ],
            "nutrition": "1 slice: 268 calories, 10g fat (7g saturated fat), 42mg cholesterol, 245mg sodium, 39g carbohydrate (20g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Biscuit Strawberry Shortcake",
            "expert": "This biscuit strawberry shortcake is the perfect ending to any meal. Homemade biscuits and fresh berries shine in this classic dessert. —Stephanie Moon, Boise, Idaho",
            "time": "Prep/Total Time: 30 min.",
            "makes": "8 servings",
            "ingredients": [
                "2 cups all-purpose flour",
                "3 tablespoons sugar, divided",
                "1 tablespoon baking powder",
                "1/2 teaspoon salt",
                "1/4 cup cold butter",
                "1 cup 2% milk",
                "2 pints strawberries, chopped",
                "1 tablespoon orange juice",
                "1-1/2 cups whipped topping"
            ],
            "directions": [
                "In a large bowl, combine flour, 2 tablespoons sugar, baking powder and salt. Cut in butter until mixture resembles coarse crumbs. Gradually stir in milk until a soft dough forms.",
                "Drop the dough by heaping tablespoonfuls into 8 mounds on a lightly greased baking sheet. Bake at 425° until lightly browned, 12-15 minutes. Cool on a wire rack.",
                "Meanwhile, place strawberries, orange juice and remaining 1 tablespoon sugar in a bowl; toss gently. Split shortcakes in half horizontally. Place bottom halves on serving plates; top with whipped topping and strawberries. Replace shortcake tops."
            ],
            "nutrition": "1 each: 261 calories, 10g fat (6g saturated fat), 19mg cholesterol, 372mg sodium, 38g carbohydrate (12g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "Strawberry Biscuit Shortcake",
            "expert": "It seams Mom was always making biscuits. She served them plain for breakfast and dinner, especially when we had stew or baked beans. My favorite was when she served them like this—topped with fresh strawberries and whipped cream! —Elaine Gagnon, Pawtucket, Rhode Island",
            "time": "Prep/Total Time: 30 min.",
            "makes": "2 servings",
            "ingredients": [
                "1/2 cup all-purpose flour",
                "1/4 cup sugar",
                "3/4 teaspoon baking powder",
                "1/8 teaspoon salt",
                "1 tablespoon shortening",
                "4 tablespoons 2% milk, divided",
                "Fresh strawberries and whipped cream"
            ],
            "directions": [
                "Preheat oven to 375°. In a small bowl, combine the flour, sugar, baking powder and salt; cut in shortening until mixture resembles coarse crumbs. Stir in 3 tablespoons milk until a thick batter forms.",
                "Drop 4 mounds of batter onto a greased baking sheet. Brush with remaining milk.",
                "Bake until golden brown, 14-16 minutes. Layer biscuits with berries and whipped cream in small bowls or on dessert plates."
            ],
            "nutrition": "1 each: 284 calories, 7g fat (2g saturated fat), 4mg cholesterol, 313mg sodium, 50g carbohydrate (26g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Grandma’s Strawberry Shortcake",
            "expert": "Here's a family-sized version of my grandma's summertime dessert. I can still taste the sweet juicy berries she piled over warm biscuits and topped with a huge dollop of fresh whipped cream. My father added even more indulgence to his serving by first buttering his biscuits. —Shirley Joan Helfenbein, Lapeer, Michigan",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "2 cups all-purpose flour",
                "2 tablespoons sugar",
                "3 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1/2 cup cold butter, cubed",
                "1 large egg, room temperature, beaten",
                "2/3 cup half-and-half cream",
                "1 cup heavy whipping cream",
                "2 tablespoons confectioners' sugar",
                "1/8 teaspoon vanilla extract",
                "Additional butter",
                "1-1/2 cups fresh strawberries, sliced"
            ],
            "directions": [
                "Preheat oven to 450°. Combine flour, sugar, baking powder and salt. Cut in butter until mixture resembles coarse crumbs. In another bowl, whisk egg and half-and-half. Add all at once to crumb mixture; stir just until moistened.",
                "Spread batter into a greased 8-in. round baking pan, slightly building up the edges. Bake until golden brown, 16-18 minutes. Remove from pan; cool on a wire rack.",
                "Beat heavy cream until it begins to thicken. Add confectioners' sugar and vanilla; beat until stiff peaks form. Split cake in half crosswise; butter bottom layer. Spoon half the strawberries over bottom layer. Spread with some whipped cream. Cover with top cake layer. Top with remaining berries and whipped cream. Cut into wedges."
            ],
            "nutrition": "1 piece: 381 calories, 25g fat (16g saturated fat), 98mg cholesterol, 447mg sodium, 32g carbohydrate (8g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Whole Wheat Strawberry Shortcakes",
            "expert": "Nothing says spring better than a fresh strawberry shortcake. It is heavenly. My mother and I usually make this with strawberries we picked ourselves. —Sarah Hatter, Brodhead, Wisconsin",
            "time": "Prep: 45 min. + chilling Bake: 15 min. + cooling",
            "makes": "6 servings",
            "ingredients": [
                "2-1/2 cups fresh strawberries, hulled, divided",
                "1 to 2 tablespoons maple syrup",
                "SHORTCAKES:",
                "2 cups whole wheat flour",
                "2-1/2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1/4 teaspoon baking soda",
                "1/2 cup cold butter, cubed",
                "1 large egg",
                "1/2 cup 2% milk",
                "1/4 cup honey",
                "Whipped cream"
            ],
            "directions": [
                "In a bowl, thoroughly mash 3/4 cup strawberries; stir in syrup. Cut remaining strawberries into 1/4-in. slices; add to crushed strawberries and toss to coat. Refrigerate, covered, 1 hour.",
                "Meanwhile, preheat oven to 400°. In a large bowl, whisk flour, baking powder, salt and baking soda. Cut in butter until mixture resembles coarse crumbs. In a small bowl, whisk egg, milk and honey until blended; stir into flour mixture just until moistened.",
                "Turn onto a lightly floured surface; knead gently 8-10 times. Pat or roll dough to 3/4-in. thickness; cut with a floured 2-1/2-in. biscuit cutter. Place 2 in. apart on parchment-lined baking sheets. Bake 12-15 minutes or until light brown. Remove to wire racks to cool slightly.",
                "To serve, split shortcakes in half. Fill with strawberry mixture and whipped cream. Top with additional whipped cream."
            ],
            "nutrition": "1 shortcake (calculated without whipped cream): 362 calories, 17g fat (10g saturated fat), 77mg cholesterol, 549mg sodium, 49g carbohydrate (18g sugars, 6g fiber), 8g protein."
        },
        {
            "name": "Strawberry Shortcake Dessert",
            "expert": "This recipe was given to me by a co-worker, and it gets rave reviews every time. I've tried it with other fruits, including blueberries, cherries, and peaches. All work out great. — Michele Trachier, Pasadena, Texas",
            "time": "Prep: 15 min. Bake: 30 min. + chilling",
            "makes": "20 servings",
            "ingredients": [
                "1 package  white cake mix (regular size)",
                "1-1/3 cups water",
                "1/4 cup unsweetened applesauce",
                "2 large egg whites, room temperature",
                "1 large egg, room temperature",
                "1 package (.6 ounce) sugar-free strawberry gelatin",
                "2 cups boiling water",
                "1 package (16 ounces) frozen unsweetened whole strawberries, thawed, drained and sliced",
                "1 carton (16 ounces) frozen reduced-fat whipped topping, thawed",
                "10 fresh strawberries, halved"
            ],
            "directions": [
                "In a large bowl, combine the cake mix, water, applesauce, egg whites and egg; beat on low speed for 30 seconds. Beat on medium for 2 minutes.",
                "Pour into a 13x9-in. baking dish coated with cooking spray. Bake at 350° for 30-35 minutes or until a toothpick inserted in the center comes out clean.",
                "In a large bowl, dissolve gelatin in boiling water. Stir in strawberries. Using a sharp knife, cut a diamond pattern across top of hot cake; immediately pour gelatin mixture over cake. Cool on a wire rack.",
                "Refrigerate for at least 6 hours. Spread with whipped topping. Garnish with fresh strawberries."
            ],
            "nutrition": "1 piece: 179 calories, 5g fat (3g saturated fat), 11mg cholesterol, 192mg sodium, 29g carbohydrate (16g sugars, 1g fiber), 2g protein."
        },
        {
            "name": "Strawberry Shortcake",
            "expert": "I grew up helping my mom make a lot in our farmhouse kitchen; strawberry shortcakes, roasts, soups and pies. This sunny strawberry shortcake recipe brings back memories of family summers on the farm. —Janet Becker, Anacortes, Washington",
            "time": "Prep: 25 min. Bake: 20 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "2/3 cup sugar",
                "1/4 cup shortening",
                "1 large egg, room temperature",
                "1 teaspoon vanilla extract",
                "1/4 teaspoon salt",
                "1-1/2 cups all-purpose flour",
                "2 teaspoons baking powder",
                "1/2 cup whole milk",
                "1 cup heavy whipping cream, whipped",
                "1-1/2 quarts fresh or frozen strawberries, sliced"
            ],
            "directions": [
                "In a bowl, cream sugar and shortening. Add egg and vanilla; beat well. Combine dry ingredients and add alternately with milk to the creamed mixture. Spread in a greased 9-in. square baking pan. Bake at 350° for 20-25 minutes. Cool on wire rack.",
                "Cut into nine servings. Split each serving horizontally and fill with whipped cream and strawberries. Replace top of cake; garnish with a dollop of whipped cream and more berries. Serve immediately."
            ],
            "nutrition": "1 piece: 231 calories, 7g fat (2g saturated fat), 22mg cholesterol, 188mg sodium, 39g carbohydrate (20g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Super Strawberry Shortcake",
            "expert": "\"Wow!\" is what people say when I set this dessert on the table. It's fun to serve since it's attractive, not overly sweet and bursting with the wondrous flavor of field-fresh strawberries.\r\n-Renee Bisch, Wellesley, Ontario",
            "time": "Prep: 20 min. Bake: 15 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "4 cups fresh strawberries, sliced",
                "2 tablespoons sugar",
                "SHORTCAKE:",
                "1-3/4 cups all-purpose flour",
                "2 tablespoons sugar",
                "1 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1/4 cup cold butter, cubed",
                "1 large egg, lightly beaten",
                "3/4 cup sour cream",
                "WHIPPED CREAM:",
                "1 cup heavy whipping cream",
                "2 tablespoons sugar",
                "1 teaspoon vanilla extract"
            ],
            "directions": [
                "Preheat oven to 425°. Toss strawberries with sugar; let stand, allowing juices from berries to release.",
                "For shortcake, whisk together flour, sugar, baking powder, baking soda and salt; cut in butter until mixture resembles coarse crumbs. In another bowl, whisk together egg and sour cream. Add to flour mixture; stir just until moistened.",
                "On a lightly floured surface, gently knead dough 8-10 times. Transfer to a lightly greased baking sheet; roll or pat to a 7-1/2-in. circle. Bake until golden brown, 13-17 minutes. Remove to a wire rack; cool completely.",
                "In a bowl, beat cream until it begins to thicken. Add sugar and vanilla; beat until stiff peaks form.",
                "Using a long serrated knife, cut shortcake horizontally in half. Spoon half the strawberries (including juices) over top; spread with half the whipped cream. Add top of shortcake; layer with the remaining whipped cream and berries."
            ],
            "nutrition": "1 slice: 368 calories, 22g fat (13g saturated fat), 78mg cholesterol, 358mg sodium, 38g carbohydrate (15g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Lemon-Berry Shortcake",
            "expert": "This simple lemon shortcake  is tender and not overly sweet. Enjoy this summertime classic with a generous layer of whipped topping and berries. —Meryl Herr, Overland Park, Kansas",
            "time": "Prep: 30 min. Bake: 20 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "1-1/3 cups all-purpose flour",
                "1/2 cup sugar",
                "2 teaspoons baking powder",
                "1/4 teaspoon salt",
                "1 large egg, room temperature",
                "2/3 cup buttermilk",
                "1/4 cup butter, melted",
                "1 teaspoon grated lemon zest",
                "1 tablespoon lemon juice",
                "1 teaspoon vanilla extract",
                "1 cup sliced fresh strawberries",
                "TOPPING:",
                "1 cup fresh blackberries",
                "1 cup sliced fresh strawberries",
                "1 tablespoon lemon juice",
                "1 teaspoon sugar",
                "2 cups reduced-fat whipped topping"
            ],
            "directions": [
                "Preheat oven to 350°. Grease and flour a 9-in. round baking pan.",
                "In a large bowl, whisk flour, sugar, baking powder and salt. In another bowl, whisk egg, buttermilk, melted butter, lemon zest, lemon juice and vanilla. Add to dry ingredients; stir just until moistened. Fold in 1 cup strawberries. Transfer to prepared pan.",
                "Bake 20-25 minutes or until a toothpick inserted in center comes out clean. Cool 10 minutes before removing from pan to a wire rack to cool completely.",
                "For topping, toss berries with lemon juice and sugar. To serve, spread whipped topping over cake. Top with berries."
            ],
            "nutrition": "1 slice: 252 calories, 9g fat (6g saturated fat), 42mg cholesterol, 245mg sodium, 40g carbohydrate (19g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Blackberry-Topped Sponge Cakes",
            "expert": "The recipe for my blackberry cakes is easy to play with. You can replace the sponge cake with angel food, pound cake or ladyfingers. And any fruit that has liquor with the same flavor can be used. —Karen Robinson, Woodbury, Connecticut",
            "time": "Prep/Total Time: 25 min.",
            "makes": "6 servings",
            "ingredients": [
                "6 individual round sponge cakes",
                "4 cups fresh blackberries",
                "1/4 cup blackberry brandy",
                "1-1/4 teaspoons sugar",
                "Whipped cream, optional"
            ],
            "directions": [
                "Place sponge cakes on serving plates. Top each with 3 blackberries. Place remaining blackberries in a food processor; process until pureed. Strain and discard seeds and pulp.",
                "Transfer puree to a small saucepan. Stir in brandy and sugar. Bring to a boil; cook until liquid is reduced by half, stirring occasionally. Pour over berries. If desired, top with whipped cream."
            ],
            "nutrition": "1 fruit-topped sponge cake (calulated without whipped cream): 141 calories, 2g fat (1g saturated fat), 28mg cholesterol, 181mg sodium, 26g carbohydrate (15g sugars, 5g fiber), 3g protein. Diabetic Exchanges:  1 starch, 1 fruit."
        },
        {
            "name": "Strawberry Shortcake Cups",
            "expert": "Back when store-bought shortcake was an unheard-of thing, my grandmother passed this mini strawberry shortcake recipe down to my mother. Mother later shared it with me, and I've since given it to my daughter. —Althea Heers, Jewell, Iowa",
            "time": "Prep: 15 min. Bake: 15 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "1 quart fresh strawberries",
                "4 tablespoons sugar, divided",
                "1-1/2 cups all-purpose flour",
                "1 tablespoon baking powder",
                "1/2 teaspoon salt",
                "1/4 cup cold butter, cubed",
                "1 large egg, room temperature",
                "1/2 cup whole milk",
                "Whipped cream"
            ],
            "directions": [
                "Mash or slice the strawberries; place in a large bowl. Add 2 tablespoons sugar and set aside. In another bowl, combine flour, baking powder, salt and remaining sugar; cut in butter until crumbly. In a small bowl, beat egg and milk; stir into flour mixture just until moistened.",
                "Fill 8 greased muffin cups two-thirds full. Bake at 425° until golden, about 12 minutes. Remove from the pan to cool on a wire rack.",
                "Just before serving, split shortcakes in half horizontally. Spoon berries and whipped cream between layers and over tops of shortcakes."
            ],
            "nutrition": "1 each: 200 calories, 7g fat (4g saturated fat), 44mg cholesterol, 372mg sodium, 30g carbohydrate (11g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Triple Berry Shortcake",
            "expert": "My great-great-grandmother handed down her shortcake recipe. I’m sharing it because it’s way too fabulous to keep it a secret! —Sara Kingsmore, Vadnais Heights, Minnesota",
            "time": "Prep: 25 min. Bake: 25 min. + cooling",
            "makes": "15 servings",
            "ingredients": [
                "1 cup butter, softened",
                "2 cups sugar",
                "4 large eggs, room temperature",
                "2 tablespoons vanilla extract",
                "3 cups all-purpose flour",
                "1 teaspoon baking powder",
                "1/2 teaspoon baking soda",
                "1/2 teaspoon salt",
                "1 cup buttermilk",
                "TOPPING:",
                "1-1/2 cups fresh blueberries",
                "1-1/2 cups sliced fresh strawberries",
                "1-1/2 cups fresh raspberries",
                "2 tablespoons sugar",
                "Sweetened whipped cream, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a large bowl, cream butter and sugar until light and fluffy. Add 1 egg at a time, beating well after each addition. Beat in vanilla. In another bowl, whisk flour, baking powder, baking soda and salt; add to creamed mixture alternately with buttermilk, beating well after each addition.",
                "Transfer batter to a greased 13x9-in. pan. Bake until a toothpick inserted in center comes out clean, 25-30 minutes. Cool completely in pan on a wire rack.",
                "For topping, in a large bowl, combine berries; add sugar and toss gently to coat. Serve with cake; top with whipped cream if desired."
            ],
            "nutrition": "1 serving: 361 calories, 14g fat (8g saturated fat), 83mg cholesterol, 301mg sodium, 54g carbohydrate (32g sugars, 2g fiber), 5g protein."
        },
        {
            "name": "Picnic Berry Shortcakes",
            "expert": "You can make the berry sauce ahead of time and chill it. Then assemble the entire dessert right before the picnic or party. —Frieda Bliesner, McAllen, Texas",
            "time": "Prep: 20 min. + chilling",
            "makes": "4 servings",
            "ingredients": [
                "2 tablespoons sugar",
                "1/2 teaspoon cornstarch",
                "2 tablespoons water",
                "2 cups sliced fresh strawberries, divided",
                "1/2 teaspoon grated lime zest",
                "2 individual round sponge cakes",
                "2 cups fresh blueberries",
                "Whipped topping, optional"
            ],
            "directions": [
                "In a small saucepan, mix sugar and cornstarch. Stir in water. Add 1 cup strawberries; mash mixture. Bring to a boil; cook and stir until thickened, 1-2 minutes. Remove from heat; stir in lime zest. Transfer to a small bowl; refrigerate, covered, until chilled.",
                "Cut sponge cakes crosswise in half; trim the cakes to fit in the bottoms of 4 wide-mouth half-pint canning jars. In a small bowl, mix blueberries and remaining strawberries; spoon over cakes. Top with sauce. If desired, serve with whipped topping."
            ],
            "nutrition": "1 serving: 124 calories, 1g fat (0 saturated fat), 10mg cholesterol, 67mg sodium, 29g carbohydrate (21g sugars, 3g fiber), 2g protein. Diabetic Exchanges:  1 starch, 1 fruit."
        },
        {
            "name": "Blueberry Shortcake",
            "expert": "Blueberries abound in Mary Damm’s sugar-topped shortcake. The East Peoria, Illinois cook enjoys it as dessert, but it’s also great for breakfast.",
            "time": "Prep: 15 min. Bake: 25 min.",
            "makes": "4 servings",
            "ingredients": [
                "4 tablespoons sugar, divided",
                "2 teaspoons all-purpose flour",
                "1/8 teaspoon ground cinnamon",
                "1 cup plus 2 tablespoons reduced-fat biscuit/baking mix",
                "1/3 cup fat-free milk",
                "1 cup fresh or frozen blueberries"
            ],
            "directions": [
                "In a small bowl, combine 2 tablespoons sugar, flour and cinnamon; set aside. In another bowl, combine the biscuit mix, milk and remaining sugar.",
                "Spread half of the batter into a 1-qt. baking dish coated with cooking spray; top with half of the blueberries and half of the reserved sugar mixture. Repeat layers.",
                "Bake at 350° for 25-30 minutes or until a toothpick inserted in the center comes out clean. Serve warm if desired, or cool on a wire rack."
            ],
            "nutrition": "1 piece: 209 calories, 2g fat (0 saturated fat), 0 cholesterol, 403mg sodium, 44g carbohydrate (18g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Homemade Strawberry Shortcake",
            "expert": "It seems I can never get enough of Grandma's shortcake! This recipe is special to me and it's the first thing I bake when my strawberries ripen in spring.",
            "time": "Prep/Total Time: 30 min.",
            "makes": "9 servings",
            "ingredients": [
                "2 cups all-purpose flour",
                "2 tablespoons sugar",
                "4 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1/2 teaspoon cream of tartar",
                "1/2 cup butter, softened",
                "1 large egg, beaten",
                "2/3 cup fat-free milk",
                "2 pints strawberries, sliced",
                "Whipped cream, optional"
            ],
            "directions": [
                "In a bowl, combine flour, sugar, baking powder, salt and cream of tartar. Cut in butter until mixture is the size of peas. Add the egg and milk; mix well. Spread into a greased 8-in. square baking pan. Bake at 375° for 20-25 minutes. Cut into squares and top with strawberries and whipped cream if desired."
            ],
            "nutrition": ""
        },
        {
            "name": "Best Strawberry Shortcake",
            "expert": "For a dazzling summer dessert, you can’t beat juicy strawberries and fresh whipped cream over homemade shortcake. My father added even more indulgence to this recipe by buttering the shortcake. This is the best strawberry shortcake recipe. —Shirley Joan Helfenbein, Lapeer, Michigan.",
            "time": "Prep: 15 min. Bake: 15 min. + cooling",
            "makes": "4 servings",
            "ingredients": [
                "1 cup all-purpose flour",
                "1 tablespoon sugar",
                "1-1/2 teaspoons baking powder",
                "1/4 teaspoon salt",
                "1/4 cup plus 2 teaspoons cold butter, divided",
                "1 large egg, room temperature",
                "1/3 cup half-and-half cream",
                "1/2 cup heavy whipping cream",
                "1 tablespoon confectioners' sugar",
                "1/8 teaspoon vanilla extract",
                "2 cups fresh strawberries, sliced"
            ],
            "directions": [
                "In a small bowl, combine the flour, sugar, baking powder and salt. Cut in 1/4 cup butter until mixture resembles coarse crumbs. In a small bowl, combine egg and half-and-half; stir into crumb mixture just until moistened.",
                "Spread batter into a 6-in. round baking pan coated with cooking spray, slightly building up the edges. Bake at 450° until golden, 13-15 minutes. Cool for 10 minutes before removing from pan to a wire rack.",
                "In a small bowl, beat whipping cream, confectioners' sugar and vanilla until soft peaks form. Cut cake horizontally in half. Soften remaining butter. Place bottom layer on a serving plate; spread with butter. Top with half of strawberries and cream mixture. Repeat layers of cake, strawberries and cream."
            ],
            "nutrition": "1 piece: 420 calories, 28g fat (17g saturated fat), 140mg cholesterol, 471mg sodium, 36g carbohydrate (10g sugars, 2g fiber), 7g protein."
        },
        {
            "name": "Grandma’s Old-Fashioned Strawberry Shortcake",
            "expert": "When my grandma served this shortcake, she usually topped it with homemade vanilla ice cream. —Angela Lively, Conroe, Texas",
            "time": "Prep: 30 min. + standing Bake: 20 min. + cooling",
            "makes": "8 servings",
            "ingredients": [
                "6 cups sliced fresh strawberries",
                "1/2 cup sugar",
                "1 teaspoon vanilla extract",
                "SHORTCAKE:",
                "3 cups all-purpose flour",
                "5 tablespoons sugar, divided",
                "3 teaspoons baking powder",
                "1 teaspoon baking soda",
                "1/2 teaspoon salt",
                "3/4 cup cold butter, cubed",
                "1-1/4 cups buttermilk",
                "2 tablespoons heavy whipping cream",
                "TOPPING:",
                "1-1/2 cups heavy whipping cream",
                "2 tablespoons sugar",
                "1/2 teaspoon vanilla extract"
            ],
            "directions": [
                "Combine strawberries with sugar and vanilla; mash slightly. Let stand at least 30 minutes, tossing occasionally.",
                "Preheat oven to 400°. For shortcakes, whisk together flour, 4 tablespoons sugar, baking powder, baking soda and salt. Cut in butter until crumbly. Add buttermilk; stir just until combined (do not overmix). Drop batter by 1/3 cupfuls 2 in. apart onto an ungreased baking sheet. Brush with 2 tablespoons heavy cream; sprinkle with remaining 1 tablespoon sugar. Bake until golden, 18-20 minutes. Remove to wire racks to cool completely.",
                "For topping, beat heavy whipping cream until it begins to thicken. Add sugar and vanilla; beat until soft peaks form. To serve, cut shortcakes in half; top with strawberries and whipped cream."
            ],
            "nutrition": "1 shortcake with 1/2 cup strawberries and 1/3 cup whipped cream: 638 calories, 36g fat (22g saturated fat), 102mg cholesterol, 710mg sodium, 72g carbohydrate (33g sugars, 4g fiber), 9g protein."
        },
        {
            "name": "Mixed Berry Shortcake",
            "expert": "This strawberry blueberry shortcake recipe looks so pretty served in parfait glasses. Sweet berries and a cool custard sauce are layered between tender cubes of homemade shortcake. —Taste of Home Test Kitchen",
            "time": "Prep: 25 min. Bake: 15 min.",
            "makes": "8 servings",
            "ingredients": [
                "1/2 cup plus 1/3 cup sugar, divided",
                "3 tablespoons cornstarch",
                "2-3/4 cups fat-free milk",
                "2 egg yolks, lightly beaten",
                "1 teaspoon vanilla extract",
                "2 cups all-purpose flour",
                "1 teaspoon baking powder",
                "1/4 teaspoon baking soda",
                "1/4 teaspoon salt",
                "6 tablespoons cold butter",
                "2/3 cup buttermilk",
                "4 cups sliced fresh strawberries",
                "4 cups fresh blueberries",
                "8 whole strawberries, halved",
                "1/2 cup reduced-fat whipped topping"
            ],
            "directions": [
                "In a heavy saucepan, combine 1/2 cup sugar and cornstarch. Stir in milk until blended. Bring to a boil over medium-low heat; cook and stir for 1-2 minutes or until thickened. Remove from the heat. Stir a small amount into egg yolks; return all to the pan, stirring constantly. Remove from the heat; stir in vanilla. transfer to a bowl; press a piece of plastic wrap on top of custard. Refrigerate.",
                "In a bowl, combine the flour, baking powder, baking soda, salt and remaining sugar. Cut in butter until mixture resembles coarse crumbs. Stir in buttermilk until a soft dough forms. Pat gently into a 9-in. square baking pan coated with cooking spray. Bake at 400° for 15-20 minutes or until lightly browned. Cool on a wire rack.",
                "Cut shortcake into 3/4-in. cubes. In parfait glasses, alternate layers of shortcake, custard, sliced strawberries and blueberries. Garnish with halved strawberries and a dollop of whipped topping."
            ],
            "nutrition": "1 serving: 382 calories, 12g fat (6g saturated fat), 77mg cholesterol, 290mg sodium, 66g carbohydrate, 5g fiber), 6g protein."
        },
        {
            "name": "Upside-Down Strawberry Shortcake",
            "expert": "For a tasty twist, this special shortcake has a berry layer on the bottom. The tempting strawberry upside-down cake is a sweet that our family has savored for years. —Debra Falkiner, St. Charles, Missouri",
            "time": "Prep: 20 min. Bake: 45 min.",
            "makes": "15 servings",
            "ingredients": [
                "1 cup miniature marshmallows",
                "1 package (16 ounces) frozen sweetened sliced strawberries, thawed",
                "1 package (3 ounces) strawberry gelatin",
                "1/2 cup shortening",
                "1-1/2 cups sugar",
                "3 large eggs, room temperature",
                "1 teaspoon vanilla extract",
                "2-1/4 cups all-purpose flour",
                "3 teaspoons baking powder",
                "1/2 teaspoon salt",
                "1 cup 2% milk",
                "Fresh strawberries and whipped cream"
            ],
            "directions": [
                "Preheat oven 350°. Sprinkle marshmallows evenly into a greased 13x9-in. baking dish; set aside. In a small bowl, combine strawberries and gelatin powder; set aside.",
                "In a large bowl, cream shortening and sugar until light and fluffy, 5-7 minutes. Add eggs, 1 at a time, beating well after each addition. Beat in vanilla. Combine the flour, baking powder and salt; add to creamed mixture alternately with milk, beating well after each addition.",
                "Pour batter over the marshmallows. Spoon strawberry mixture evenly over batter. Bake until a toothpick inserted in the center comes out clean, 45-50 minutes. Cool 10 minutes before removing from pan to a wire rack to cool completely. Invert onto a serving platter (strawberry layer will be on bottom). Garnish with strawberries and whipped cream."
            ],
            "nutrition": "1 piece: 288 calories, 8g fat (2g saturated fat), 39mg cholesterol, 214mg sodium, 51g carbohydrate (35g sugars, 1g fiber), 4g protein."
        },
        {
            "name": "Shortcake with Fresh Rhubarb Sauce",
            "expert": "Every spring when her rhubarb was ready, my mother-in-law chopped it up for this moist cake. If your rhubarb is too tart for the sauce, just add in some strawberries. —Rena McCalment, Sharpsville, Indiana",
            "time": "Prep: 30 min. Bake: 30 min.",
            "makes": "9 servings (2-1/4 cups sauce)",
            "ingredients": [
                "1-1/2 cups chopped fresh rhubarb",
                "1/4 cup shortening",
                "3/4 cup sugar",
                "1 large egg",
                "1-1/4 cups all-purpose flour",
                "3/4 teaspoon baking powder",
                "1/4 teaspoon salt",
                "1/4 teaspoon baking soda",
                "1/4 teaspoon ground cinnamon",
                "1/2 cup 2% milk",
                "1/4 cup chopped walnuts or  pecans",
                "SAUCE:",
                "3/4 to 1 cup sugar",
                "1/2 cup water",
                "4 cups cubed fresh rhubarb (1-inch)",
                "Dash ground cinnamon, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Grease an 8-in. square baking pan. In a heatproof bowl, cover rhubarb with boiling water; let stand 5 minutes. Drain and pat dry.",
                "Meanwhile, in a bowl, cream shortening and sugar until blended. Beat in egg. In another bowl, whisk flour, baking powder, salt, baking soda and cinnamon; add to creamed mixture alternately with milk, beating well after each addition. Fold in drained rhubarb and walnuts. Transfer to prepared pan; bake 30-35 minutes or until a toothpick inserted in center comes out clean. Cool in pan on a wire rack.",
                "In a small saucepan over medium-high heat, combine sugar and water; bring to a boil, stirring to dissolve sugar. Stir in rhubarb; return to a boil. Reduce heat; simmer, uncovered, 10-12 minutes or until rhubarb is softened. If desired, stir in cinnamon. Serve over warm shortcake."
            ],
            "nutrition": "1 piece with 1/4 cup sauce: 294 calories, 9g fat (2g saturated fat), 22mg cholesterol, 152mg sodium, 51g carbohydrate (35g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Mom’s Strawberry Shortcake",
            "expert": "When I was growing up, Mom sometimes experimented with different dessert recipes, but this tried-and-true spongy shortcake was always great just the way it was. It melted in my mouth!\r\n-Karen Wingate, Coldwater, Kansas",
            "time": "Prep: 20 min. Bake: 25 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "2 eggs",
                "1-1/2 cup sugar, divided",
                "1 cup all-purpose flour",
                "1 teaspoon baking powder",
                "1/4 teaspoon salt",
                "1/2 cup 2% milk",
                "1 tablespoon butter",
                "1 teaspoon vanilla extract",
                "1 to 1-1/2 quarts fresh strawberries, sliced",
                "Sweetened whipped cream",
                "Mint leaves, optional"
            ],
            "directions": [
                "Preheat oven to 350°. Grease an 8-in. square baking pan. In a large bowl, beat eggs on medium speed 3 minutes. Gradually add 1 cup sugar, beating until thick and lemon-colored. In another bowl, whisk flour, baking powder and salt; beat into egg mixture. In a small saucepan, heat milk and butter just until butter begins to melt. Beat into batter with vanilla (batter will be thin).",
                "Transfer batter to prepared pan. Bake 25-30 minutes or until a toothpick inserted in center comes out clean. Cool in pan 10 minutes before removing to a wire rack to cool completely.",
                "Just before serving, cut cake into serving-size pieces; cut each slice horizontally in half. In a large bowl, combine strawberries and remaining sugar; spoon between cake layers and over top of each serving. Top with whipped cream and, if desired, mint leaves."
            ],
            "nutrition": "1 serving (calculated without whipped cream): 236 calories, 3g fat (1g saturated fat), 52mg cholesterol, 145mg sodium, 49g carbohydrate (36g sugars, 2g fiber), 4g protein."
        },
        {
            "name": "Mixed Fruit Shortcakes",
            "expert": "This delightful downsized recipe makes just two biscuitlike shortcakes. Fill them with fresh fruit of your choice and top with whipped cream for an impressive dinner finale. —Sue Ross, Casa Grande, Arizona",
            "time": "Prep/Total Time: 30 min.",
            "makes": "2 servings",
            "ingredients": [
                "1 cup mixed fresh berries",
                "1/2 cup sliced fresh peaches or nectarines",
                "4 teaspoons sugar, divided",
                "1/2 cup all-purpose flour",
                "3/4 teaspoon baking powder",
                "1/8 teaspoon salt",
                "2 tablespoons shortening",
                "3 tablespoons 2% milk",
                "Whipped cream"
            ],
            "directions": [
                "In a small bowl, combine the berries, peaches and 2 teaspoons sugar. In another bowl, combine the flour, baking powder and salt; cut in shortening until mixture is crumbly. Stir in milk just until moistened. Drop by lightly packed 1/3 cupfuls 2 in. apart onto an ungreased baking sheet. Gently flatten into 2-1/2-in. circles. Sprinkle with remaining sugar.",
                "Bake at 425° for 10-12 minutes or until golden brown. Remove to a wire rack to cool. Split shortcakes in half horizontally. Spoon fruit onto bottoms; spread whipped cream over fruit or on the shortcake tops."
            ],
            "nutrition": "1 shortcake: 329 calories, 13g fat (3g saturated fat), 2mg cholesterol, 311mg sodium, 48g carbohydrate (20g sugars, 5g fiber), 5g protein."
        },
        {
            "name": "Ginger-Peach Shortcake",
            "expert": "There's nothing better than fresh summer produce, except maybe when it's used to make this peach shortcake. It's quick and easy to throw together for a fast summer dessert. &mdash;Taste of Home Test Kitchen",
            "time": "Prep: 25 min. + chilling Bake: 20 min. + cooling",
            "makes": "9 servings",
            "ingredients": [
                "5 medium peaches, peeled and sliced",
                "1/4 cup sugar",
                "TOPPING:",
                "1/4 cup all-purpose flour",
                "3 tablespoons brown sugar",
                "2 tablespoons cold butter",
                "2 tablespoons chopped crystallized ginger, optional",
                "SHORTCAKE:",
                "2 cups all-purpose flour",
                "2 tablespoons sugar",
                "3 teaspoons baking powder",
                "1/4 teaspoon salt",
                "1/2 cup cold butter",
                "1 egg",
                "3/4 cup milk",
                "1 teaspoon vanilla extract",
                "1 cup heavy whipping cream",
                "2 tablespoons confectioners' sugar"
            ],
            "directions": [
                "In a small bowl, combine peach slices and 1/4 cup sugar; cover and refrigerate. Line a greased 9-in. square baking pan with waxed paper; set aside. For topping, combine flour and brown sugar in a small bowl; cut in butter until mixture is crumbly. Stir in ginger if desired; set aside.",
                "For shortcake, combine the flour, sugar, baking powder and salt in a large bowl; cut in butter until crumbly. In a small bowl, whisk together the egg, milk and vanilla; stir into crumb mixture just until moistened. Spread in prepared pan. Sprinkle with reserved topping.",
                "Bake at 400° for 20-25 minutes or until a toothpick inserted near the center comes out clean. Cool for 10 minutes before removing from pan. Gently peel off waxed paper. Cool crumb side up on a wire rack. Serve warm or at room temperature.",
                "Just before serving, beat cream in a small mixing bowl until it begins to thicken. Add confectioners’ sugar; beat until soft peaks form. Cut cake into nine squares. Split each square horizontally. Place bottom half on serving plate; top with 1/4 cup peach slices. Top with top of shortcake, peaches and whipped cream."
            ],
            "nutrition": ""
        }
    ]
}