{
    "category": "Sponge Cakes",
    "recipes": [
        {
            "name": "Traditional Sponge Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Traditional-Sponge-Cake_EXPS_FT21_18657_F_0528_1.jpg?fit=700,1024",
            "expert": "This light sponge cake makes a fitting finale to any meal.—Arlene Murphy, Beverly Hills, Florida",
            "time": "Prep: 15 min. Bake: 55 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large eggs, separated",
                "1-1/2 cups all-purpose flour",
                "1/2 teaspoon salt",
                "1-1/2 cups sugar, divided",
                "1/2 cup warm water",
                "1 teaspoon vanilla extract",
                "1/2 teaspoon cream of tartar",
                "Chocolate ice cream topping, optional"
            ],
            "directions": [
                "Preheat oven to 325°. Let eggs stand at room temperature for 30 minutes. Sift flour and salt.",
                "In a large bowl, beat yolks until slightly thickened. Gradually add 1 cup sugar, beating until thick and lemon-colored. Blend in water and vanilla. Add dry ingredients to yolk mixture; mix well.",
                "In another bowl, beat egg whites and cream of tartar on medium speed until soft peaks form. Gradually beat in remaining sugar, about 1 tablespoon at a time, on high until stiff glossy peaks form and sugar is dissolved. Fold a fourth of egg whites into the batter, then fold in remaining whites.",
                "Gently spoon into an ungreased 10-in. tube pan. Cut through batter with a knife to remove air pockets. Bake on the lowest oven rack until cake springs back when lightly touched, 55-60 minutes. Immediately invert the pan; cool completely.",
                "Run a knife around side and center tube of pan. Remove cake to a serving plate. If desired, serve with ice cream topping."
            ],
            "nutrition": "1 piece: 191 calories, 3g fat (1g saturated fat), 93mg cholesterol, 134mg sodium, 37g carbohydrate (25g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Hungarian Walnut Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps21557_TH10387D44.jpg",
            "expert": "\"This truly special cake with its creamy not-too-sweet filling is one I've made for years. People say it is excellent,\" notes Jeannette Jeremias of Kitchener, Ontario. \"I'm the first generation of my Hungarian family to be born in Canada.\"",
            "time": "Prep: 35 min. + chilling Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large eggs, separated",
                "1 cup sugar",
                "1 teaspoon vanilla extract",
                "1 cup cake flour",
                "1 teaspoon baking powder",
                "5 tablespoons water",
                "1/2 cup ground walnuts",
                "FILLING:",
                "1-1/4 cups whole milk",
                "1 package (3.4 ounces) cook-and-serve chocolate pudding mix",
                "1/2 cup butter, softened",
                "1/2 cup shortening",
                "1 cup confectioners' sugar",
                "1 teaspoon vanilla extract",
                "White and dark chocolate curls, optional"
            ],
            "directions": [
                "Let eggs stand at room temperature for 30 minutes. In a large bowl, beat egg yolks and sugar for 10 minutes or until light lemon-colored. Beat in vanilla. Combine cake flour and baking powder; add to egg mixture alternately with water, beating well. Fold in walnuts.",
                "In another bowl and with clean beaters, beat the egg whites on high until stiff peaks form. Fold a fourth of the egg whites into batter; fold in remaining whites.",
                "Pour into two greased and floured 9-in. round baking pans. Bake at 350° for 20-25 minutes or until a toothpick inserted in the center comes out clean. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a small saucepan, whisk the milk and pudding mix. Bring to a boil, stirring constantly. Remove from the heat. Pour into a bowl; press a piece of waxed paper or plastic wrap over pudding. Refrigerate for 30 minutes.",
                "In a bowl, cream the butter, shortening and confectioners' sugar until light and fluffy. Beat in vanilla and cooled pudding. Split each cake into two layers. Place one bottom layer on a serving plate; spread with about 3/4 cup filling. Repeat layers. Garnish with chocolate curls if desired."
            ],
            "nutrition": "1 piece: 390 calories, 21g fat (8g saturated fat), 130mg cholesterol, 190mg sodium, 45g carbohydrate (32g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Tres Leches Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps36995_LT1115459D34-6.jpg",
            "expert": "Finish off a fiesta with a piece of this moist and refreshing cake from Anna Yeatts of Pinehurst, North Carolina. Though it’s been lightened, the sweet flavors of this traditional Mexican dessert aren’t lost, making it the perfect end to any meal.",
            "time": "Prep: 35 min. Bake: 20 min. + chilling",
            "makes": "15 servings",
            "ingredients": [
                "5 eggs",
                "1 cup sugar, divided",
                "1 tablespoon butter, softened",
                "1/3 cup fat-free milk",
                "1 teaspoon vanilla extract",
                "1 cup all-purpose flour",
                "1 teaspoon baking powder",
                "MILK SYRUP:",
                "1 can (14 ounces) fat-free sweetened condensed milk",
                "1 can (12 ounces) fat-free evaporated milk",
                "1 cup fat-free half-and-half",
                "3 teaspoons vanilla extract",
                "15 tablespoons frozen reduced-fat whipped topping",
                "15 fresh strawberries"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Coat a 13-in. x 9-in. baking dish with cooking spray and dust with flour; set aside.",
                "In a large bowl, beat egg yolks on high speed for 5 minutes or until thick and lemon-colored. Gradually beat in 3/4 cup sugar and butter. Stir in milk and vanilla. Sift flour and baking powder; gradually add to yolk mixture and mix well (batter will be thick).",
                "With clean beaters, beat egg whites on medium speed until soft peaks form. Gradually beat in remaining sugar, 1 tablespoon at a time, on high until stiff peaks form. Gradually fold into batter.",
                "Spread evenly into prepared dish. Bake at 350° for 18-22 minutes or until cake springs back when lightly touched. Place on a wire rack.",
                "In a large saucepan, combine the condensed milk, evaporated milk and half-and-half. Bring to a boil over medium heat, stirring constantly; cook and stir for 2 minutes. Remove from the heat; stir in vanilla. Cool slightly.",
                "Cut cake into 15 pieces, leaving cake in the baking dish. Poke holes in cake with a skewer. Slowly pour a third of the milk syrup over cake, allowing syrup to absorb into the cake. Repeat twice. Let stand for 30 minutes.",
                "Cover and refrigerate for 2 hours before serving. Top each piece with whipped topping and a strawberry."
            ],
            "nutrition": "1 piece: 233 calories, 3g fat (2g saturated fat), 76mg cholesterol, 126mg sodium, 42g carbohydrate (34g sugars, 1g fiber), 8g protein."
        },
        {
            "name": "Sunshine Sponge Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps9021_BB2831C55-1.jpg",
            "expert": "This is one of my favorite cakes to make. I prepare it for company or a bake sales and it is a hit every time!—Helen Woronik, Salem, Connecticut",
            "time": "Prep: 25 min. Bake: 45 min.",
            "makes": "14 servings",
            "ingredients": [
                "9 eggs, separated",
                "1/4 cup water",
                "1 tablespoon minced fresh lemon verbena leaves",
                "1 teaspoon vanilla extract",
                "1-1/2 cups sugar, divided",
                "1-1/4 cups all-purpose flour",
                "1/2 teaspoon baking powder",
                "1 teaspoon cream of tartar",
                "1/2 teaspoon salt",
                "LEMON BUTTER FROSTING:",
                "4-1/2 cups confectioners' sugar",
                "1/3 cup butter, softened",
                "1/4 cup lemon juice",
                "1 teaspoon vanilla extract",
                "1/4 teaspoon lemon extract",
                "Daisies and additional lemon verbena leaves, optional"
            ],
            "directions": [
                "Preheat oven to 350°. In a bowl, beat the egg yolks on high until thickened and lemon-colored. Add water, lemon verbena and vanilla. Gradually beat in 1 cup sugar. beat for 4-5 minutes or until mixture doubles in volume. Combine flour and baking powder; sprinkle 1/4 cupful over batter and fold in until combined. Repeat with remaining flour mixture; set aside.",
                "In another bowl, beat the egg whites, cream of tartar and salt until soft peaks form. Add remaining sugar, 1 tablespoon at a time, beating until stiff peaks form. Gently fold into batter. Pour into an ungreased 10-in. tube pan. Bake until top springs back when lightly touched, 45-50 minutes. Immediately invert the pan; cool completely. Run a knife around sides of pan and remove cake to a serving plate.",
                "In a bowl, cream 2 cups sugar, butter, lemon juice and extracts. Slowly add remaining sugar. If needed, beat in a small amount of water until the frosting reaches desired spreading consistency. Frost cake. Garnish with daisies and lemon verbena if desired."
            ],
            "nutrition": "1 slice: 363 calories, 8g fat (4g saturated fat), 148mg cholesterol, 184mg sodium, 69g carbohydrate (57g sugars, 0 fiber), 5g protein."
        },
        {
            "name": "Apricot Hazelnut Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps14080_TH10145C27C.jpg",
            "expert": "Husband Gerry and I, married 36 years, love it when our children and grandchildren visit. One cake that gets \"oohs\" and \"aahs\" from the family every time is this luscious torte. It's as light as a feather and tastes heavenly. Plus, it looks so beautiful, it's perfect for special occasions.",
            "time": "Prep: 20 min. Bake: 20 min. + cooling",
            "makes": "12-14 servings",
            "ingredients": [
                "4 eggs, separated",
                "1 cup ground hazelnuts",
                "3/4 cup all-purpose flour",
                "2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "2 tablespoons water",
                "1 teaspoon vanilla extract",
                "1 cup sugar, divided",
                "2 cups heavy whipping cream",
                "1/4 cup confectioners' sugar",
                "2/3 cup pureed canned apricots",
                "1/2 cup apricot jam, warmed",
                "Whipped cream, sliced apricots and whole or chopped hazelnuts, optional"
            ],
            "directions": [
                "Let eggs stand at room temperature for 30 minutes. Line two greased 9-in. round baking pans with waxed paper; grease the paper and set aside.",
                "In a bowl, combine the hazelnuts, flour, baking powder and salt; set aside. In a large bowl, beat the egg yolks, water and vanilla until lemon-colored. Gradually add 3/4 cup sugar; set aside.",
                "In a small bowl with clean beater, beat egg whites on medium speed until soft peaks form. Gradually add remaining sugar, 1 tablespoon at a time, beating on high until stiff peaks form. Fold a fourth of the dry ingredients into egg yolk mixture. Repeat three times. Fold in egg white mixture.",
                "Spread batter evenly into prepared pans. Bake at 350° for 20-25 minutes or until cake springs back when lightly touched. Cool for 10 minutes before removing from pans to wire racks to cool completely.",
                "In a chilled large bowl, beat cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Fold in apricots.",
                "Split each cake into two horizontal layers. Spread filling between layers and over sides of torte. Spread jam over top. Garnish with whipped cream, apricots and hazelnuts if desired. Store in refrigerator."
            ],
            "nutrition": ""
        },
        {
            "name": "Daffodil Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps22746_RM10454D48A-1.jpg",
            "expert": "I've made this cake for my children(see photo below), grandchildren and great-grandchildren. It is their favorite birthday cake...it's light and tasty, and lends itself beautifully to decorating. I often place a small arrangement of fresh flowers in the center.",
            "time": "Prep: 45 min. Bake: 35 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large egg whites",
                "1/2 teaspoon cream of tartar",
                "1/2 teaspoon vanilla extract",
                "2/3 cup sugar",
                "1/2 cup cake flour",
                "1/2 teaspoon baking powder",
                "1/2 teaspoon salt",
                "YELLOW CAKE:",
                "6 large egg yolks",
                "2 tablespoons warm water",
                "1/2 cup cake flour",
                "1/2 cup sugar",
                "1 teaspoon baking powder",
                "1/8 teaspoon salt",
                "1/2 teaspoon vanilla extract",
                "FROSTING:",
                "1/2 cup sugar",
                "4 teaspoons all-purpose flour",
                "Pinch salt",
                "1 cup pineapple juice",
                "1 carton (8 ounces) frozen whipped topping, thawed"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Add cream of tartar and vanilla; beat on medium speed until foamy. Gradually beat in sugar, 1 tablespoon at a time, until soft peaks form. Combine the flour, baking powder and salt; fold into egg white mixture. Set aside.",
                "In another large bowl, beat egg yolks and water until thick and lemon-colored. Combine the flour, sugar, baking powder and salt; gradually beat into egg yolk mixture. Beat in vanilla.",
                "Alternately spoon yellow batter and white batter into an ungreased 10-in. tube pan. Bake at 350° for 35-40 minutes or until a toothpick inserted in the center comes out clean. Immediately invert pan; cool completely.",
                "For frosting, combine the sugar, flour and salt in a small saucepan. Stir in pineapple juice until blended. Bring to a boil; cook and stir for 2 minutes or until thickened. Cool. Fold in whipped topping.",
                "Remove cake from pan to a serving plate. Spread frosting over top and sides of cake. Store in the refrigerator."
            ],
            "nutrition": "1 slice: 255 calories, 6g fat (4g saturated fat), 106mg cholesterol, 217mg sodium, 45g carbohydrate (32g sugars, 0 fiber), 4g protein."
        },
        {
            "name": "Butterscotch Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps14585_TH10170C31B-1.jpg",
            "expert": "It's best to make the graham cracker cake for this torte the day before, because the flavor improves as it mellows. The recipe makes plenty of yummy butterscotch sauce, so you can drizzle some over the top and have extra to serve on the side.                                          —Lavonne Hartel\r\n                                                         Williston. North Dakota",
            "time": "Prep: 40 min. Bake: 20 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 eggs, separated",
                "1-1/2 cups sugar",
                "2 teaspoons vanilla extract",
                "2 cups graham cracker crumbs",
                "1 cup finely chopped nuts",
                "1 teaspoon baking powder",
                "TOPPING:",
                "1 cup packed brown sugar",
                "1 tablespoon all-purpose flour",
                "Dash salt",
                "1/4 cup orange juice",
                "2 tablespoons water",
                "1 egg, lightly beaten",
                "1/4 cup butter, cubed",
                "1 teaspoon vanilla extract",
                "FILLING:",
                "2 cups heavy whipping cream",
                "1/4 cup confectioners' sugar"
            ],
            "directions": [
                "Line three greased 9-in. round baking pans with waxed paper and grease the paper; set aside. Let egg whites stand at room temperature for 30 minutes.",
                "In a large bowl, beat yolks until slightly thickened. Gradually add sugar, beating until thick and lemon-colored. Beat in the vanilla. Combine the cracker crumbs, nuts and baking powder; fold into egg yolk mixture.",
                "In another bowl, beat egg whites on medium speed until soft peaks form. Fold a fourth of egg whites into the batter, then fold in remaining whites.",
                "Pour into prepared pans. Bake at 325° for 20-25 minutes or cake springs back when lightly touched. Cool for 10 minutes before removing from pans to wire racks.",
                "For topping, in a large saucepan, combine the brown sugar, flour and salt. Stir in orange juice and water until smooth; bring to a boil. Reduce heat; cook and stir for 2 minutes or until slightly thickened. Stir a small amount of hot filling into egg; return all to pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer. Remove from the heat. Gently stir in butter and vanilla. Cool to room temperature without stirring.",
                "In a large bowl, beat cream until soft peaks form. Beat in confectioners' sugar until stiff peaks form.",
                "Place one cake layer on a serving plate; spread with a third of the whipped cream. Repeat layers twice. Drizzle some of the topping over cake. Serve remaining topping with cake. Refrigerate leftovers."
            ],
            "nutrition": "1 slice: 519 calories, 29g fat (13g saturated fat), 189mg cholesterol, 228mg sodium, 60g carbohydrate (49g sugars, 1g fiber), 8g protein."
        },
        {
            "name": "Coconut-Mango Malva Pudding",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2021/04/Coconut-Mango-Malva-Pudding_EXPS_TOHEDSCODR21_220776_E03_30_5b.jpg?fit=700,1024",
            "expert": "My friend shared this amazing malva pudding recipe with me. Malva pudding is a dense, spongy cake drenched in a rich, sticky butter sauce. My slow-cooker, tropical spin incorporates a creamy coconut sauce and juicy mangoes! —Carmell Childs, Orangeville, Utah",
            "time": "Prep: 20 min. Cook: 2-1/2 hours + standing",
            "makes": "12 servings",
            "ingredients": [
                "4 large eggs, room temperature",
                "1-1/2 cups sugar",
                "1/4 cup apricot preserves",
                "2 tablespoons butter, melted",
                "1 can (13.66 ounces) coconut milk",
                "2 teaspoons vanilla extract",
                "2 teaspoons white vinegar",
                "2 cups all-purpose flour",
                "1-1/4 teaspoons baking soda",
                "1 teaspoon salt",
                "SAUCE:",
                "1 cup canned coconut milk",
                "1/2 cup butter, melted",
                "1/2 cup sugar",
                "2 tablespoons apricot preserves",
                "1/2 teaspoon coconut extract",
                "2 medium mangoes, peeled and chopped",
                "1/4 cup sweetened shredded coconut, toasted",
                "1 container (8 ounces) frozen whipped topping, thawed"
            ],
            "directions": [
                "In large bowl, beat eggs, sugar, apricot preserves and butter until combined. Add coconut milk, vanilla and vinegar; stir to combine (batter will be thin). In another bowl, whisk flour, baking soda and salt. Gradually stir flour mixture into batter just until moistened. Transfer to a greased 5-qt. slow cooker. Cook, covered, on high until a toothpick inserted in cake comes out with moist crumbs, 2-1/2 to 3 hours.",
                "Meanwhile, for sauce, whisk together coconut milk, butter, sugar, apricot preserves and extract until smooth. Poke holes in warm cake with a skewer or chopstick. Pour mixture evenly over pudding; let stand to allow pudding to absorb sauce, 15-20 minutes. Serve with chopped mango, coconut and a dollop of whipped topping."
            ],
            "nutrition": "1 piece: 518 calories, 24g fat (19g saturated fat), 87mg cholesterol, 452mg sodium, 71g carbohydrate (52g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Strawberry Walnut Torte",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps166063_TH2379807D_10_22_7b_RMS.jpg?fit=700,1024",
            "expert": "This is a special treat I love to make and everyone looks forward to a nice slice with lots of fresh berries. —Bonnie Malloy, Norwood, Pennsylvania",
            "time": "Prep: 30 min. Bake: 25 min. + cooling",
            "makes": "16 servings",
            "ingredients": [
                "3/4 cup chopped walnuts, toasted and cooled",
                "1/4 cup plus 1-1/4 cups sugar, divided",
                "1-1/2 cups heavy whipping cream",
                "3 large eggs",
                "3 teaspoons vanilla extract",
                "1-3/4 cups all-purpose flour",
                "2 teaspoons baking powder",
                "1/2 teaspoon salt",
                "FROSTING:",
                "1-1/2 cups heavy whipping cream",
                "1 package (8 ounces) cream cheese, softened",
                "1 cup sugar",
                "1 teaspoon vanilla extract",
                "1/8 teaspoon salt",
                "1 jar (12 ounces) strawberry preserves, divided",
                "4 cups halved fresh strawberries"
            ],
            "directions": [
                "Preheat oven to 350°. Line bottoms of 2 greased 9-in. round baking pans with parchment; grease paper.",
                "Place walnuts and 1/4 cup sugar in a food processor; pulse until nuts are ground. In a small bowl, beat cream until stiff peaks form. Set aside walnut mixture and cream.",
                "In a large bowl, beat eggs and remaining sugar until thick and lemon-colored; beat in vanilla. In another bowl, mix flour, baking powder, salt and walnut mixture; fold into egg mixture alternately with whipped cream.",
                "Transfer to prepared pans. Bake 25-30 minutes or until a toothpick inserted in center comes out clean. Cool in pans 10 minutes before removing to wire racks; remove parchment. Cool completely.",
                "For frosting, in a small bowl, beat cream until stiff peaks form. In a large bowl, beat cream cheese, sugar, vanilla and salt until blended. Fold in whipped cream.",
                "Using a long serrated knife, cut each cake horizontally in half. Place 1 cake layer on a serving plate; spread with 1/2 cup frosting. Top with a second cake layer. Reserve 2 tablespoons preserves for strawberries; spread half the remaining preserves over top of cake to within 1/2 inch of edge. Repeat layers.",
                "Frost sides of cake with remaining frosting. For a basket weave design, run a small offset spatula around cake to form ridges, stopping and starting at short intervals. Arrange strawberries over top. In a microwave, melt reserved preserves; brush over strawberries. Refrigerate until serving."
            ],
            "nutrition": "1 slice: 491 calories, 26g fat (14g saturated fat), 116mg cholesterol, 215mg sodium, 61g carbohydrate (46g sugars, 1g fiber), 6g protein."
        },
        {
            "name": "Orange Sponge Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps40725_TH1421350D43A-4.jpg",
            "expert": "This was the cake that my dad used to request for his birthday every year. For a wedding present 2 years ago, my aunt Marilyn included this recipe in a family cookbook for me.\r\n—Amy Sauser, Omaha, Nebraska",
            "time": "Prep: 40 min. Bake: 45 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 large eggs, separated",
                "1-1/3 cups cake flour",
                "1-1/2 cups sugar, divided",
                "1/4 teaspoon salt",
                "1/2 cup orange juice",
                "3 teaspoons grated orange zest",
                "3/4 teaspoon cream of tartar",
                "GLAZE:",
                "1/3 cup butter, cubed",
                "2 cups confectioners' sugar",
                "3 to 5 teaspoons water",
                "1-1/2 teaspoons vanilla extract"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Sift the flour, 1/3 cup sugar and salt together twice; set aside.",
                "In another bowl, beat egg yolks on high speed for 5 minutes or until thick and lemon-colored. Gradually beat in 2/3 cup sugar. Add orange juice and zest; beat 3 minutes longer. Gradually add flour mixture and mix well.",
                "Add cream of tartar to egg whites; beat on medium speed until soft peaks form. Gradually beat in remaining sugar, 1 tablespoon at a time, on high until stiff peaks form. Fold into batter.",
                "Gently spoon into an ungreased 10-in. tube pan. Cut through batter with a knife to remove air pockets.",
                "Bake on the lowest oven rack at 325° for 45-55 minutes or until cake springs back when lightly touched. Immediately invert pan; cool completely, about 1 hour.",
                "Run a knife around sides and center tube of pan. Remove cake to a serving plate. For glaze, melt butter in a small saucepan; remove from the heat. Add confectioners’ sugar, water and vanilla; stir until smooth. Pour over cake, allowing it to drizzle down sides."
            ],
            "nutrition": "1 slice: 317 calories, 8g fat (4g saturated fat), 119mg cholesterol, 121mg sodium, 58g carbohydrate (45g sugars, 0 fiber), 4g protein."
        },
        {
            "name": "Strawberry Cream Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps25490_TH1194743D23B.jpg",
            "expert": "“I can’t tell you how many times I’ve made everyone 'ooh' and 'aah' when they see this beautiful dessert. It is wonderful for any occasion.”—Agnes DeLeon, Melrose, Montana",
            "time": "Prep: 45 min. Bake: 35 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "6 eggs, separated",
                "1-1/2 cups sugar, divided",
                "3 tablespoons lemon juice",
                "3 tablespoons canola oil",
                "2 tablespoons water",
                "1-3/4 cups all-purpose flour",
                "1/2 teaspoon salt",
                "2 cups heavy whipping cream",
                "1/2 cup confectioners' sugar",
                "1/2 teaspoon vanilla extract",
                "3 cups sliced fresh strawberries",
                "2 cups whole fresh strawberries"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes.",
                "In another bowl, beat egg yolks until slightly thickened. Gradually add 3/4 cup sugar, beating until thick and lemon-colored. Beat in the lemon juice, oil and water. Combine flour and salt; add to yolk mixture.",
                "Beat egg whites on medium speed until soft peaks form. Gradually add remaining sugar, 1 tablespoon at a time, beating on high until stiff glossy peaks form. Fold a fourth of the egg whites into the batter, then fold in remaining whites.",
                "Gently spoon into an ungreased 10-in. tube pan. Cut through batter with a knife to remove air pockets. Bake on the lowest oven rack at 325° for 35-40 minutes or until or until cake springs back when lightly touched. Immediately invert pan; cool completely, about 1 hour.",
                "In a large bowl, beat cream until it begins to thicken. Add the confectioners' sugar and vanilla; beat until stiff peaks form.",
                "Run a knife around sides and center tube of pan; remove cake.",
                "Cut into three horizontal layers. Place one layer on a serving plate; top with some of the whipped cream and sliced strawberries. Repeat. Top with remaining cake layer; spread remaining whipped cream over top and sides of cake. Arrange remaining sliced berries on sides of cake.",
                "Cut whole berries in half; arrange on cake top. Store in the refrigerator."
            ],
            "nutrition": "1 slice: 408 calories, 21g fat (10g saturated fat), 160mg cholesterol, 150mg sodium, 51g carbohydrate (33g sugars, 2g fiber), 6g protein."
        },
        {
            "name": "Boston Cream Sponge Cakes",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/exps39050_CFT1192412D22A.jpg",
            "expert": "From Harrison, Arizona, Jan Badovinac shares her recipe for these tender, mini sponge cakes filled with vanilla custard and frosted with luscious chocolate. This dessert is sure to impress!",
            "time": "Prep: 30 min. Bake: 15 min. + cooling",
            "makes": "2 servings",
            "ingredients": [
                "2 eggs",
                "6 tablespoons sugar",
                "1/4 teaspoon salt",
                "1/2 teaspoon vanilla extract",
                "1/2 cup all-purpose flour",
                "CUSTARD FILLING:",
                "1/4 cup sugar",
                "2 teaspoons cornstarch",
                "1/2 cup 2% milk",
                "2 egg yolks, lightly beaten",
                "1/2 teaspoon vanilla extract",
                "3 tablespoons butter, softened",
                "CHOCOLATE FROSTING:",
                "1/2 cup confectioners' sugar",
                "5 teaspoons heavy whipping cream",
                "1 tablespoon butter, softened",
                "1/2 ounce unsweetened chocolate",
                "1/2 teaspoon vanilla extract"
            ],
            "directions": [
                "In a small bowl, beat eggs until light and fluffy. Gradually add sugar and salt, beating until thick and lemon-colored, about 5 minutes. Stir in vanilla. Fold in flour, 2 tablespoons at a time.",
                "Gently spoon into two 4-in. springform pans coated with cooking spray (pans will be full). Bake at 350° for 15-20 minutes or until cake springs back when lightly touched. Cool for 10 minutes before removing from pans to a wire rack to cool completely.",
                "For custard, in a small saucepan, combine sugar and cornstarch. Stir in milk until smooth. Cook and stir over medium heat until thickened and bubbly. Reduce heat; cook and stir 2 minutes longer. Remove from the heat. Stir a small amount of hot filling into egg yolks; return all to the pan, stirring constantly. Bring to a gentle boil; cook and stir 2 minutes longer.",
                "Remove from the heat. Gently stir in vanilla. Cool to room temperature without stirring. In a small bowl, cream butter. Gradually beat in custard.",
                "To assemble, cut each cake horizontally in half. Place bottom layers on two serving plates; spread with filling. Replace cake tops. In a small bowl, beat the frosting ingredients. Spread over top of cakes. Refrigerate until serving."
            ],
            "nutrition": "1 each: 931 calories, 42g fat (23g saturated fat), 512mg cholesterol, 633mg sodium, 126g carbohydrate (95g sugars, 1g fiber), 15g protein."
        },
        {
            "name": "Lemony Daffodil Cake",
            "image_url": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Lemony-Daffodil-Cake_exps58617_TH2379797D12_13_5b_RMS.jpg?fit=700,1024",
            "expert": "The lemony yellow color of a daffodil reminds us of springtime and new beginnings. My grandma used to make this cake around Easter every year. In our family, we like to serve this cake cold, right out of the refrigerator. —Lori Kampstra, Franklin, Wisconsin",
            "time": "Prep: 45 min. + cooling Bake: 45 min. + cooling",
            "makes": "12 servings",
            "ingredients": [
                "1-1/4 cups egg whites (about 9)",
                "1 package (2.9 ounces) cook-and-serve lemon pudding mix",
                "1 teaspoon cream of tartar",
                "1/2 teaspoon salt",
                "1-1/3 cups sugar",
                "1 cup all-purpose flour",
                "1/2 teaspoon vanilla extract",
                "4 egg yolks",
                "1/4 teaspoon almond extract",
                "1 cup heavy whipping cream",
                "1/4 cup confectioners' sugar",
                "DAFFODILS:",
                "21 Kraft StackerMallows",
                "2 tablespoons light corn syrup, warmed",
                "2 tablespoons yellow colored sugar"
            ],
            "directions": [
                "Place egg whites in a large bowl; let stand at room temperature for 30 minutes. Meanwhile, prepare pudding according to package directions, reducing water to 2 cups. Transfer to a large bowl; cover and cool to room temperature.",
                "Add cream of tartar and salt to egg whites; beat on medium speed until soft peaks form. Gradually add sugar, 2 tablespoons at a time, beating on high until stiff glossy peaks form. Gradually fold in flour, 1/4 cup at a time.",
                "Divide mixture in half. Fold vanilla into 1 portion; set aside. In another bowl, beat egg yolks on high speed until thick and lemon-colored. Stir in almond extract. Fold in unflavored egg white batter.",
                "Alternately spoon white and yellow batters into an ungreased 10-in. tube pan. Gently cut through batter with a knife to swirl. Bake on the lowest rack at 325° for 45-55 minutes or until top springs back when lightly touched. Immediately invert pan; cool completely, about 1 hour.",
                "In a small bowl, beat cream until it begins to thicken. Add confectioners' sugar; beat until stiff peaks form. Using a whisk, fold into cooled pudding. Cover and refrigerate until chilled.",
                "Cut six marshmallows with a 1-1/4-in. scalloped round cookie cutter; cut holes in the centers with an apple corer or 3/4-in. round cutter. Brush tops with warm corn syrup; dip tops and sides in sugar. Cut 15 marshmallows with a 2-in. teardrop-shaped cookie cutter; brush with corn syrup and coat with sugar.",
                "Run a knife around sides and center tube of pan. Remove cake to a serving plate; split into two horizontal layers. Spread pudding mixture between layers and over top and sides of cake. Just before serving, decorate with cutouts to make daffodils."
            ],
            "nutrition": "1 slice (calculated without daffodils): 290 calories, 10g fat (5g saturated fat), 130mg cholesterol, 186mg sodium, 46g carbohydrate (34g sugars, 0 fiber), 6g protein."
        }
    ]
}